#Область СлужебныеПроцедурыИФункции

Функция ТипыОбъектовСоСтороннимиПечатнымиФормами() Экспорт
	
	Возврат КадровыйЭДОБазовый.ТипыОбъектовСоСтороннимиПечатнымиФормами();
	
КонецФункции

Процедура ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек) Экспорт
	
	КадровыйЭДОРасширенный.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	
КонецПроцедуры

Процедура ПриСозданииФормыСпискаДокументовКЭДО(УправляемаяФорма) Экспорт
	
	КадровыйЭДОРасширенный.ПриСозданииФормыСпискаДокументовКЭДО(УправляемаяФорма);
	
КонецПроцедуры

#КонецОбласти
