#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет команду отчета в список команд.
// 
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   КлючВарианта - Строка -
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - добавленная команда или Неопределено, если нет прав на просмотр отчета.
//
Функция ДобавитьКомандуОтчета(КомандыОтчетов, КлючВарианта = "") Экспорт
	
	Результат = Неопределено;
	
	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.ПланФактныйАнализОплатИНачисленийПоАренде) Тогда
		
		КомандаОтчет = КомандыОтчетов.Добавить();
		КомандаОтчет.Менеджер = Метаданные.Отчеты.ПланФактныйАнализОплатИНачисленийПоАренде.ПолноеИмя();
		КомандаОтчет.Представление = НСтр("ru = 'План-фактный анализ'");
		КомандаОтчет.МножественныйВыбор = Ложь;
		КомандаОтчет.Важность = "Обычное";
		Если ЗначениеЗаполнено(КлючВарианта) Тогда
			КомандаОтчет.КлючВарианта = КлючВарианта;
		КонецЕсли;
		Результат = КомандаОтчет;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли