#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область КомандыПодменюОтчеты

// Добавляет команду отчета в список команд.
// 
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
// 
// Возвращаемое значение:
//   СтрокаТаблицыЗначений: См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//  
Функция ДобавитьКомандуКонтрольПримененияПравила(КомандыОтчетов) Экспорт
	
	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.ПрименениеПравилаРасчетаРезервовПодОбесценение) 
			И (ПолучитьФункциональнуюОпцию("ФормироватьРезервыПодОбесценениеЗапасов")) Тогда
		
		КомандаОтчет = КомандыОтчетов.Добавить();
		
		КомандаОтчет.Менеджер = Метаданные.Отчеты.ПрименениеПравилаРасчетаРезервовПодОбесценение.ПолноеИмя();
		КомандаОтчет.Представление = НСтр("ru = 'Контроль применения правила'");
		
		КомандаОтчет.МножественныйВыбор = Истина;

		Возврат КомандаОтчет;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти
		
#КонецЕсли