#Область ПрограммныйИнтерфейс

#Область ФормированиеПозицийДокументаПоставки

// Рассчитывает и обновляет параметр позиций чека для документа поставки
// 
// Параметры:
// 	ПараметрыФискальногоЧека - Структура - Параметры фискального чека
// 	ОбъектыРасчетовСПризнакамиСпособаРасчетов - ТаблицаЗначений - таблица сумм поставки по объектам расчетов
// 		документа печати чека с детализацией по признакам способа расчета.
&Перед("ОбновитьПараметрыФискальногоЧекаПозицийЧекаПоДокументуПоставки")
Процедура рвк_ОбновитьПараметрыФискальногоЧекаПозицийЧекаПоДокументуПоставки(ПараметрыФискальногоЧека, ОбъектыРасчетовСПризнакамиСпособаРасчетов) Экспорт
	Для Каждого ОбъектРасчетовСПризнакомСпособаРасчетов Из ОбъектыРасчетовСПризнакамиСпособаРасчетов Цикл
		ОбъектРасчетов = ОбъектРасчетовСПризнакомСпособаРасчетов.ОбъектРасчетов;
		СуммаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектРасчетов, "СуммаДокумента");
		ОбъектРасчетовСПризнакомСпособаРасчетов.ПризнакСпособаРасчета =
			?(ОбъектРасчетовСПризнакомСпособаРасчетов.Сумма = СуммаДокумента,
				Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой,
				Перечисления.ПризнакиСпособаРасчета.ПередачаСЧастичнойОплатой);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&Перед("ДополнитьПараметрыФискальногоЧекаПозицийЧекаПоДокументамОплатыСНоменклатурнымиПозициями")
Процедура рвк_ДополнитьПараметрыФискальногоЧекаПозицийЧекаПоДокументамОплатыСНоменклатурнымиПозициями(ПараметрыФискальногоЧека, ПозицииЧека, ОбъектРасчетовСПризнакомСпособаРасчетов, ИмяКомандыПробитияЧека)
	СуммаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектРасчетовСПризнакомСпособаРасчетов.ОбъектРасчетов, "СуммаДокумента");
	ОбъектРасчетовСПризнакомСпособаРасчетов.ПризнакСпособаРасчета =
		?(ОбъектРасчетовСПризнакомСпособаРасчетов.Сумма = СуммаДокумента,
			Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой,
			Перечисления.ПризнакиСпособаРасчета.ПередачаСЧастичнойОплатой)
КонецПроцедуры

#КонецОбласти