
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		ЗаполнитьДокументПоОтбору(ДанныеЗаполнения, СтандартнаяОбработка);
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.ДоговорыАренды") Тогда
		ЗаполнитьНаОснованииДоговораАренды(ДанныеЗаполнения);
	КонецЕсли;
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Комментарий = "";
	
	ОбщегоНазначенияУТ.ОчиститьИдентификаторыДокумента(ЭтотОбъект, "ОС");

	ИнициализироватьДокумент();

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ЗаполнитьРеквизитыПередЗаписью(РежимЗаписи);
	
	Если Не Отказ И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ВнеоборотныеАктивыСлужебный.ПроверитьЧтоОСПринятыКУчету(ЭтотОбъект, Отказ);
	КонецЕсли;

	СозданДляПерехода = ВнеоборотныеАктивы.СозданДляПереходаНаФСБУ25_2018(Дата, Организация);

	ПараметрыВыбораСтатейИАналитик = Документы.ИзменениеУсловийДоговораАренды.ПараметрыВыбораСтатейИАналитик(СозданДляПерехода);
	ДоходыИРасходыСервер.ПередЗаписью(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
	НастройкаСчетовУчетаСервер.ПередЗаписью(ЭтотОбъект, Документы.ИзменениеУсловийДоговораАренды.ПараметрыНастройкиСчетовУчета());
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	МассивНепроверяемыхРеквизитов.Добавить("ОС.СтоимостьБУ");
	МассивНепроверяемыхРеквизитов.Добавить("ОС.СтоимостьУУ");
	МассивНепроверяемыхРеквизитов.Добавить("ОС.СрокИспользованияУУ");
	
	ВспомогательныеРеквизиты = ВспомогательныеРеквизиты();
	
	ВнеоборотныеАктивы.ПроверитьСоответствиеДатыВерсииУчета(ЭтотОбъект, Истина, Отказ);
	ВнеоборотныеАктивы.ПроверитьОтсутствиеДублейВТабличнойЧасти(ЭтотОбъект, "ОС", "ОсновноеСредство", Отказ);
	
	ПараметрыРеквизитовОбъекта = 
		ВнеоборотныеАктивыКлиентСервер.ЗначенияСвойствЗависимыхРеквизитов_ИзменениеУсловийДоговораАренды(ЭтотОбъект, ВспомогательныеРеквизиты);
	ОбщегоНазначенияУТ.ОтключитьПроверкуЗаполненияРеквизитовОбъекта(ПараметрыРеквизитовОбъекта, МассивНепроверяемыхРеквизитов);
	
	ПроверитьОсновныеСредства(ВспомогательныеРеквизиты, Отказ);
	
	СозданДляПерехода = ВнеоборотныеАктивы.СозданДляПереходаНаФСБУ25_2018(Дата, Организация);
	
	ПараметрыВыбораСтатейИАналитик = Документы.ИзменениеУсловийДоговораАренды.ПараметрыВыбораСтатейИАналитик(СозданДляПерехода);
	
	ДоходыИРасходыСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, ПараметрыВыбораСтатейИАналитик);
	
	ВнеоборотныеАктивы.ПроверитьДокументАренды(ЭтотОбъект, ВспомогательныеРеквизиты, МассивНепроверяемыхРеквизитов, Отказ);
	
	ИзменениеУсловийДоговораАрендыЛокализация.ОбработкаПроверкиЗаполнения(ЭтотОбъект, ВспомогательныеРеквизиты, МассивНепроверяемыхРеквизитов, Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Заполнение

Процедура ИнициализироватьДокумент()
	
	Ответственный = Пользователи.ТекущийПользователь();
	Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	
	СтруктураДействий = Новый Структура;
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	СтруктураДействий.Вставить("СкорректироватьСтавкуНДС", ОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(ЭтотОбъект));
	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ЭтотОбъект, СтруктураДействий, КэшированныеЗначения);
	
	Если КэшированныеЗначения.ОбработанныеСтроки.Количество() Тогда
		ВнеоборотныеАктивыКлиентСервер.ПересчитатьСуммуДокументаАренды(ЭтотОбъект);
		ВнеоборотныеАктивыКлиентСервер.ПересчитатьСуммуНДСВДокументеАренды(ЭтотОбъект);
	КонецЕсли;
	
	СозданДляПерехода = ВнеоборотныеАктивы.СозданДляПереходаНаФСБУ25_2018(Дата, Организация);
	
	ПараметрыВыбораСтатейИАналитик = Документы.ИзменениеУсловийДоговораАренды.ПараметрыВыбораСтатейИАналитик(СозданДляПерехода);
	ДоходыИРасходыСервер.ОбработкаЗаполнения(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
КонецПроцедуры

Процедура ЗаполнитьДокументПоОтбору(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения.Свойство("Договор")
	 	И ТипЗнч(ДанныеЗаполнения.Договор) = Тип("СправочникСсылка.ДоговорыАренды") Тогда
		
		ЗаполнитьНаОснованииДоговораАренды(ДанныеЗаполнения.Договор);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииДоговораАренды(ДанныеЗаполнения)
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыДоговора = ВнеоборотныеАктивыСлужебный.ПроверитьРеквизитыДоговораАренды(ДанныеЗаполнения);

	Если РеквизитыДоговора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Организация = РеквизитыДоговора.Организация;
	Партнер = РеквизитыДоговора.Партнер;
	Контрагент = РеквизитыДоговора.Контрагент;
	Договор = ДанныеЗаполнения;
	
	Документы.ИзменениеУсловийДоговораАренды.ЗаполнитьНаОснованииДоговораАренды(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Процедура ЗаполнитьРеквизитыПередЗаписью(РежимЗаписи)

	ВспомогательныеРеквизиты = ВспомогательныеРеквизиты();

	ОчиститьНеиспользуемыеРеквизиты(ВспомогательныеРеквизиты);

	СуммаДокумента = СуммаСНДС;
	СтоимостьПредметовАренды = ОС.Итог("Стоимость");
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Документы.ИзменениеУсловийДоговораАренды.РассчитатьСтавкуСтоимостьПроценты(
			ЭтотОбъект, ВспомогательныеРеквизиты.РеквизитыДоговора);
		
	КонецЕсли;
	
	ОбщегоНазначенияУТ.ЗаполнитьИдентификаторыДокумента(ЭтотОбъект, "ОС");
	
КонецПроцедуры

Процедура ОчиститьНеиспользуемыеРеквизиты(ВспомогательныеРеквизиты)
	
	ПараметрыРеквизитовОбъекта = ВнеоборотныеАктивыКлиентСервер.ЗначенияСвойствЗависимыхРеквизитов_ИзменениеУсловийДоговораАренды(
		ЭтотОбъект, ВспомогательныеРеквизиты);
	
	ОбщегоНазначенияУТКлиентСервер.ОчиститьНеиспользуемыеРеквизиты(
		ЭтотОбъект, 
		ПараметрыРеквизитовОбъекта, 
		"ОС,ГрафикОплатУслуг,ГрафикНачисленияУслуг,ГрафикНачисленияПроцентов");

КонецПроцедуры

Функция ВспомогательныеРеквизиты()

	ВспомогательныеРеквизиты = Новый Структура;
	ВспомогательныеРеквизиты.Вставить("ИспользуетсяУправлениеВНА_2_4", ВнеоборотныеАктивы.ИспользуетсяУправлениеВНА_2_4(Дата));
	ВспомогательныеРеквизиты.Вставить("ИспользуетсяУчетАрендыПоФСБУ25_2018", ВнеоборотныеАктивы.ИспользуетсяУчетАрендыПоФСБУ25_2018(Организация, Дата, Истина));
	ВспомогательныеРеквизиты.Вставить("НачалоУчетаАрендыПоФСБУ25_2018", ВнеоборотныеАктивы.НачалоУчетаАрендыПоФСБУ25_2018(Организация));
	ВспомогательныеРеквизиты.Вставить("НезначащаяСтавкаНДС", УчетНДСУП.НезначащаяСтавка(СтавкаНДС));
	ВспомогательныеРеквизиты.Вставить("ОтражатьВОперативномУчете", Истина);
	ВспомогательныеРеквизиты.Вставить("ВерсияДокумента24", Ложь);
	ВспомогательныеРеквизиты.Вставить("ИмяТабличнойЧастиОС", "ОС");
	
	ВалютаУпр = Константы.ВалютаУправленческогоУчета.Получить();
	ВалютаРегл = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Организация);
	ВспомогательныеРеквизиты.Вставить("ВалютаУпр", ВалютаУпр);
	ВспомогательныеРеквизиты.Вставить("ВалютаРегл", ВалютаРегл);
	ВспомогательныеРеквизиты.Вставить("ВалютыСовпадают", ВалютаУпр = ВалютаРегл);

	ВспомогательныеРеквизиты.Вставить("РеквизитыДоговора", ВнеоборотныеАктивыСлужебный.РеквизитыДоговораАренды(Договор));

	Возврат ВспомогательныеРеквизиты;
	
КонецФункции

Процедура ПроверитьОсновныеСредства(ВспомогательныеРеквизиты, Отказ)

	СписокОС = Новый Массив;
	Для Каждого ДанныеСтроки Из ОС Цикл
		
		Если ЗначениеЗаполнено(ДанныеСтроки.ОсновноеСредство) Тогда
			СписокОС.Добавить(ДанныеСтроки.ОсновноеСредство);
		КонецЕсли;

	КонецЦикла;
	
	Если СписокОС.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = ИзменениеУсловийДоговораАрендыЛокализация.ТекстЗапросаДляПроверкиОсновныхСредств();
	
	Если ТекстЗапроса = Неопределено Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаОС.НомерСтроки КАК НомерСтроки,
		|	ТаблицаОС.ОсновноеСредство КАК ОсновноеСредство,
		|	ТаблицаОС.СтоимостьБУ КАК СтоимостьБУ,
		|	ТаблицаОС.СтоимостьУУ КАК СтоимостьУУ,
		|	ТаблицаОС.СрокИспользованияБУ КАК СрокИспользованияБУ,
		|	ТаблицаОС.СрокИспользованияУУ КАК СрокИспользованияУУ
		|ПОМЕСТИТЬ ТаблицаОС
		|ИЗ
		|	&ТаблицаОС КАК ТаблицаОС
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РезультатПроверки.НомерСтроки КАК НомерСтроки,
		|	РезультатПроверки.ОсновноеСредство КАК ОсновноеСредство,
		|	РезультатПроверки.НеЗаполненаСтоимостьБУ КАК НеЗаполненаСтоимостьБУ,
		|	РезультатПроверки.НеЗаполненаСтоимостьУУ КАК НеЗаполненаСтоимостьУУ,
		|	РезультатПроверки.НеЗаполненСрокИспользованияБУ КАК НеЗаполненСрокИспользованияБУ,
		|	РезультатПроверки.НеЗаполненСрокИспользованияУУ КАК НеЗаполненСрокИспользованияУУ
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаОС.НомерСтроки КАК НомерСтроки,
		|		ТаблицаОС.ОсновноеСредство КАК ОсновноеСредство,
		|
		|		ЕСТЬNULL(ПорядокУчетаОСБУ.СостояниеБУ, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету)
		|			И ТаблицаОС.СтоимостьБУ = 0 КАК НеЗаполненаСтоимостьБУ,
		|
		|		ЕСТЬNULL(ПорядокУчетаОСУУ.Состояние, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету)
		|			И ТаблицаОС.СтоимостьУУ = 0
		|			И НЕ &ВалютыСовпадают КАК НеЗаполненаСтоимостьУУ,
		|
		|		ЕСТЬNULL(ПорядокУчетаОСБУ.СостояниеБУ, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету)
		|			И ТаблицаОС.СрокИспользованияБУ = 0 КАК НеЗаполненСрокИспользованияБУ,
		|
		|		ЕСТЬNULL(ПорядокУчетаОСУУ.Состояние, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету)
		|			И ТаблицаОС.СрокИспользованияУУ = 0 КАК НеЗаполненСрокИспользованияУУ
		|	ИЗ
		|		ТаблицаОС КАК ТаблицаОС
		|
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУчетаОСБУ.СрезПоследних(
		|				&Дата, 
		|				ДатаИсправления = ДАТАВРЕМЯ(1,1,1)
		|					И Организация = &Организация
		|					И ОсновноеСредство В
		|						(ВЫБРАТЬ
		|							ОсновноеСредство
		|						ИЗ
		|							ТаблицаОС)) КАК ПорядокУчетаОСБУ
		|				ПО ПорядокУчетаОСБУ.ОсновноеСредство = ТаблицаОС.ОсновноеСредство
		|
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУчетаОСУУ.СрезПоследних(
		|				&Дата,
		|				ДатаИсправления = ДАТАВРЕМЯ(1,1,1) 
		|					И Организация = &Организация
		|					И ОсновноеСредство В
		|						(ВЫБРАТЬ
		|							ОсновноеСредство
		|						ИЗ
		|							ТаблицаОС)) КАК ПорядокУчетаОСУУ
		|			ПО ПорядокУчетаОСУУ.ОсновноеСредство = ТаблицаОС.ОсновноеСредство
		|
		|	) КАК РезультатПроверки
		|
		|ГДЕ
		|	(РезультатПроверки.НеЗаполненаСтоимостьБУ
		|		ИЛИ РезультатПроверки.НеЗаполненаСтоимостьУУ
		|		ИЛИ РезультатПроверки.НеЗаполненСрокИспользованияБУ
		|		ИЛИ РезультатПроверки.НеЗаполненСрокИспользованияУУ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("ТаблицаОС", ОС.Выгрузить());
	Запрос.УстановитьПараметр("ИспользуетсяУчетАрендыПоФСБУ25_2018", ВспомогательныеРеквизиты.ИспользуетсяУчетАрендыПоФСБУ25_2018);
	Запрос.УстановитьПараметр("ВалютыСовпадают", ВспомогательныеРеквизиты.ВалютыСовпадают);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ШаблонСообщенияСтоимостьБУ = НСтр("ru = 'Не заполнена колонка ""Стоимость (БУ)"" в строке %1 списка ""Предметы аренды""'");
	ШаблонСообщенияСтоимостьУУ = НСтр("ru = 'Не заполнена колонка ""Стоимость (УУ)"" в строке %1 списка ""Предметы аренды""'");
	ШаблонСообщенияСрокИспользованияБУ = НСтр("ru = 'Не заполнена колонка ""Срок использования (бухгалтерский учет)"" в строке %1 списка ""Предметы аренды""'");
	ШаблонСообщенияСрокИспользованияУУ = НСтр("ru = 'Не заполнена колонка ""Срок использования (управленческий учет)"" в строке %1 списка ""Предметы аренды""'");
	
	Пока Выборка.Следующий() Цикл
	
		Если Выборка.НеЗаполненаСтоимостьБУ Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияСтоимостьБУ, Выборка.НомерСтроки);
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ОС", Выборка.НомерСтроки, "СтоимостьБУ");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "", Отказ);
		КонецЕсли;
	
		Если Выборка.НеЗаполненаСтоимостьУУ Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияСтоимостьУУ, Выборка.НомерСтроки);
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ОС", Выборка.НомерСтроки, "СтоимостьУУ");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "", Отказ);
		КонецЕсли;
	
		Если Выборка.НеЗаполненСрокИспользованияБУ Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияСрокИспользованияБУ, Выборка.НомерСтроки);
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ОС", Выборка.НомерСтроки, "СрокИспользованияБУ");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "", Отказ);
		КонецЕсли;
	
		Если Выборка.НеЗаполненСрокИспользованияУУ Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияСрокИспользованияУУ, Выборка.НомерСтроки);
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ОС", Выборка.НомерСтроки, "СрокИспользованияУУ");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "", Отказ);
		КонецЕсли;
	
		ИзменениеУсловийДоговораАрендыЛокализация.СообщитьОПроверкеОсновныхСредств(Выборка, ЭтотОбъект, Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли