///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Изменяет, добавляет, удаляет стандартные команды контактной информации, отображаемые в справочниках и документах,
// Вкл./Выкл. отображение иконок контактной информации слева от заголовка вида контактной информации,
// Изменяет положение кнопки Добавить дополнительное поле контактной информации,
// Изменяет ширину поля комментарий для полей контактной информации с типами Телефон, АдресЭлектроннойПочты, Skype,
// ВебСтраница, Факс
//
// Параметры:
//  Настройки - Структура:
//    * ОтображатьИконки - Булево
//    * ОписаниеКоманд - см. УправлениеКонтактнойИнформацией.ОписаниеКоманд
//    * ПоложениеКнопкиДобавить - ГоризонтальноеПоложениеЭлемента - допустимые значения: Лево, Право, Авто.
//                                                                  Лево - Безусловное положение слева.
//                                                                  Право - Безусловное положение слева.
//                                                                  Авто - Располагается справа, когда контактная
//                                                                         информация в виде поля. Располагается слева,
//                                                                         когда контактная информация в виде
//                                                                         гиперссылки, или ни одно поле контактной
//                                                                         информации не выведено в группе.
//    * ШиринаПоляКомментарий - Число - ширина поля комментарий для полей контактной информации с типами Телефон, АдресЭлектроннойПочты,
//                                      Skype, ВебСтраница, Факс. Данный параметр устанавливается только когда группа
//                                      контактной информации ограничена по ширине.
//
//  Пример:
//     Настройки.ОтображатьИконки = Истина;
//     Настройки.ШиринаПоляКомментарий = 10;
//     Настройки.ПоложениеКнопкиДобавить = ГоризонтальноеПоложениеЭлемента.Авто;
//
//     Адрес = Перечисления.ТипыКонтактнойИнформации.Адрес;
//     Настройки.ОписаниеКоманд[Адрес].ЗапланироватьВстречу.Заголовок  = НСтр("ru='Встреча'");
//     Настройки.ОписаниеКоманд[Адрес].ЗапланироватьВстречу.Подсказка  = НСтр("ru='Создать событие встречи'");
//     Настройки.ОписаниеКоманд[Адрес].ЗапланироватьВстречу.Картинка   = БиблиотекаКартинок.ЗапланированноеВзаимодействие;
//     Настройки.ОписаниеКоманд[Адрес].ЗапланироватьВстречу.Действие   = "_ДемоСтандартныеПодсистемыКлиент.ОткрытьФормуДокументаВстреча";
//    
//     _ДемоФактическийАдресОрганизации = УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени("_ДемоФактическийАдресОрганизации");
//      Настройки.ОписаниеКоманд[_ДемоФактическийАдресОрганизации] = 
//    	ОбщегоНазначения.СкопироватьРекурсивно(УправлениеКонтактнойИнформацией.КомандыТипаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес));
//      Настройки.ОписаниеКоманд[_ДемоФактическийАдресОрганизации].ЗапланироватьВстречу.Действие = ""; // Отключение действия команды для вида
//
//   Процедурам, указанных в свойстве Действие, передаются 2 параметра:
//       КонтактнаяИнформация - Структура:
//         * Представление - Строка
//         * Значение      - Строка
//         * Тип           - ПеречислениеСсылка.ТипыКонтактнойИнформации
//         * Вид           - СправочникСсылка.ВидыКонтактнойИнформации
//       ДополнительныеПараметры - Структура:        
//         * ВладелецКонтактнойИнформации - ОпределяемыйТип.ВладелецКонтактнойИнформации.
//         * Форма - ФормаКлиентскогоПриложения - форма объекта-владельца, предназначенная для вывода контактной информации.
//
//   Пример: 
//     Процедура ОткрытьФормуДокументаВстреча(КонтактнаяИнформация, ДополнительныеПараметры) Экспорт
//		  ЗначенияЗаполнения = Новый Структура;
//		  ЗначенияЗаполнения.Вставить("МестоПроведенияВстречи", КонтактнаяИнформация.Представление);
//		  Если ТипЗнч(ДополнительныеПараметры.ВладелецКонтактнойИнформации) = Тип("ДокументСсылка._ДемоЗаказПокупателя") Тогда
//		    	ЗначенияЗаполнения.Вставить("Предмет", ДополнительныеПараметры.ВладелецКонтактнойИнформации);
//		    	ЗначенияЗаполнения.Вставить("Контакт", "");
//		  Иначе
//		    	ЗначенияЗаполнения.Вставить("Контакт", ДополнительныеПараметры.ВладелецКонтактнойИнформации);
//		    	ЗначенияЗаполнения.Вставить("Предмет", "");
//		  КонецЕсли;
//
//		  ОткрытьФорму("Документ.Встреча.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения),
//			ДополнительныеПараметры.Форма);
//	   КонецПроцедуры
//
Процедура ПриОпределенииНастроек(Настройки) Экспорт

	
    
КонецПроцедуры

// Получает наименования видов контактной информации на разных языках.
//
// Параметры:
//  Наименования - Соответствие из КлючИЗначение - представление вида контактной информации на переданном языке:
//     * Ключ     - Строка - имя вида контактной информации. Например, "_ДемоАдресПартнера".
//     * Значение - Строка - наименование вида контактной информации для переданного кода языка.
//  КодЯзыка - Строка - код языка. Например, "en".
//
// Пример:
//  Наименования["_ДемоАдресПартнера"] = НСтр("ru='Адрес'; en='Address';", КодЯзыка);
//
Процедура ПриПолученииНаименованийВидовКонтактнойИнформации(Наименования, КодЯзыка) Экспорт
	
	Наименования["СправочникКонтактныеЛицаПартнеров"] = НСтр("ru='Контактная информация справочника ""Контактные лица партнеров""';", КодЯзыка);
	Наименования["МобильныйТелефонКонтактногоЛица"] = НСтр("ru='Мобильный телефон';", КодЯзыка);
	Наименования["ТелефонКонтактногоЛица"] = НСтр("ru='Телефон';", КодЯзыка);
	Наименования["EmailКонтактногоЛица"] = НСтр("ru='Электронная почта';", КодЯзыка);
	Наименования["СправочникКонтрагенты"] = НСтр("ru='Контактная информация справочника ""Контрагенты""';", КодЯзыка);
	Наименования["ДругаяИнформацияКонтрагенты"] = НСтр("ru='Другое (любая другая контактная информация)';", КодЯзыка);
	Наименования["МеждународныйАдресКонтрагента"] = НСтр("ru='Международный адрес для платежей (англ.)';", КодЯзыка);
	Наименования["ПочтовыйАдресКонтрагента"] = НСтр("ru='Почтовый адрес';", КодЯзыка);
	Наименования["ТелефонКонтрагента"] = НСтр("ru='Телефон';", КодЯзыка);
	Наименования["ФаксКонтрагенты"] = НСтр("ru='Факс';", КодЯзыка);
	Наименования["ФактАдресКонтрагента"] = НСтр("ru='Фактический адрес';", КодЯзыка);
	Наименования["EmailКонтрагента"] = НСтр("ru='Электронная почта';", КодЯзыка);
	Наименования["ЮрАдресКонтрагента"] = НСтр("ru='Юридический адрес';", КодЯзыка);
	Наименования["СправочникОрганизации"] = НСтр("ru='Контактная информация справочника ""Организации""';", КодЯзыка);
	Наименования["ДругаяИнформацияОрганизации"] = НСтр("ru='Другое';", КодЯзыка);
	Наименования["МеждународныйАдресОрганизации"] = НСтр("ru='Международный адрес для платежей (англ.)';", КодЯзыка);
	Наименования["ПочтовыйАдресОрганизации"] = НСтр("ru='Почтовый адрес';", КодЯзыка);
	Наименования["ТелефонОрганизации"] = НСтр("ru='Телефон';", КодЯзыка);
	Наименования["ФаксОрганизации"] = НСтр("ru='Факс';", КодЯзыка);
	Наименования["ФактАдресОрганизации"] = НСтр("ru='Фактический адрес';", КодЯзыка);
	Наименования["EmailОрганизации"] = НСтр("ru='Электронная почта';", КодЯзыка);
	Наименования["ЮрАдресОрганизации"] = НСтр("ru='Юридический адрес';", КодЯзыка);
	Наименования["СправочникПартнеры"] = НСтр("ru='Контактная информация справочника ""Партнеры""';", КодЯзыка);
	Наименования["АдресПартнера"] = НСтр("ru='Адрес';", КодЯзыка);
	Наименования["ТелефонПартнера"] = НСтр("ru='Телефон';", КодЯзыка);
	Наименования["EmailПартнера"] = НСтр("ru='Электронная почта';", КодЯзыка);
	Наименования["СправочникПользователи"] = НСтр("ru='Контактная информация справочника ""Пользователи""';", КодЯзыка);
	Наименования["ТелефонПользователя"] = НСтр("ru='Телефон';", КодЯзыка);
	Наименования["EmailПользователя"] = НСтр("ru='Электронная почта';", КодЯзыка);
	Наименования["СправочникРегистрацииВНалоговомОргане"] = НСтр("ru='Контактная информация справочника ""Регистрации в налоговом органе""';", КодЯзыка);
	Наименования["АдресНалоговогоОргана"] = НСтр("ru='Адрес налогового органа';", КодЯзыка);
	Наименования["ТелефонНалоговогоОргана"] = НСтр("ru='Телефон налогового органа';", КодЯзыка);
	Наименования["ФактАдресОбособленногоПодразделения"] = НСтр("ru='Фактический адрес обособленного подразделения';", КодЯзыка);
	Наименования["СправочникСклады"] = НСтр("ru='Контактная информация справочника ""Склады""';", КодЯзыка);
	Наименования["АдресСклада"] = НСтр("ru='Адрес склада';", КодЯзыка);
	Наименования["ТелефонСклада"] = НСтр("ru='Телефон склада';", КодЯзыка);
	Наименования["СправочникТорговыеТочки"] = НСтр("ru='Контактная информация справочника ""Торговые точки""';", КодЯзыка);
	Наименования["АдресТорговойТочки"] = НСтр("ru='Адрес';", КодЯзыка);
	Наименования["СправочникФизическиеЛица"] = НСтр("ru='Контактная информация справочника ""Физические лица""';", КодЯзыка);
	Наименования["АдресДляИнформированияФизическиеЛица"] = НСтр("ru='Адрес для информирования';", КодЯзыка);
	Наименования["АдресЗаПределамиРФФизическиеЛица"] = НСтр("ru='Иностранный адрес';", КодЯзыка);
	Наименования["АдресМестаПроживанияФизическиеЛица"] = НСтр("ru='Адрес места проживания';", КодЯзыка);
	Наименования["АдресПоПропискеФизическиеЛица"] = НСтр("ru='Адрес по прописке';", КодЯзыка);
	Наименования["ТелефонДомашнийФизическиеЛица"] = НСтр("ru='Домашний телефон';", КодЯзыка);
	Наименования["ТелефонМобильныйФизическиеЛица"] = НСтр("ru='Мобильный телефон';", КодЯзыка);
	Наименования["ТелефонРабочийФизическиеЛица"] = НСтр("ru='Рабочий телефон';", КодЯзыка);
	Наименования["EMailФизическиеЛица"] = НСтр("ru='Электронная почта';", КодЯзыка);
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлементов
// 
// Параметры:
//  Настройки - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлементов.Настройки
//
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
//
// Параметры:
//  КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//  Элементы   - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//  ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлементов
//
// Параметры:
//  Объект                  - СправочникОбъект.РолиИсполнителей - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения объекта.
//  ДополнительныеПараметры - Структура:
//   * ПредопределенныеДанные - ТаблицаЗначений - данные заполненные в процедуре ПриНачальномЗаполненииЭлементов.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

#КонецОбласти
