#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область КомандыПодменюОтчеты

// Добавляет команду отчета в список команд.
// 
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   
// Возвращаемое значение:
// 	СтрокаТаблицыЗначений -
//
Функция ДобавитьКомандуОтчетаПоНМА(КомандыОтчетов) Экспорт
	
	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.СправкаРасчетАмортизацииНМА_МУ)
		И ВнеоборотныеАктивы.ИспользуетсяУправлениеВНА_2_4()
		И НЕ ВнеоборотныеАктивыСлужебный.ВедетсяРегламентированныйУчетВНА() Тогда
		
		КомандаОтчет = КомандыОтчетов.Добавить();
		
		КомандаОтчет.Менеджер = Метаданные.Отчеты.СправкаРасчетАмортизацииНМА_МУ.ПолноеИмя();
		КомандаОтчет.Представление = НСтр("ru = 'Справка-расчет амортизации'");
		КомандаОтчет.Важность = "Обычное";
		КомандаОтчет.МножественныйВыбор = Истина;
		КомандаОтчет.ДополнительныеПараметры.Вставить("ИмяКоманды", "СправкаРасчетПоНМА");
		КомандаОтчет.КлючВарианта = "СправкаРасчетАмортизацииНМА";
		
		Возврат КомандаОтчет;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Добавляет команду отчета в список команд.
// 
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   
// Возвращаемое значение:
//	СтрокаТаблицыЗначений - Настройки команды.
Функция ДобавитьКомандуОтчетаПоДокументуАмортизацииНМА(КомандыОтчетов) Экспорт
	
	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.СправкаРасчетАмортизацииНМА_МУ)
		И ВнеоборотныеАктивы.ИспользуетсяУправлениеВНА_2_4()
		И НЕ ВнеоборотныеАктивыСлужебный.ВедетсяРегламентированныйУчетВНА() Тогда
		
		КомандаОтчет = КомандыОтчетов.Добавить();
		
		КомандаОтчет.Менеджер = Метаданные.Отчеты.СправкаРасчетАмортизацииНМА_МУ.ПолноеИмя();
		КомандаОтчет.Представление = НСтр("ru = 'Справка-расчет амортизации'");
		КомандаОтчет.Важность = "Обычное";
		КомандаОтчет.МножественныйВыбор = Ложь;
		КомандаОтчет.КлючВарианта = "СправкаРасчетПоДокументуАмортизацииНМАКонтекст";
		КомандаОтчет.ДополнительныеПараметры.Вставить("ИмяКоманды", "СправкаРасчетПоДокументуАмортизацииНМА");
		
		Возврат КомандаОтчет;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецОбласти
		
#КонецЕсли