
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Обработчик команды перехода к сверке имущественного налога из входящего сообщения ФНС
//
// Параметры:
//  Форма     - ФормаКлиентскогоПриложения - форма, из которой выполняется открытие сверки
//  Сообщение - СправочникСсылка.ДокументыРеализацииПолномочийНалоговыхОрганов - входящее сообщение из ФНС
//              с расчетом имущественных налогов
//
Процедура ПерейтиКСверкеПоИмущественномуНалогу(Форма, Сообщение) Экспорт
	
КонецПроцедуры

// Переходит к форме выгрузки документов вида "Платежное поручение"
//
// Параметры:
//  Форма     - ФормаКлиентскогоПриложения - форма, из которой выполняется открытие сверки
//  МассивПлатежныхПоручений - Массив из Ссылка - ссылки на сформированные документы платежей в потребителе
//
Процедура СформироватьВыгрузкуПлатежныхПоручений(Форма, МассивПлатежныхПоручений) Экспорт
	
КонецПроцедуры

#КонецОбласти