#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПриказМобилизация");
	НастройкиВарианта.Описание = НСтр("ru = 'Приказ о приостановлении трудового договора в связи с мобилизацией'");
	НастройкиВарианта.Включен = Ложь;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПриказКонтракт");
	НастройкиВарианта.Описание = НСтр("ru = 'Приказ о приостановлении трудового договора в связи с контрактом'");
	НастройкиВарианта.Включен = Ложь;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПриказСодействие");
	НастройкиВарианта.Описание = НСтр("ru = 'Приказ о приостановлении трудового договора в связи с контрактом о добровольном содействии'");
	НастройкиВарианта.Включен = Ложь;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПриказГражданскиеСлужащиеМобилизация");
	НастройкиВарианта.Описание = НСтр("ru = 'Приказ о приостановлении контракта с гражданским служащим в связи с мобилизацией'");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьГосударственнуюСлужбу");
	НастройкиВарианта.Включен = Ложь;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПриказГражданскиеСлужащиеКонтракт");
	НастройкиВарианта.Описание = НСтр("ru = 'Приказ о приостановлении контракта с гражданским служащим в связи с контрактом'");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьГосударственнуюСлужбу");
	НастройкиВарианта.Включен = Ложь;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПриказГражданскиеСлужащиеСодействие");
	НастройкиВарианта.Описание = НСтр("ru = 'Приказ о приостановлении контракта с гражданским служащим в связи с контрактом о добровольном содействии'");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьГосударственнуюСлужбу");
	НастройкиВарианта.Включен = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьКомандыПечатиПечатныхФормОтчета(КомандыПечати) Экспорт
	
	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.ПечатнаяФормаПриостановлениеТрудовогоДоговора) Тогда
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
		КомандаПечати.МенеджерПечати = "Отчет.ПечатнаяФормаПриостановлениеТрудовогоДоговора";
		КомандаПечати.Идентификатор = "ПФ_MXL_ПриостановлениеМобилизация";
		КомандаПечати.Порядок = 10;
		КомандаПечати.Представление = НСтр("ru = 'Приказ о приостановлении в связи с мобилизацией'");
		КомандаПечати.ДополнительныеПараметры.Вставить("РеквизитыДетализации", "РаботаСотрудник");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати,
			"ОснованиеПриостановления", Справочники.ОснованияПриостановленияТрудовыхДоговоровКонтрактов.Мобилизация3517);
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
		КомандаПечати.МенеджерПечати = "Отчет.ПечатнаяФормаПриостановлениеТрудовогоДоговора";
		КомандаПечати.Идентификатор = "ПФ_MXL_ПриостановлениеКонтракт";
		КомандаПечати.Порядок = 10;
		КомандаПечати.Представление = НСтр("ru = 'Приказ о приостановлении трудового договора в связи с контрактом'");
		КомандаПечати.ДополнительныеПараметры.Вставить("РеквизитыДетализации", "РаботаСотрудник");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати,
			"ОснованиеПриостановления", Справочники.ОснованияПриостановленияТрудовыхДоговоровКонтрактов.Контракт3517);
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
		КомандаПечати.МенеджерПечати = "Отчет.ПечатнаяФормаПриостановлениеТрудовогоДоговора";
		КомандаПечати.Идентификатор = "ПФ_MXL_ПриостановлениеСодействие";
		КомандаПечати.Порядок = 10;
		КомандаПечати.Представление = НСтр("ru = 'Приказ о приостановлении трудового договора в связи с контрактом о добровольном содействии'");
		КомандаПечати.ДополнительныеПараметры.Вставить("РеквизитыДетализации", "РаботаСотрудник");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати,
			"ОснованиеПриостановления", Справочники.ОснованияПриостановленияТрудовыхДоговоровКонтрактов.Содействие3517);
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
		КомандаПечати.МенеджерПечати = "Отчет.ПечатнаяФормаПриостановлениеТрудовогоДоговора";
		КомандаПечати.Идентификатор = "ПФ_MXL_ПриостановлениеГражданскиеСлужащиеМобилизация";
		КомандаПечати.Порядок = 10;
		КомандаПечати.Представление = НСтр("ru = 'Приказ о приостановлении контракта с гражданским служащим в связи с мобилизацией'");
		КомандаПечати.ДополнительныеПараметры.Вставить("РеквизитыДетализации", "РаботаСотрудник");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.ФункциональныеОпции = "ИспользоватьГосударственнуюСлужбу";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати,
			"ОснованиеПриостановления", Справочники.ОснованияПриостановленияТрудовыхДоговоровКонтрактов.Мобилизация531);
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
		КомандаПечати.МенеджерПечати = "Отчет.ПечатнаяФормаПриостановлениеТрудовогоДоговора";
		КомандаПечати.Идентификатор = "ПФ_MXL_ПриостановлениеГражданскиеСлужащиеКонтракт";
		КомандаПечати.Порядок = 10;
		КомандаПечати.Представление = НСтр("ru = 'Приказ о приостановлении контракта с гражданским служащим в связи с контрактом'");
		КомандаПечати.ДополнительныеПараметры.Вставить("РеквизитыДетализации", "РаботаСотрудник");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.ФункциональныеОпции = "ИспользоватьГосударственнуюСлужбу";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати,
			"ОснованиеПриостановления", Справочники.ОснованияПриостановленияТрудовыхДоговоровКонтрактов.Контракт531);
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
		КомандаПечати.МенеджерПечати = "Отчет.ПечатнаяФормаПриостановлениеТрудовогоДоговора";
		КомандаПечати.Идентификатор = "ПФ_MXL_ПриостановлениеГражданскиеСлужащиеСодействие";
		КомандаПечати.Порядок = 10;
		КомандаПечати.Представление = НСтр("ru = 'Приказ о приостановлении контракта с гражданским служащим в связи с контрактом о добровольном содействии'");
		КомандаПечати.ДополнительныеПараметры.Вставить("РеквизитыДетализации", "РаботаСотрудник");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.ФункциональныеОпции = "ИспользоватьГосударственнуюСлужбу";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати,
			"ОснованиеПриостановления", Справочники.ОснованияПриостановленияТрудовыхДоговоровКонтрактов.Содействие531);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ЗарплатаКадрыОтчеты.ВывестиВКоллекциюПечатнуюФорму("Отчет.ПечатнаяФормаПриостановлениеТрудовогоДоговора",
		МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	
КонецПроцедуры

Процедура Сформировать(ДокументРезультат, РезультатКомпоновки, ОбъектыПечати = Неопределено, ПараметрыПечати = Неопределено) Экспорт
	
	Если РезультатКомпоновки.ОтчетПустой Тогда
		Возврат;
	КонецЕсли;
	
	ДокументРезультат.КлючПараметровПечати = "ПараметрыПечати_" + РезультатКомпоновки.ИдентификаторыМакета;
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Организации = Новый Массив;
	Для Каждого ДанныеНаПечать Из РезультатКомпоновки.ДанныеОтчета.Строки Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Организации, ДанныеНаПечать.Строки.ВыгрузитьКолонку("РаботаОрганизация"), Истина);
	КонецЦикла;
	
	АдресаОрганизаций = УправлениеКонтактнойИнформациейЗарплатаКадры.АдресаОрганизаций(Организации);
	Для Каждого ДанныеНаПечать Из РезультатКомпоновки.ДанныеОтчета.Строки Цикл
		
		ПерваяСтрокаПечатнойФормы = ДокументРезультат.ВысотаТаблицы + 1;
		
		Для Каждого ДанныеДетальныхЗаписей Из ДанныеНаПечать.Строки Цикл
			
			НомерСтрокиНачалаОбласти = ДокументРезультат.ВысотаТаблицы + 1;
			
			ДанныеПолучаемыеНаХоду= Новый Структура;
			ОписаниеФактическогоАдреса = УправлениеКонтактнойИнформациейЗарплатаКадры.АдресОрганизации(
				АдресаОрганизаций,
				ДанныеДетальныхЗаписей.РаботаОрганизация,
				Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
			ДанныеПолучаемыеНаХоду.Вставить("РаботаОрганизацияГородФактическогоАдреса", ОписаниеФактическогоАдреса.Город);
			
			Если ДокументРезультат.ВысотаТаблицы > 0 Тогда
				ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ДанныеПользовательскихПолей = ЗарплатаКадрыОтчеты.ЗначенияЗаполненияПользовательскихПолей(РезультатКомпоновки.ИдентификаторыМакета, ДанныеДетальныхЗаписей);
			
			ЗарплатаКадрыОтчеты.ВывестиВДокументРезультатОбластиМакета(
				ДокументРезультат, РезультатКомпоновки.МакетПечатнойФормы, "Бланк",
				ДанныеНаПечать,
				ДанныеДетальныхЗаписей,
				ДанныеПользовательскихПолей,
				ДанныеПолучаемыеНаХоду);
			
			КадровыйЭДО.ЗадатьДетальнуюОбластьПечати(ПараметрыПечати, ДокументРезультат, РезультатКомпоновки.ИдентификаторыМакета, НомерСтрокиНачалаОбласти,
				ДанныеДетальныхЗаписей, ДанныеНаПечать.СсылкаНаОбъект);
			
		КонецЦикла;
		
		Если ОбъектыПечати <> Неопределено Тогда
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ДокументРезультат, ПерваяСтрокаПечатнойФормы, ОбъектыПечати, ДанныеНаПечать.СсылкаНаОбъект);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли