#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)
	
	РазблокируемыеРеквизиты = РазблокируемыеРеквизиты();
	Закрыть(РазблокируемыеРеквизиты);

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИспользованиеОбъекта(Команда)
	
	ПроверитьИспользованиеСчетаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияОбъектИспользуетсяОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "Отчет" Тогда
		ОткрытьОСВПоСчету();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьИспользованиеСчетаНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Счет = Параметры.Объект;
	
	ПолноеИмяОбъектаМетаданных = "";
	
	//++ Локализация

	//++ НЕ УТ
	Если ТипЗнч(Счет) = Тип("ПланСчетовСсылка.Хозрасчетный") Тогда
		ПолноеИмяОбъектаМетаданных = "РегистрБухгалтерии.Хозрасчетный.Обороты(,,, Счет = &Счет,,,,)";
	КонецЕсли;
	//-- НЕ УТ

	//-- Локализация
	
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РегистрБухгалтерииОбороты.Организация КАК Организация
		|ИЗ
		|	&ПолноеИмяОбъектаМетаданных КАК РегистрБухгалтерииОбороты";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяОбъектаМетаданных", ПолноеИмяОбъектаМетаданных);
	
	Запрос = Новый Запрос;
    Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Счет", Счет);
	РезультатЗапроса = Запрос.Выполнить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		Элементы.ГруппаОбъектИспользуетсяСтраницы.ТекущаяСтраница = Элементы.ГруппаОбъектИспользуетсяОбъектНеИспользуется;
		Элементы.РазрешитьРедактирование.Доступность = Истина;
	Иначе

		Элементы.ГруппаОбъектИспользуетсяСтраницы.ТекущаяСтраница = Элементы.ГруппаОбъектИспользуетсяОбъектИспользуется;

		Если Пользователи.ЭтоПолноправныйПользователь() Тогда
			
			Элементы.ДекорацияОбъектИспользуется.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
				НСтр("ru = 'Счет используется в проводках.
					|Выключение признаков учета или удаление видов субконто может привести к удалению данных.
					|Откройте <a href = ""Отчет"">Оборотно-сальдовую ведомость по счету</a>  для просмотра проводок'"));

			Элементы.РазрешитьРедактирование.Доступность = Истина;

		Иначе

			ОрганизацииИзПроводок = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Организация");

			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
			|	Организации.Ссылка КАК Организация
			|ИЗ
			|	Справочник.Организации КАК Организации";

			ДоступныеОрганизации = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация");

			ЕстьНедоступныеОрганизации = Ложь;
			Для Каждого ОрганизацияПроводок Из ОрганизацииИзПроводок Цикл
				Если ДоступныеОрганизации.Найти(ОрганизацияПроводок) = Неопределено Тогда
					ЕстьНедоступныеОрганизации = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ЕстьНедоступныеОрганизации Тогда
				Элементы.ДекорацияОбъектИспользуется.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
					НСтр("ru = 'Счет используется в проводках.
						|Выключение признаков учета или удаление видов субконто может привести к удалению данных.
						|Откройте <a href = ""Отчет"">Оборотно-сальдовую ведомость по счету</a>  для просмотра проводок.
						|Также счет используется в проводках по организациям недоступных для просмотра.'"));
			Иначе
				Элементы.ДекорацияОбъектИспользуется.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
					НСтр("ru = 'Счет используется в проводках.
						|Выключение признаков учета или удаление видов субконто может привести к удалению данных.
						|Откройте <a href = ""Отчет"">Оборотно-сальдовую ведомость по счету</a>  для просмотра проводок.'"));				
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОСВПоСчету()

	Счет = Параметры.Объект;
	
	//++ Локализация

	//++ НЕ УТ
	Если ТипЗнч(Счет) = Тип("ПланСчетовСсылка.Хозрасчетный") Тогда
		
		// Инициализируем параметры расшифровки
		НастройкиРасшифровки = Новый Структура();
		
		// Инициализируем пользовательские настройки
		ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
		ДополнительныеСвойства = ПользовательскиеНастройки.ДополнительныеСвойства;
		ДополнительныеСвойства.Вставить("ПоказательБУ", 	Истина);
		ДополнительныеСвойства.Вставить("РежимРасшифровки", Истина);
		ДополнительныеСвойства.Вставить("НачалоПериода",	Дата(1, 1, 1));
		ДополнительныеСвойства.Вставить("КонецПериода", 	Дата(1, 1, 1));
		ДополнительныеСвойства.Вставить("ПоСубсчетам", 		Истина);
		
		ДополнительныеСвойства.Вставить("Счет", Счет);
		
		// Добавляем группировку по Организация
		ГруппировкаОрганизация = Новый Структура;
		ГруппировкаОрганизация.Вставить("Поле", "Организация");
		ГруппировкаОрганизация.Вставить("Использование",  Истина);
		ГруппировкаОрганизация.Вставить("ТипГруппировки", 0);
		
		// Группировка передается в отчет как массив структур
		// Элемент массива содержит структуру описывающую строку таблицы "Группировка" стандартного отчета.
		ДополнительныеСвойства.Вставить("Группировка", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ГруппировкаОрганизация));
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВидРасшифровки", 2);
		ПараметрыФормы.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки);
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		
		ОткрытьФорму("Отчет.ОборотноСальдоваяВедомостьПоСчету.Форма.ФормаОтчета", ПараметрыФормы, , Истина);
	
	КонецЕсли;
	//-- НЕ УТ

	//-- Локализация

	
КонецПроцедуры


&НаСервере
Функция РазблокируемыеРеквизиты()
	
	РазблокируемыеРеквизиты = Новый Массив;
	Счет = Параметры.Объект;
	
	//++ Локализация

	//++ НЕ УТ
	Если ТипЗнч(Счет) = Тип("ПланСчетовСсылка.Хозрасчетный") Тогда
    	РазблокируемыеРеквизиты = ПланыСчетов.Хозрасчетный.ПолучитьБлокируемыеРеквизитыОбъекта();
	КонецЕсли;
	//-- НЕ УТ

	//-- Локализация
	
	
	Возврат РазблокируемыеРеквизиты;
	
КонецФункции

#Область Прочее

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	ЗапретРедактированияРеквизитовОбъектовУТКлиент.ПроверитьВыполнениеЗадания(
		ЭтаФорма,
		ФормаДлительнойОперации,
		ПараметрыОбработчикаОжидания);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
