
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	УправлениеЭлементами();
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_НаборКонстант" Тогда
		// Изменены настройки программы в панелях администрирования
		УправлениеЭлементами();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьСтруктуруПредприятия(Команда)
	
	ПараметрыФормы = Новый Структура("ТолькоПроизводственныеПодразделения", Истина);
	ОткрытьФорму("Справочник.СтруктураПредприятия.ФормаСписка", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКалендари(Команда)
	
	ОткрытьФорму("Справочник.Календари.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОчередьПроизводственныхПодразделений(Команда)
	
	ОткрытьФорму("Справочник.СтруктураПредприятия.Форма.НастройкаПриоритетовПроизводственныхПодразделений", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПричиныЗадержкиВыполненияЭтаповПроизводства(Команда)
	
	Возврат; // в КА2 не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПараметрыМежоперационныхПереходов(Команда)
	
	Возврат; // в КА2 не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПричиныОтменыПроизводства(Команда)
	
	Возврат; // в КА2 не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМоделиПооперационногоПланирования(Команда)
	
	Возврат; // в КА2 не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСценарииПооперационногоПланирования(Команда)
	
	Возврат; // в КА2 не используется
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементами()
	
	УправлениеПредприятием = ПолучитьФункциональнуюОпцию("УправлениеПредприятием");
	
	#Область ПроизводственнаяСтруктура
	
	//
	ПравоДоступаПодразделения = ПравоДоступа("Просмотр", Метаданные.Справочники.СтруктураПредприятия);
	Элементы.ГруппаСтруктураПредприятия.Видимость = ПравоДоступаПодразделения;
	
	//
	ПравоДоступаРабочиеЦентры  = Ложь;
	Элементы.ГруппаСтруктураРабочихЦентров.Видимость = ПравоДоступаРабочиеЦентры И УправлениеПредприятием;
	
	//
	ПравоДоступаКалендари = ПравоДоступа("Просмотр", Метаданные.Справочники.Календари);
	Элементы.ГруппаКалендари.Видимость = ПравоДоступаКалендари;
	
	// Заголовок группы
	Элементы.ГруппаПроизводственнаяСтруктура.Видимость =
		ПравоДоступаПодразделения
		ИЛИ ПравоДоступаРабочиеЦентры
		ИЛИ ПравоДоступаКалендари;
	#КонецОбласти
	
	#Область МежцеховоеУправление
	
	Элементы.ОткрытьНастройкуОчередиПроизводственныхПодразделений.Видимость = УправлениеПредприятием
		И ПравоДоступа("Просмотр", Метаданные.Справочники.СтруктураПредприятия);
		
	Элементы.ГруппаПричиныЗадержкиЭтаповПроизводства.Видимость = УправлениеПредприятием
		;
	
	Элементы.ГруппаПричиныОтменыПроизводства.Видимость = УправлениеПредприятием
		;
	
	#КонецОбласти
	
	#Область ВнутрицеховоеУправление
	
	Элементы.ГруппаВнутрицеховоеУправление.Видимость = 
		УправлениеПредприятием
			;
	#КонецОбласти
		
КонецПроцедуры

#КонецОбласти
