

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КаталогВыгрузкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборКаталогаЗавершение", ЭтотОбъект);
	ДиалогВыбораФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выгрузить(Команда)
	
	#Если Не ВебКлиент Тогда
		ТекстJSON = ВыгрузитьНаСервере();
		ЗаписьТекста = Новый ЗаписьТекста(Объект.КаталогВыгрузки + "/выгрузка.json");
		ЗаписьТекста.Записать(ТекстJSON);
		ЗаписьТекста.Закрыть();
	#КонецЕсли
	 
КонецПроцедуры


&НаКлиенте
Процедура Загрузить(Команда)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборКаталогаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(ВыбранныеФайлы) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.КаталогВыгрузки = ВыбранныеФайлы[0];
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыгрузитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Сотрудник,
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.ПорядокРасчета,
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.СоставнаяЧасть,
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.СтатьяФинансирования,
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.СпособОтраженияЗарплатыВБухучете,
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.СтатьяРасходов,
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.ОблагаетсяЕНВД,
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Индексируется,
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Год,
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.ДатаНачалаБазовогоПериода,
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.КоличествоМесяцев,
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Организация,
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.ФизическоеЛицо,
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.ИсходныйДокумент,
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.ПоказательПремирования,
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Сумма,
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Сторно,
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Период
		|ИЗ
		|	РегистрНакопления.ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий КАК
		|		ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС.ФизическоеЛицо,
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС.ГоловнаяОрганизация,
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС.Сотрудник,
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС.ПорядокРасчета,
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС.СтатьяФинансирования,
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС.СпособОтраженияЗарплатыВБухучете,
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС.СтатьяРасходов,
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС.ОблагаетсяЕНВД,
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС.СпособУчета,
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС.Сумма,
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС.Период
		|ИЗ
		|	РегистрНакопления.ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС КАК
		|		ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС.Период,
		|	ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС.ФизическоеЛицо,
		|	ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС.ГоловнаяОрганизация,
		|	ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС.Год,
		|	ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС.Страхователь,
		|	ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС.Сумма,
		|	ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС.ДнейБолезниУходаЗаДетьми,
		|	ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС.НачалоПериода,
		|	ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС.ОкончаниеПериода,
		|	ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС.Сторно
		|ИЗ
		|	РегистрНакопления.ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС КАК
		|		ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();


	Результат = Новый Структура;

	ИмяРегистра = "ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий";
	РезультатЗапроса = РезультатыЗапроса[0];
	Колонки = РезультатЗапроса.Колонки;
	РезультатВыборки = РезультатВыборки(РезультатЗапроса);
	Результат.Вставить(ИмяРегистра, РезультатВыборки);
	
	ИмяРегистра = "ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС";
	РезультатЗапроса = РезультатыЗапроса[1];
	Колонки = РезультатЗапроса.Колонки;
	РезультатВыборки = РезультатВыборки(РезультатЗапроса);
	Результат.Вставить(ИмяРегистра, РезультатВыборки);

	ИмяРегистра = "ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС";
	РезультатЗапроса = РезультатыЗапроса[0];
	Колонки = РезультатЗапроса.Колонки;
	РезультатВыборки = РезультатВыборки(РезультатЗапроса);
	Результат.Вставить(ИмяРегистра, РезультатВыборки);

	ЗаписьJSON = Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Результат);
	РезультатJSON = ЗаписьJSON.Закрыть(); 
	
	Возврат РезультатJSON;
	
КонецФункции

&НаСервереБезКонтекста
Функция РезультатВыборки(РезультатЗапроса)
	
	Колонки = РезультатЗапроса.Колонки;
	
	Результат = Новый Структура;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Для Каждого Колонка Из Колонки Цикл
			Значение = XMLСтрока(Выборка[Колонка.Имя]);
			Результат.Вставить(Колонка.Имя, Значение);
		КонецЦикла;
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции


#КонецОбласти