#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбновитьТаблицуТовары(Форма) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблица.Номенклатура,
		|	&Склад
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&Товары КАК ВременнаяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	СУММА(усПродажи.Стоимость) КАК Стоимость,
		|	СУММА(усПродажи.Количество) КАК Количество,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ усПродажи.Партия) КАК КоличествоПартий
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.усПродажи КАК усПродажи
		|		ПО усПродажи.Регистратор = &ДокументРеализации
		|		И усПродажи.АналитикаУчетаНоменклатуры.Номенклатура = ВТ_Товары.Номенклатура
		|ГДЕ
		|	усПродажи.Регистратор = &ДокументРеализации
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Товары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	усОстаткиПоПартиямОстатки.Партия КАК Партия,
		|	ВЫБОР
		|		КОГДА усОстаткиПоПартиямОстатки.КоличествоОстаток <> 0
		|			ТОГДА усОстаткиПоПартиямОстатки.СтоимостьОстаток / усОстаткиПоПартиямОстатки.КоличествоОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СтоимостьЕдиницы
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.усОстаткиПоПартиям.Остатки(&Граница,
		|			(АналитикаУчетаНоменклатуры.Номенклатура, АналитикаУчетаНоменклатуры.МестоХранения) В
		|			(ВЫБРАТЬ
		|				ВТ_Товары.Номенклатура,
		|				ВТ_Товары.Склад
		|			ИЗ
		|				ВТ_Товары КАК ВТ_Товары)) КАК усОстаткиПоПартиямОстатки
		|		ПО усОстаткиПоПартиямОстатки.АналитикаУчетаНоменклатуры.Номенклатура = ВТ_Товары.Номенклатура
		|ГДЕ
		|	усОстаткиПоПартиямОстатки.КоличествоОстаток > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	Партия";
	
	Запрос.УстановитьПараметр("Склад", Форма.Объект.Склад);
	Запрос.УстановитьПараметр("ДокументРеализации", Форма.Объект.Ссылка);
	
	ТаблицаТовары = Форма.Объект.Товары.Выгрузить(, "Номенклатура");
	Запрос.УстановитьПараметр("Товары", ТаблицаТовары);
	
	Граница = Неопределено;
	Если ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда
		Граница = Форма.Объект.Ссылка.МоментВремени();				
	КонецЕсли;
	Запрос.УстановитьПараметр("Граница", Граница);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаПродажиЗаписанная = РезультатыЗапроса[РезультатыЗапроса.ВГраница()-1].Выбрать();
	ВыборкаОстаткиПоПартиям = РезультатыЗапроса[РезультатыЗапроса.ВГраница()].Выбрать();
	
	Для Каждого СтрокаТовары Из Форма.Объект.Товары Цикл
		ВыборкаПродажиЗаписанная.Сбросить();
		ВыборкаОстаткиПоПартиям.Сбросить();
		Если ВыборкаПродажиЗаписанная.НайтиСледующий(СтрокаТовары.Номенклатура, "Номенклатура") Тогда
			СтрокаТовары.усУчетнаяЦена = ВыборкаПродажиЗаписанная.Стоимость / ВыборкаПродажиЗаписанная.Количество; 
		ИначеЕсли ВыборкаОстаткиПоПартиям.НайтиСледующий(СтрокаТовары.Номенклатура, "Номенклатура") Тогда
			СтрокаТовары.усУчетнаяЦена = ВыборкаОстаткиПоПартиям.СтоимостьЕдиницы;
		КонецЕсли;
		СтрокаТовары.усМаржа = СтрокаТовары.Цена / СтрокаТовары.усУчетнаяЦена * 100;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
