
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Заголовок = Параметры.Заголовок;
	
	Для каждого ПараметрыСписокЗначенийСтрока Из Параметры.СписокЗначений Цикл
		
		СписокЗначенийСтрока = СписокЗначений.Добавить();
		
		ЗаполнитьЗначенияСвойств(СписокЗначенийСтрока, ПараметрыСписокЗначенийСтрока);
		
		Если ПустаяСтрока(СписокЗначенийСтрока.Представление) Тогда
		
			СписокЗначенийСтрока.Представление = СокрЛП(СписокЗначенийСтрока.Значение);
		
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура КомандаОтмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры // КомандаОтмена()

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ЭтаФорма.Закрыть(СписокЗначений);
	
КонецПроцедуры // КомандаОК()

&НаКлиенте
Процедура СписокЗначенийПредставлениеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры // СписокЗначенийПредставлениеОчистка()

&НаКлиенте
Процедура СписокЗначенийПриИзменении(Элемент)

	Выбрано = 0;
	Для каждого СписокЗначенийСтрока Из СписокЗначений Цикл
	
		Если СписокЗначенийСтрока.Пометка Тогда
		
			Выбрано = Выбрано + 1;
		
		КонецЕсли;
	
	КонецЦикла;
	
	ЭтаФорма.Подсказка = "Выбрано " + Выбрано + " из " + СписокЗначений.Количество();
	
КонецПроцедуры // СписокЗначенийПриИзменении()

&НаКлиенте
Процедура СписокЗначенийПометкаПриИзменении(Элемент)
	
	СписокЗначенийПриИзменении(Элементы.СписокЗначений);
	
КонецПроцедуры // СписокЗначенийПометкаПриИзменении()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СписокЗначенийПриИзменении(Элементы.СписокЗначений);
	
КонецПроцедуры // ПриОткрытии()