////////////////////////////////////////////////////////////////////////////////
// Содержит события форм, вызываемые на сервере
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма					- ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//  Отказ					- Булево - признак отказа от создания формы.
//  СтандартнаяОбработка	- Булево - признак выполнения стандартной (системной) обработки события
//  ДополнительныеПараметры	- Структура - дополнительные параметры.
//

&После("ПриСозданииНаСервере")
Процедура рвк_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	Если Форма.ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		Элементы = Форма.Элементы;
		Элемент = Элементы.Вставить("ЗадолженностьСтрокой", Тип("ДекорацияФормы"), Элементы.ГруппаШапкаЛево, Элементы.ГруппаКонтрагент);
		Элемент.Вид = ВидДекорацииФормы.Надпись;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти