#Область ПрограммныйИнтерфейс

// Возвращает строку - имя флажка который определяет необходимость открытия формы "ТекущиеДелаПоСЭДО" при запуске.
//   Для переопределения значения флажка необходимо в процедуре ПриДобавленииПараметровРаботыКлиентаПриЗапуске
//   модуля ОбщегоНазначенияПереопределяемый добавить следующий код:
// 		Параметры.Вставить(СЭДОФССКлиентСервер.ИмяФлажкаПоказыватьТекущиеДелаПоСЭДО(), <ЗначениеФлажка>);
//
Функция ИмяФлажкаПоказыватьТекущиеДелаПоСЭДО() Экспорт
	Возврат "ПоказыватьТекущиеДелаПоСЭДО";
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область Картинки

Функция ИндексКартинкиНеПроведен() Экспорт
	Возврат 1;
КонецФункции

Функция ИндексКартинкиПроведен() Экспорт
	Возврат 2;
КонецФункции

Функция ИндексКартинкиУдален() Экспорт
	Возврат 3;
КонецФункции

Функция ИндексКартинкиОстановлен() Экспорт
	Возврат 4;
КонецФункции

Функция ИндексКартинкиНеПланируетсяОтправлять() Экспорт
	Возврат 5;
КонецФункции

Функция ИндексКартинкиПредупреждение() Экспорт
	Возврат 6;
КонецФункции

Функция ИндексКартинкиОтправлен() Экспорт
	Возврат 7;
КонецФункции

Функция ИндексКартинкиНеПринят() Экспорт
	Возврат 8;
КонецФункции

#КонецОбласти

#Область Организации

Функция ОтборыПоОрганизациямФормы(Форма) Экспорт
	Результат = Новый Структура("ГоловнаяОрганизация, Организации");
	
	ИменаРеквизитов = "ГоловнаяОрганизация, Организации, Организация, Объект, Запись";
	РеквизитыФормы = ОбщегоНазначенияБЗККлиентСервер.ЗначенияСвойств(Форма, ИменаРеквизитов);
	
	ИменаРеквизитов = "ГоловнаяОрганизация, Организация";
	Если РеквизитыФормы.Объект = Неопределено Тогда
		РеквизитыОбъекта = ОбщегоНазначенияБЗККлиентСервер.ЗначенияСвойств(РеквизитыФормы.Запись, ИменаРеквизитов);
	Иначе
		РеквизитыОбъекта = ОбщегоНазначенияБЗККлиентСервер.ЗначенияСвойств(РеквизитыФормы.Объект, ИменаРеквизитов);
	КонецЕсли;
	
	Если ТипЗнч(РеквизитыФормы.Организации) = Тип("СписокЗначений")
		И РеквизитыФормы.Организации.Количество() > 0 Тогда
		Результат.Организации = РеквизитыФормы.Организации;
	ИначеЕсли СсылкаОрганизацииЗаполнена(РеквизитыФормы.Организация) Тогда
		Результат.Организации = Новый СписокЗначений;
		Результат.Организации.Добавить(РеквизитыФормы.Организация);
	ИначеЕсли СсылкаОрганизацииЗаполнена(РеквизитыОбъекта.Организация) Тогда
		Результат.Организации = Новый СписокЗначений;
		Результат.Организации.Добавить(РеквизитыОбъекта.Организация);
	КонецЕсли;
	
	Если СсылкаОрганизацииЗаполнена(РеквизитыФормы.ГоловнаяОрганизация) Тогда
		Результат.ГоловнаяОрганизация = РеквизитыФормы.ГоловнаяОрганизация;
	Иначе
		Результат.ГоловнаяОрганизация = РеквизитыОбъекта.ГоловнаяОрганизация;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция СсылкаОрганизацииЗаполнена(Организация) Экспорт
	Возврат ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") И Не Организация.Пустая();
КонецФункции

#КонецОбласти

#КонецОбласти

