#Область СлужебныйПрограммныйИнтерфейс

// Налогообложение НДС.
// 
// Параметры:
//  Организация - СправочникСсылка.Организации
//  Партнер - СправочникСсылка.Партнеры
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ТипыНалогообложенияНДС - Налогообложение НДС
Функция НалогообложениеНДС(Организация, Партнер) Экспорт
	Перем Результат;
	
	НаименованиеПартнера = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Партнер, "Наименование");	
	ОрганизацияИНН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ИНН");
	ОрганизацияИП = ОрганизацияИНН = "772161119773";
	ПартнерЧастноеЛицо = СтрНачинаетсяС(НаименованиеПартнера, "Частное лицо"); 		
	Если ОрганизацияИП И ПартнерЧастноеЛицо Тогда
		Результат = Перечисления.ТипыНалогообложенияНДС.ПродажаПоПатенту;
	ИначеЕсли ОрганизацияИП И НЕ ПартнерЧастноеЛицо Тогда
		Результат = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
	Иначе
		Результат = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Партнер - наша организация.
// 
// Параметры:
//  Партнер - СправочникСсылка.Партнеры
// 
// Возвращаемое значение:
//  Булево
Функция ПартнерНашаОрганизация(Партнер) Экспорт
	
	ИмяСвойста = "ЭтоНашаОрганизация_f3674409091449fe9648a780ea00ab03";
	Результат = рвк_ОбщегоНазначения.ЗначениеСвойства(Партнер, ИмяСвойста, Ложь);
	
	Возврат Результат;
	
КонецФункции

// Создавать счетфактур автоматически.
// 
// Параметры:
//  Организация - СправочникСсылка.Организации
// 
// Возвращаемое значение:
//  Булево
Функция СоздаватьСчетфактурАвтоматически(Организация) Экспорт

	ИмяСвойста = "СоздаватьСчетфактурАвтоматически_8ca57267cf054884a995902e23783f85";
	Результат = рвк_ОбщегоНазначения.ЗначениеСвойства(Организация, ИмяСвойста, Ложь);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти