
#Область ПрограммныйИнтерфейс

Функция НалогообложениеНДС(Организация, Партнер) Экспорт
	Перем Результат;
	
	НаименованиеПартнера = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Партнер, "Наименование");	
	ОрганизацияИНН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ИНН");
	ОрганизацияИП = ОрганизацияИНН = "772161119773";
	ПартнерЧастноеЛицо = СтрНачинаетсяС(НаименованиеПартнера, "Частное лицо"); 		
	Если ОрганизацияИП И ПартнерЧастноеЛицо Тогда
		Результат = Перечисления.ТипыНалогообложенияНДС.ПродажаПоПатенту;
	ИначеЕсли ОрганизацияИП И НЕ ПартнерЧастноеЛицо Тогда
		Результат = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
	Иначе
		Результат = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
