#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//  Форма - ФормаКлиентскогоПриложения -
Процедура ЛетДоУничтоженияПерсональныхДанныхСотрудниковПриИзменении(Форма) Экспорт
	
	КоличествоЛет = Форма.ЛетДоУничтоженияПерсональныхДанныхСотрудников; // Число
	ЗарплатаКадрыВызовСервера.УстановитьЗначениеКонстанты("ЛетДоУничтоженияПерсональныхДанныхСотрудников",
		КоличествоЛет);
		
	ПредставлениеЛет = СтрРазделить(ЗарплатаКадрыКлиентСервер.ПредставлениеЛет(КоличествоЛет), " ");
	Форма.Элементы.ПолеЛетДоУничтоженияПерсональныхДанныхСотрудников.Заголовок =
		СтрШаблон(НСтр("ru = '%1'"), ?(ПредставлениеЛет.Количество() > 1, ПредставлениеЛет[1], "лет"));
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Оповестить("Запись_НаборКонстант", Новый Структура, "ЛетДоУничтоженияПерсональныхДанныхСотрудников");
	
КонецПроцедуры

// Параметры:
//  Форма - ФормаКлиентскогоПриложения - настраиваемая форма.
Процедура НастройкиУничтоженияПерсональныхДанныхПриИзменении(Форма) Экспорт
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ЛетДоУничтоженияПерсональныхДанныхСотрудниковГруппа",
		"Видимость",
		Форма.НаборКонстант.ИспользоватьСкрытиеПерсональныхДанныхСубъектов);
	
КонецПроцедуры
	
#КонецОбласти
