#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВариантыРаспределенияРасходовПоНастройкамСтатьиРасходов();
КонецПроцедуры

&НаКлиенте
Процедура СтатьяРасходовПриИзменении(Элемент)
	СтатьяРасходовПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СтатьяРасходовПриИзмененииНаСервере()
	УстановитьВариантыРаспределенияРасходовПоНастройкамСтатьиРасходов();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзмененыНастройкиРаспределенияПостатейныхРасходов");
КонецПроцедуры

#КонецОбласти


#Область Прочее

&НаСервере
Процедура УстановитьВариантыРаспределенияРасходовПоНастройкамСтатьиРасходов()
	
	СтатьяРасходов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись.СтатьяРасходов, 
		"ВариантРаспределенияРасходовУпр,ВариантРаспределенияРасходовРегл,ВариантРаспределенияРасходовНУ") ;
	ВариантРаспределенияРасходовУпр =	СтатьяРасходов.ВариантРаспределенияРасходовУпр;
	ВариантРаспределенияРасходовРегл =	СтатьяРасходов.ВариантРаспределенияРасходовРегл;
	ВариантРаспределенияРасходовНУ =	СтатьяРасходов.ВариантРаспределенияРасходовНУ;

	МожноНастроитьУпр = 
		Перечисления.ВариантыРаспределенияРасходов.ВариантИспользуетПравилоРаспределения(ВариантРаспределенияРасходовУпр);
	МожноНастроитьРегл = 
		Перечисления.ВариантыРаспределенияРасходов.ВариантИспользуетПравилоРаспределения(ВариантРаспределенияРасходовРегл);
	МожноНастроитьНУ = НЕ ВариантРаспределенияРасходовНУ = ВариантРаспределенияРасходовРегл И 
		Перечисления.ВариантыРаспределенияРасходов.ВариантИспользуетПравилоРаспределенияНУ(ВариантРаспределенияРасходовНУ);

	Если НЕ МожноНастроитьУпр И ЗначениеЗаполнено(Запись.НастройкаУпр) Тогда
		Запись.НастройкаУпр = Неопределено;
		Модифицированность = Истина;
	КонецЕсли;
	Если НЕ МожноНастроитьРегл И ЗначениеЗаполнено(Запись.НастройкаРегл) Тогда
		Запись.НастройкаРегл = Неопределено;
		Модифицированность = Истина;
	КонецЕсли;
	Если НЕ МожноНастроитьНУ И ЗначениеЗаполнено(Запись.НастройкаНУ) Тогда
		Запись.НастройкаНУ = Неопределено;
		Модифицированность = Истина;
	КонецЕсли;
	
	Элементы.НастройкаУпр.Доступность =		МожноНастроитьУпр;
	Элементы.НастройкаРегл.Доступность =	МожноНастроитьРегл;
	Элементы.НастройкаНУ.Доступность =		МожноНастроитьНУ;
	Элементы.НастройкаУпр.ПодсказкаВвода =	?(МожноНастроитьУпр,"","не настраивается в разрезе организаций и подразделний");
	Элементы.НастройкаРегл.ПодсказкаВвода =	?(МожноНастроитьРегл,"","не настраивается в разрезе организаций и подразделний");
	Элементы.НастройкаНУ.ПодсказкаВвода =	?(МожноНастроитьНУ,"","не настраивается в разрезе организаций и подразделний");
	
	// Настройки отборов и параметров создания новых правил
	НазначениеПравилаУпр = Справочники.ПравилаРаспределенияРасходов.ПолучитьНазначениеПравилаПоВариантуРаспределения(ВариантРаспределенияРасходовУпр);
	НазначениеПравилаРегл = Справочники.ПравилаРаспределенияРасходов.ПолучитьНазначениеПравилаПоВариантуРаспределения(ВариантРаспределенияРасходовРегл);
	НазначениеПравилаНУ = Справочники.ПравилаРаспределенияРасходов.ПолучитьНазначениеПравилаПоВариантуРаспределения(ВариантРаспределенияРасходовНУ);
	
КонецПроцедуры

#КонецОбласти
