#Область ПрограммныйИнтерфейс

&После("ОпределитьРазделыСВариантамиОтчетов")
Процедура усОпределитьРазделыСВариантамиОтчетов(Разделы) Экспорт
	
	Разделы.Добавить(Метаданные.Подсистемы.ус_УчетСебестоимости, НСтр("ru = 'Учет себестоимости'"));
	
КонецПроцедуры

&После("ПриОпределенииНастроек")
Процедура усПриОпределенииНастроек(Настройки) Экспорт
	
//	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.усПродажиИСебестоимость);
//
//	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПоНоменклатуре");
//	ОписаниеВарианта.Описание = НСтр("ru = 'Продажи с себестоимостью по номенклатуре.'");
//	
//	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПоТП");
//	ОписаниеВарианта.Описание = НСтр("ru = 'Продажи с себестоимостью по Торговым представителям.'");
//	
//	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПоПроизводителям");
//	ОписаниеВарианта.Описание = НСтр("ru = 'Продажи с себестоимостью по производителям.'");
//	
КонецПроцедуры

#КонецОбласти