#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ПриЗаписи")
Процедура ус_ПриЗаписи(Отказ, Замещение)

	Если Отказ Или ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Регистратор = Отбор.Регистратор.Значение;
	усУправлениеСебестоимостью.ДобавитьДвиженияОстаткиПоПартиям(Регистратор);
	Если Не усУправлениеПоследовательностью.ЕстьДокументыПослеЭтого(Регистратор) Тогда
		усУправлениеПоследовательностью.УстановитьГраницуПоследовательности(Регистратор);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли