
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает текст подсказки по источнику состава наборов
//
// Параметры:
//  Источник - ПеречислениеСсылка.ИсточникиСоставаНаборовВПроизводстве
// 
// Возвращаемое значение:
//  Строка - подсказка по по источнику состава наборов.
//
Функция ПодсказкаПоИсточникуСоставаНаборов(Источник) Экспорт
	
	ТекстПодсказки =  "";
	
	
	Возврат ТекстПодсказки;
	
КонецФункции

// Заполняет список выбора источника состава набора
// 
// Параметры:
//  Список - СписокЗначений из ПеречислениеСсылка.ИсточникиСоставаНаборовВПроизводстве
Процедура ЗаполнитьСписокВыбораИсточниковСоставаНаборов(Список) Экспорт
	
	Список.Очистить();
	
	
	Список.Добавить(Перечисления.ИсточникиСоставаНаборовВПроизводстве.ВариантыКомплектации, НСтр("ru = 'вариантами комплектации'"));
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
