////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы библиотеки КомплекснаяАвтоматизация.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область СведенияОБиблиотекеИлиКонфигурации

// Заполняет основные сведения о библиотеке или основной конфигурации.
// Библиотека, имя которой имя совпадает с именем конфигурации в метаданных, определяется как основная конфигурация.
// 
// Параметры:
//  Описание - Структура - сведения о библиотеке:
//
//   * Имя                 - Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//   * Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//   * ТребуемыеПодсистемы - Массив - имена других библиотек (Строка), от которых зависит данная библиотека.
//                                    Обработчики обновления таких библиотек должны быть вызваны ранее
//                                    обработчиков обновления данной библиотеки.
//                                    При циклических зависимостях или, напротив, отсутствии каких-либо зависимостей,
//                                    порядок вызова обработчиков обновления определяется порядком добавления модулей
//                                    в процедуре ПриДобавленииПодсистем общего модуля
//                                    ПодсистемыКонфигурацииПереопределяемый.
//   * РежимВыполненияОтложенныхОбработчиков - Строка - "Последовательно" - отложенные обработчики обновления выполняются
//                                    последовательно в интервале от номера версии информационной базы до номера
//                                    версии конфигурации включительно или "Параллельно" - отложенный обработчик после
//                                    обработки первой порции данных передает управление следующему обработчику, а после
//                                    выполнения последнего обработчика цикл повторяется заново.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя    = "КомплекснаяАвтоматизация";
	Описание.Версия = "2.5.12.195";
	Описание.РежимВыполненияОтложенныхОбработчиков = "Параллельно";
	Описание.ИдентификаторИнтернетПоддержки = "ARAutomation";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОбновленияИнформационнойБазы

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	ОбновлениеИнформационнойБазыКА.ПриДобавленииОбработчиковОбновленияКА(Обработчики);
	РегистрыНакопления.РезервыТоваровОрганизаций.ПриДобавленииОбработчиковОбновления(Обработчики);
	РегистрыСведений.СтатусыПроверкиДокументов.ПриДобавленииОбработчиковОбновления(Обработчики);
	Справочники.ПартииПроизводства.ПриДобавленииОбработчиковОбновления(Обработчики);
	РегистрыСведений.НормативнаяДлительностьЭтаповПроизводства.ПриДобавленииОбработчиковОбновления(Обработчики);
	Справочники.РесурсныеСпецификации.ПриДобавленииОбработчиковОбновления(Обработчики);
	РегистрыСведений.СпецификацииИзделий.ПриДобавленииОбработчиковОбновления(Обработчики);
	Справочники.МоделиБюджетирования.ПриДобавленииОбработчиковОбновления(Обработчики);
	РегистрыНакопления.РезервыПредстоящихРасходов.ПриДобавленииОбработчиковОбновления(Обработчики);
	Документы.НачислениеСписаниеРезервовПредстоящихРасходов.ПриДобавленииОбработчиковОбновления(Обработчики);
	Документы.ОтчетПереработчика2_5.ПриДобавленииОбработчиковОбновления(Обработчики);
	РегистрыНакопления.ПланыПотребленияМатериалов.ПриДобавленииОбработчиковОбновления(Обработчики);
	РегистрыНакопления.ДвиженияПоПрочимАктивамПассивам.ПриДобавленииОбработчиковОбновления(Обработчики);
	Справочники.Резервы.ПриДобавленииОбработчиковОбновления(Обработчики);
	
	ВнеоборотныеАктивы.ПриДобавленииОбработчиковОбновления(Обработчики);
	
КонецПроцедуры

// Вызывается перед процедурами-обработчиками обновления данных ИБ.
//
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
КонецПроцедуры

// Вызывается после завершения обновления данных ИБ.
// 
// Параметры:
//   ПредыдущаяВерсия       - Строка - версия до обновления. "0.0.0.0" для "пустой" ИБ.
//   ТекущаяВерсия          - Строка - версия после обновления.
//   ВыполненныеОбработчики - ДеревоЗначений - список выполненных процедур-обработчиков обновления,
//                                             сгруппированных по номеру версии.
//   ВыводитьОписаниеОбновлений - Булево - (возвращаемое значение) если установить Истина,
//                                то будет выведена форма с описанием обновлений. По умолчанию, Истина.
//   МонопольныйРежим           - Булево - Истина, если обновление выполнялось в монопольном режиме.
//
// Пример обхода выполненных обработчиков обновления:
//
//	Для Каждого Версия Из ВыполненныеОбработчики.Строки Цикл
//		
//		Если Версия.Версия = "*" Тогда
//			// Обработчик, который может выполнятся при каждой смене версии.
//		Иначе
//			// Обработчик, который выполняется для определенной версии.
//		КонецЕсли;
//		
//		Для Каждого Обработчик Из Версия.Строки Цикл
//			...
//		КонецЦикла;
//		
//	КонецЦикла;
//
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
	ОбновлениеИнформационнойБазыУТ.ПослеОбновленияИнформационнойБазы(ПредыдущаяВерсия, ТекущаяВерсия,
		ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим);
	
КонецПроцедуры

// Вызывается при подготовке табличного документа с описанием изменений в программе.
//
// Параметры:
//   Макет - ТабличныйДокумент - описание обновления всех библиотек и конфигурации.
//           Макет можно дополнить или заменить.
//           См. общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - с колонками:
//    * ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//    * Процедура                 - Строка - полное имя процедуры-обработчика перехода с программы ПредыдущееИмяКонфигурации. 
//                                  Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//                                  Обязательно должна быть экспортной.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.ПредыдущееИмяКонфигурации  = "КомплекснаяАвтоматизация";
//  Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.ПредыдущееИмяКонфигурации = "УправлениеТорговлей";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыКА.ОбновлениеУТДоКА";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.ПредыдущееИмяКонфигурации = "УправлениеТорговлей";
	Обработчик.Процедура = "Справочники.НастройкиХозяйственныхОпераций.ЗаполнитьПредопределенныеНастройкиХозяйственныхОпераций";
	
	ОбновлениеИнформационнойБазыЛокализация.ПриДобавленииОбработчиковПереходаНаКА(Обработчики);
	
КонецПроцедуры

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается после выполнения всех процедур-обработчиков перехода с другой программы (с другим именем конфигурации),
// и до начала выполнения обновления данных ИБ.
//
// Параметры:
//  ПредыдущееИмяКонфигурации    - Строка - имя конфигурации до перехода.
//  ПредыдущаяВерсияКонфигурации - Строка - имя предыдущей конфигурации (до перехода).
//  Параметры                    - Структура: 
//    * ВыполнитьОбновлениеСВерсии   - Булево - по умолчанию Истина. Если установить Ложь, 
//        то будут выполнена только обязательные обработчики обновления (с версией "*").
//    * ВерсияКонфигурации           - Строка - номер версии после перехода. 
//        По умолчанию, равен значению версии конфигурации в свойствах метаданных.
//        Для того чтобы выполнить, например, все обработчики обновления с версии ПредыдущаяВерсияКонфигурации, 
//        следует установить значение параметра в ПредыдущаяВерсияКонфигурации.
//        Для того чтобы выполнить вообще все обработчики обновления, установить значение "0.0.0.1".
//    * ОчиститьСведенияОПредыдущейКонфигурации - Булево - по умолчанию Истина. 
//        Для случаев когда предыдущая конфигурация совпадает по имени с подсистемой текущей конфигурации, следует
//        указать Ложь.
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, 
	Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	
	Если ПредыдущееИмяКонфигурации = "УправлениеТорговлей" Тогда
		Параметры.ОчиститьСведенияОПредыдущейКонфигурации = Ложь;
		ОбновлениеИнформационнойБазы.УстановитьВерсиюИБ(ПредыдущееИмяКонфигурации, ПредыдущаяВерсияКонфигурации, Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПереименованныеОбъектыМетаданных

// Заполняет переименования объектов метаданных (подсистемы и роли).
// Подробнее см. ОбщегоНазначенияПереопределяемый.ПриДобавленииПереименованийОбъектовМетаданных.
// 
// Параметры:
//   Итог	- Структура - передается в процедуру подсистемой БазоваяФункциональность.
//
Процедура ПриДобавленииПереименованийОбъектовМетаданных(Итог) Экспорт
	
	ОписаниеПодсистемы = Новый Структура("Имя, Версия, РежимВыполненияОтложенныхОбработчиков, ИдентификаторИнтернетПоддержки");
	ПриДобавленииПодсистемы(ОписаниеПодсистемы);
	
	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"2.1.1.19",
		"Роль.РазделПроизводство",
		"Роль.ПодсистемаПроизводство",
		ОписаниеПодсистемы.Имя);
	
	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"2.1.1.59",
		"Подсистема.Производство.Подсистема.МежцеховоеУправление",
		"Подсистема.Производство.Подсистема.МежцеховоеУправление2_1",
		ОписаниеПодсистемы.Имя);
		
	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"2.1.1.59",
		"Подсистема.Производство.Подсистема.ВнутрицеховоеУправление",
		"Подсистема.Производство.Подсистема.ВнутрицеховоеУправление2_1",
		ОписаниеПодсистемы.Имя);
		
	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"2.1.1.59",
		"Подсистема.Производство.Подсистема.МатериальныйУчет",
		"Подсистема.Производство.Подсистема.МатериальныйУчет2_1",
		ОписаниеПодсистемы.Имя);
		
	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"2.1.1.72",
		"Подсистема.Производство.Подсистема.ПроизводственныеЗатраты",
		"Подсистема.Производство.Подсистема.ПроизводственныеЗатраты2_1",
		ОписаниеПодсистемы.Имя);
		
	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"2.1.1.72",
		"Подсистема.Производство.Подсистема.АнализСебестоимости",
		"Подсистема.Производство.Подсистема.АнализСебестоимости2_1",
		ОписаниеПодсистемы.Имя);
		
	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"2.5.2.10",
		"Роль.ДобавлениеИзменениеРегистрацийНаработок",
		"Роль.ДобавлениеИзменениеНаработкиОбъектовЭксплуатации",
		ОписаниеПодсистемы.Имя);	
	
	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"2.5.6.1",
		"Подсистема.ВнеоборотныеАктивы.Подсистема.Лизинг",
		"Подсистема.ВнеоборотныеАктивы.Подсистема.Аренда",
		ОписаниеПодсистемы.Имя);
	
	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"2.5.6.1",
		"Роль.ЧтениеДоговоровЛизинга",
		"Роль.ЧтениеДоговоровАренды",
		ОписаниеПодсистемы.Имя);
	
	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"2.5.6.1",
		"Роль.ДобавлениеИзменениеПриобретенийУслугПоЛизингу",
		"Роль.ДобавлениеИзменениеПоступленийУслугПоАренде",
		ОписаниеПодсистемы.Имя);
	
	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"2.5.6.1",
		"Роль.ЧтениеПриобретенийУслугПоЛизингу",
		"Роль.ЧтениеПоступленийУслугПоАренде",
		ОписаниеПодсистемы.Имя);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполненияПустойИБ

// Обработчик первого запуска КА.
//
Процедура ПервыйЗапуск() Экспорт
	
	УстановитьВалютуПлановыхЦен();
	УстановитьВалютуРасценокВидовРабот();
	
	ЗаполнитьКонстантуИспользоватьБюджетирование();
	ПланыВидовХарактеристик.АналитикиСтатейБюджетов.ЗаполнитьПредопределенныеАналитикиСтатейБюджетов();
	Константы.ЗаполненыДвиженияАктивовПассивов.Установить(Истина);
	Константы.ИспользоватьЗаполнениеРаздела7ДекларацииПоНДС.Установить(Истина);
	
КонецПроцедуры

Процедура ОбновлениеУТДоКА() Экспорт
	
	ПланыВидовХарактеристик.АналитикиСтатейБюджетов.ЗаполнитьПредопределенныеАналитикиСтатейБюджетов();
	Константы.ЗаполненыДвиженияАктивовПассивов.Установить(Истина);
	
	ОбновлениеИнформационнойБазыУТ.ЗаполнитьЗначениеРазделенияПоОбластямДанных();
	
	ЗначенияКонстант = Новый Структура;
	ЗначенияКонстант.Вставить("УправлениеТорговлей", Ложь);
	ЗначенияКонстант.Вставить("КомплекснаяАвтоматизация", Истина);
	
#Область Варианты_обособления
	ЗначенияКонстант.Вставить(Метаданные.Константы.ВариантОбособленияМатериаловПриПередачеВПроизводство.Имя,  Перечисления.ВариантыОбособленияМатериаловПриПередачеВПроизводство.НазначениеПолучателя);
	//++ Устарело_Переработка24
	ЗначенияКонстант.Вставить(Метаданные.Константы.ВариантОбособленияМатериаловВПереработке.Имя,              Перечисления.ВариантыОбособленияПриПередачеВПереработку.ЗаказПереработчику);
	//-- Устарело_Переработка24
	ЗначенияКонстант.Вставить(Метаданные.Константы.ВариантОбособленияУПереработчика2_5.Имя,                   Перечисления.ВариантыОбособленияПриПередачеВПереработку.НеОбосабливать);
	ЗначенияКонстант.Вставить(Метаданные.Константы.ВариантОбособленияВПередачеПереработчику2_5.Имя,           Перечисления.ВариантыОбособленияПриПередачеВПереработку.ЗаказПереработчику);
#КонецОбласти
	
	Для Каждого КлючИЗначение Из ЗначенияКонстант Цикл
		Константы[КлючИЗначение.Ключ].Установить(КлючИЗначение.Значение);
	КонецЦикла; 
	
	Если Константы.ИспользоватьУчетНДС.Получить() = Истина Тогда 
		Константы.ИспользоватьЗаполнениеРаздела7ДекларацииПоНДС.Установить(Истина);
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

// Процедура устанавливает значение валюты плановых цен.
// Вызывается при первоначальном заполнении ИБ.
//
Процедура УстановитьВалютуПлановыхЦен()
	
	Если НЕ ЗначениеЗаполнено(Константы.ВалютаПлановойСебестоимостиПродукции.Получить())
		И Не Константы.ИспользоватьНесколькоВалют.Получить()Тогда
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 2
			|	Валюты.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Валюты КАК Валюты
			|ГДЕ
			|	НЕ Валюты.ПометкаУдаления");
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Если Выборка.Количество() = 1 Тогда
				Выборка.Следующий();
				
				Константы.ВалютаПлановойСебестоимостиПродукции.Установить(Выборка.Ссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура устанавливает значение валюты расценок видов работ.
// Вызывается при первоначальном заполнении ИБ.
//
Процедура УстановитьВалютуРасценокВидовРабот()
	
	Если НЕ ЗначениеЗаполнено(Константы.ВалютаРасценокВидовРабот.Получить())
		И Не Константы.ИспользоватьНесколькоВалют.Получить()Тогда
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 2
			|	Валюты.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Валюты КАК Валюты
			|ГДЕ
			|	НЕ Валюты.ПометкаУдаления");
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Если Выборка.Количество() = 1 Тогда
				Выборка.Следующий();
				
				Константы.ВалютаРасценокВидовРабот.Установить(Выборка.Ссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
Процедура ПриДобавленииОбработчиковОбновленияКА(Обработчики) Экспорт

#Область ПервыйЗапуск

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыКА.ПервыйЗапуск";
	Обработчик.Версия = "";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Комментарий = "";

#КонецОбласти

#Область УстановитьКонстантуИсточникСоставаНаборовВПроизводстве

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыКА.УстановитьКонстантуИсточникСоставаНаборовВПроизводстве";
	Обработчик.Версия = "2.5.11.8";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("f7a60687-2131-4c2e-be37-db329d6f0574");
	Обработчик.Комментарий = НСтр("ru = 'Устанавливает значение константы ""Источник состава наборов в производстве"".'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Справочники.РесурсныеСпецификации.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Константы.ИсточникСоставаНаборовВПроизводстве.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");

#КонецОбласти

//++ Устарело_Переработка24
#Область УстановитьКонстантуОтображатьПроизводствоНаСтороне2_4

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыКА.УстановитьКонстантуОтображатьПроизводствоНаСтороне2_4";
	Обработчик.Версия = "2.5.9.29";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("1c26f542-471a-4927-b3e0-c038c81fe906");
	Обработчик.Комментарий = НСтр("ru = 'Устанавливает значение константы ""Отображать команды перехода к объектам подсистемы производства на стороне (версия 2.4)"".'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Константы.ИспользоватьПроизводствоНаСтороне.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Константы.ИспользоватьПроизводствоНаСтороне2_5.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Константы.ОтображатьПроизводствоНаСтороне2_4.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Константы.ОтображатьПроизводствоНаСтороне2_4.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");

#КонецОбласти
//-- Устарело_Переработка24

#Область ОчиститьКэшВспомогательныхДанныхВидаБюджета

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыКА.ОчиститьКэшВспомогательныхДанныхВидаБюджета";
	Обработчик.Версия = "2.5.9.59";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("1c26f542-471a-4927-b3e0-c038c81fe901");
	Обработчик.Комментарий = НСтр("ru = 'Очищает кэш вспомогательных данных вида бюджета"".'");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыСведений.КэшВспомогательныхДанныхВидаБюджета.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");

#КонецОбласти

//++ Локализация
#Область УстановитьКонстантуВидимостьДатыНачалаПеречисленияЗарплатыЧерезПереводыВПути

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыКА.УстановитьКонстантуВидимостьДатыНачалаПеречисленияЗарплатыЧерезПереводыВПути";
	Обработчик.Версия = "2.5.9.29";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("cfce4b84-3479-446a-b8f5-005ffefb90d7");
	Обработчик.Комментарий = НСтр("ru = 'Устанавливает значение константы ""Видимость даты начала перечисления ДС по зарплате через переводы в пути"".'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Константы.ВидимостьДатыНачалаПеречисленияЗарплатыЧерезПереводыВПути.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Константы.ВидимостьДатыНачалаПеречисленияЗарплатыЧерезПереводыВПути.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");

#КонецОбласти

#Область УстановитьКонстантуДатаНачалаПеречисленияЗарплатыЧерезПереводыВПути

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыКА.УстановитьКонстантуДатаНачалаПеречисленияЗарплатыЧерезПереводыВПути";
	Обработчик.Версия = "2.5.9.29";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("cd11878b-c8c4-4678-bcb6-4d1a516e7f77");
	Обработчик.Комментарий = НСтр("ru = 'Устанавливает значение константы ""Дата начала списания безналичных ДС на выплату зарплаты через переводы в пути"".'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Константы.ДатаНачалаПеречисленияЗарплатыЧерезПереводыВПути.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Константы.ВидимостьДатыНачалаПеречисленияЗарплатыЧерезПереводыВПути.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Константы.ДатаНачалаПеречисленияЗарплатыЧерезПереводыВПути.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");

#КонецОбласти
//-- Локализация

#Область УстановитьКонстантуИспользоватьЗаполнениеРаздела7ДекларацииПоНДС

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыКА.УстановитьКонстантуИспользоватьЗаполнениеРаздела7ДекларацииПоНДС";
	Обработчик.Версия = "2.5.10.46";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("60690f02-9783-4af7-9d74-2f5c03cf42a2");
	Обработчик.Комментарий = НСтр("ru = 'Устанавливает значение константы ""Использовать заполнение раздела 7 декларации по НДС"".'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Константы.ИспользоватьУчетНДС.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Константы.ИспользоватьЗаполнениеРаздела7ДекларацииПоНДС.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
#КонецОбласти

КонецПроцедуры

// Обработчик первого запуска КА.
// Включает константу "ИспользоватьБюджетирование".
//
Процедура ЗаполнитьКонстантуИспользоватьБюджетирование() Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("КомплекснаяАвтоматизация") Тогда
		Возврат;
	КонецЕсли;
	
	Константы.ИспользоватьБюджетирование.Установить(Истина);
	Константы.ИнтерфейсВерсии82.Установить(Ложь);
	
КонецПроцедуры

//++ Локализация
// Процедура включает использование ведомостей прочих доходов при обновлении
// в зависимости от использования учета зарплаты.
//
Процедура УстановитьИспользованиеВедомостейПрочихДоходов() Экспорт

	Если ПолучитьФункциональнуюОпцию("ИспользоватьНачислениеЗарплатыУТ") Тогда
		НаборЗаписей = РегистрыСведений.НастройкиВзаиморасчетовПоПрочимДоходам.СоздатьНаборЗаписей();
		Настройка = НаборЗаписей.Добавить();
		Настройка.ИспользоватьВзаиморасчетыПоПрочимДоходам = Истина;
		Настройка.ИспользоватьВедомостиДляВыплатыПрочихДоходов = Истина;
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры
//-- Локализация

#Область УстановкаКонстанты_ИсточникСоставаНаборовВПроизводстве

Процедура УстановитьКонстантуИсточникСоставаНаборовВПроизводстве() Экспорт
	
	
	Результат = Перечисления.ИсточникиСоставаНаборовВПроизводстве.ВариантыКомплектации;
	
	
	Константы.ИсточникСоставаНаборовВПроизводстве.Установить(Результат);
	
КонецПроцедуры

#КонецОбласти

//++ Устарело_Переработка24
#Область УстановкаКонстанты_ОтображатьПроизводствоНаСтороне2_4

Процедура УстановитьКонстантуОтображатьПроизводствоНаСтороне2_4() Экспорт
	
	Константы.ОтображатьПроизводствоНаСтороне2_4.Установить(
		Не Константы.ИспользоватьПроизводствоНаСтороне.Получить()
		И Константы.ИспользоватьПроизводствоНаСтороне2_5.Получить()
		И НастройкиСистемыЛокализация.ПроизводствоНаСтороне24ИспользовалосьРанее());
	
КонецПроцедуры

#КонецОбласти
//-- Устарело_Переработка24

#Область ОчиститьКэшВспомогательныхДанныхВидаБюджета

Процедура ОчиститьКэшВспомогательныхДанныхВидаБюджета() Экспорт
	
	РегистрыСведений.КэшВспомогательныхДанныхВидаБюджета.СоздатьНаборЗаписей().Записать();
	
КонецПроцедуры

#КонецОбласти

//++ Локализация
#Область УстановитьКонстантуВидимостьДатыНачалаПеречисленияЗарплатыЧерезПереводыВПути

Процедура УстановитьКонстантуВидимостьДатыНачалаПеречисленияЗарплатыЧерезПереводыВПути() Экспорт
	
	Если Константы.ВидимостьДатыНачалаПеречисленияЗарплатыЧерезПереводыВПути.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	Константы.ВидимостьДатыНачалаПеречисленияЗарплатыЧерезПереводыВПути.Установить(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область УстановитьКонстантуДатаНачалаПеречисленияЗарплатыЧерезПереводыВПути

Процедура УстановитьКонстантуДатаНачалаПеречисленияЗарплатыЧерезПереводыВПути() Экспорт
	
	Если ЗначениеЗаполнено(Константы.ДатаНачалаПеречисленияЗарплатыЧерезПереводыВПути.Получить()) Тогда
		Возврат;
	КонецЕсли;
	
	Если Константы.ВидимостьДатыНачалаПеречисленияЗарплатыЧерезПереводыВПути.Получить() Тогда
		Константы.ДатаНачалаПеречисленияЗарплатыЧерезПереводыВПути.Установить('20230101');
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
//-- Локализация

#Область УстановитьКонстантуИспользоватьЗаполнениеРаздела7ДекларацииПоНДС

Процедура УстановитьКонстантуИспользоватьЗаполнениеРаздела7ДекларацииПоНДС() Экспорт
	
	Если Константы.ИспользоватьУчетНДС.Получить() = Истина Тогда
		Константы.ИспользоватьЗаполнениеРаздела7ДекларацииПоНДС.Установить(Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти
