
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	УправлениеЭлементами()
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_НаборКонстант" Тогда
		// Изменены настройки программы в панелях администрирования
		УправлениеЭлементами();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ОбщиеСправочники

&НаКлиенте
Процедура ОткрытьСправочникВоенкоматы(Команда)
	ОткрытьФорму("Справочник.Военкоматы.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникЗванияГражданскогоВоинскогоУчета(Команда)
	ОткрытьФорму("Справочник.ЗванияГражданскогоВоинскогоУчета.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникСоставыВоеннослужащих(Команда)
	ОткрытьФорму("Справочник.СоставыВоеннослужащих.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникПереченьДолжностейДляБронированияГраждан(Команда)
	ОткрытьФорму("Справочник.ПереченьДолжностейДляБронированияГраждан.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникПрофессии(Команда)
	ОткрытьФорму("Справочник.ПрофессииРабочих.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникОснованияУвольнения(Команда)
	ОткрытьФорму("Справочник.ОснованияУвольнения.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникОснованияУвольненияПользовательские(Команда)
	ОткрытьФорму("Справочник.ОснованияУвольненияПользовательские.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникОснованияПриостановленияТрудовыхДоговоровКонтрактов(Команда)
	ОткрытьФорму("Справочник.ОснованияПриостановленияТрудовыхДоговоровКонтрактов.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТрудовыеФункции(Команда)
	ОткрытьФорму("Справочник.ТрудовыеФункции.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКлассификаторЗанятий(Команда)
	ОткрытьФорму("Справочник.КлассификаторЗанятий.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникСпециальности(Команда)
	ОткрытьФорму("Справочник.КлассификаторСпециальностейПоОбразованию.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникЯзыкиНародовМира(Команда)
	ОткрытьФорму("Справочник.ЯзыкиНародовМира.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникСтепениЗнанияЯзыков(Команда)
	ОткрытьФорму("Справочник.СтепениЗнанияЯзыка.Форма.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникСостояниеВБраке(Команда)
	ОткрытьФорму("Справочник.СостояниеВБраке.Форма.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникНаграды(Команда)
	ОткрытьФорму("Справочник.Награды.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникСтепениРодства(Команда)
	ОткрытьФорму("Справочник.СтепениРодстваФизическихЛиц.Форма.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникВидыОбразования(Команда)
	ОткрытьФорму("Справочник.ВидыОбразованияФизическихЛиц.Форма.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникУчебныеЗаведения(Команда)
	ОткрытьФорму("Справочник.УчебныеЗаведения.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникУченыеЗвания(Команда)
	ОткрытьФорму("Справочник.УченыеЗвания.Форма.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникУченыеСтепени(Команда)
	ОткрытьФорму("Справочник.УченыеСтепени.Форма.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПечатныхФорм(Команда)
	ОткрытьФорму("РегистрСведений.ДополнительныеНастройкиЗарплатаКадры.Форма.ФормаНастроек");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГруппыСотрудников(Команда)
	ОткрытьФорму("Справочник.ГруппыСотрудников.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВидыАвторскихДоговоров(Команда)
	ОткрытьФорму("Справочник.ВидыДоговоровАвторскогоЗаказа.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВидыОтпусков(Команда)
	ОткрытьФорму("Справочник.ВидыОтпусков.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВидыСтажа(Команда)
	ОткрытьФорму("Справочник.ВидыСтажа.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОткрытьРаботодатели(Команда)
	ОткрытьФорму("Справочник.Работодатели.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВидыДокументов(Команда)
	ОткрытьФорму("Справочник.ВидыДокументовФизическихЛиц.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПрожиточныеМинимумы(Команда)
	ОткрытьФорму("Справочник.ПрожиточныеМинимумы.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПерсональнаяНастройкаСменаПодписи(Команда)
	МодульПодписиДокументов = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодписиДокументовКлиент");
	МодульПодписиДокументов.ОткрытьФормуНастройкиСменыПодписи(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементами()
	
	ПравоДоступаВидыДоговоров			= ПравоДоступа("Просмотр", Метаданные.Справочники.ВидыДоговоровАвторскогоЗаказа);
	ПравоДоступаВидыОтпусков			= ПравоДоступа("Просмотр", Метаданные.Справочники.ВидыОтпусков);
	ПравоДоступаВидыСтажа				= ПравоДоступа("Просмотр", Метаданные.Справочники.ВидыСтажа);
	ПравоДоступаРаботодатели			= ПравоДоступа("Просмотр", Метаданные.Справочники.Работодатели);
	ПравоДоступаВидыДокументов			= ПравоДоступа("Просмотр", Метаданные.Справочники.ВидыДокументовФизическихЛиц);
	ПравоДоступаПрожиточныеМинимумы		= ПравоДоступа("Просмотр", Метаданные.Справочники.ПрожиточныеМинимумы);
	
	Элементы.ОткрытьВидыАвторскихДоговоров.Видимость = ПравоДоступаВидыДоговоров И ПолучитьФункциональнуюОпцию("ИспользоватьНачисленияПоДоговорам");
	Элементы.ОткрытьВидыОтпусков.Видимость = ПравоДоступаВидыОтпусков;
	Элементы.ОткрытьВидыСтажа.Видимость = ПравоДоступаВидыСтажа;
	Элементы.ОткрытьРаботодатели.Видимость = ПравоДоступаРаботодатели;
	Элементы.ОткрытьВидыДокументов.Видимость = ПравоДоступаВидыДокументов;
	Элементы.ОткрытьПрожиточныеМинимумы.Видимость = ПравоДоступаПрожиточныеМинимумы;
	
	// Раздел "Воинский учет"
	ИспользоватьВоинскийУчет = ПолучитьФункциональнуюОпцию("ИспользоватьВоинскийУчет");
	
	Элементы.ГруппаВоинскийУчет.Видимость = ИспользоватьВоинскийУчет;
	
	Элементы.КнопкаВоенкоматы.Видимость = ИспользоватьВоинскийУчет
		И ПравоДоступа("Просмотр", Метаданные.Справочники.Военкоматы);
	Элементы.КнопкаЗванияГражданскогоВоинскогоУчета.Видимость = ИспользоватьВоинскийУчет
		И ПравоДоступа("Просмотр", Метаданные.Справочники.ЗванияГражданскогоВоинскогоУчета);
	Элементы.КнопкаСоставыВоеннослужащих.Видимость = ИспользоватьВоинскийУчет
		И ПравоДоступа("Просмотр", Метаданные.Справочники.СоставыВоеннослужащих);
	Элементы.КнопкаПереченьДолжностейДляБронированияГраждан.Видимость = ИспользоватьВоинскийУчет
		И ПравоДоступа("Просмотр", Метаданные.Справочники.ПереченьДолжностейДляБронированияГраждан);
	
КонецПроцедуры

#КонецОбласти
