
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НастройкаЗаполненияОтчетности") Тогда
		Настройка = Параметры.НастройкаЗаполненияОтчетности; //СправочникСсылка.НастройкиЗаполненияБухОтчетности
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьЭлементыФормы("");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НастройкаПриИзменении(Элемент)
	
	ОбновитьЭлементыФормы("");
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураСтрокПриАктивизацииСтроки(Элемент)
	
	Если Элементы.СтруктураСтрок.ТекущиеДанные <> Неопределено Тогда
		ОсновныеСтроки.Параметры.УстановитьЗначениеПараметра("Родитель", Элементы.СтруктураСтрок.ТекущиеДанные.Ссылка);
	Иначе
		ОсновныеСтроки.Параметры.УстановитьЗначениеПараметра("Родитель", Неопределено);
		НастроитьКомандыДопСтрок(Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСтрокиПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ОсновныеСтроки.ТекущиеДанные <> Неопределено Тогда
		ДополнительныеСтроки.Параметры.УстановитьЗначениеПараметра("ОсновнаяСтрока", Элементы.ОсновныеСтроки.ТекущиеДанные.Ссылка);
		НастроитьКомандыДопСтрок(Элементы.ОсновныеСтроки.ТекущиеДанные.ДобавлениеДопСтрок);
	Иначе
		ДополнительныеСтроки.Параметры.УстановитьЗначениеПараметра("ОсновнаяСтрока", Неопределено);
		НастроитьКомандыДопСтрок(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьВидимостьЭлементов()
	
	Если Настройка = ПредопределенноеЗначение("Справочник.НастройкиЗаполненияБухОтчетности.НеНастраивается") Тогда
		Элементы.СтруктураСтрок.Видимость = Ложь;
		Элементы.ОсновныеСтроки.Видимость = Ложь;
		Элементы.ДополнительныеСтроки.Видимость = Ложь;
		Элементы.КартинкаИнформация.Видимость = Истина;
		Элементы.Информация.Видимость = Истина;
	Иначе
		Элементы.СтруктураСтрок.Видимость = Истина;
		Элементы.ОсновныеСтроки.Видимость = Истина;
		Элементы.ДополнительныеСтроки.Видимость = Истина;
		Элементы.КартинкаИнформация.Видимость = Ложь;
		Элементы.Информация.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьКомандыДопСтрок(ДопСтрокиДоступны)
	
	СтруктураКоманд = Новый Структура;
	
	СтруктураКоманд.Вставить("ДополнительныеСтрокиСоздатьДопСтроку");
	СтруктураКоманд.Вставить("ДополнительныеСтрокиКонтекстноеМенюСоздатьДопСтроку");
	
	Для Каждого Команда Из СтруктураКоманд Цикл
		ЭУ = Элементы.Найти(Команда.Ключ);
		Если ЭУ <> Неопределено Тогда
			ЭУ.Доступность = ДопСтрокиДоступны;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьОтборПоНастройке()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СтруктураСтрок, "Владелец", Настройка, ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДопСтроку(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ОсновнаяСтрока", Элементы.ОсновныеСтроки.ТекущиеДанные.Ссылка);
	
	ОткрытьФорму("Справочник.СтрокиБухОтчетности.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыФормы(Команда)
	
	ОбновитьВидимостьЭлементов();
	
	ЗадатьОтборПоНастройке();
	
КонецПроцедуры

#КонецОбласти





