#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Наименование = НастройкаСчетовУчетаКлиентСервер.ПредставлениеНастройкиОтражения(ЭтотОбъект, Неопределено, Неопределено);
	
	Если НЕ ЗначениеЗаполнено(ВладелецНастройки) Тогда
		ВладелецНастройки = Неопределено;
	КонецЕсли;
	
	ХешСумма = ХешСуммаНастройкиСчетов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ХешСуммаНастройкиСчетов()
	
	ДанныеХешСуммы = Новый Массив();
	
	//++ Локализация
	Если ЗначениеЗаполнено(СчетУчета) Тогда
		ДобавитьСчетИСубконтоВДанныеХешСуммы(ЭтотОбъект, ДанныеХешСуммы);
	КонецЕсли;
	//-- Локализация
	
	
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.SHA256);
	ХешированиеДанных.Добавить(СтрСоединить(ДанныеХешСуммы));
	
	Возврат Base64Строка(ХешированиеДанных.ХешСумма);
	
КонецФункции

Процедура ДобавитьСчетИСубконтоВДанныеХешСуммы(ДанныеНастройки, ДанныеХешСуммы)
	
	ДанныеХешСуммы.Добавить(XMLСтрока(ДанныеНастройки.СчетУчета));
	
	Если ЗначениеЗаполнено(ДанныеНастройки.Субконто1) Тогда
		ДанныеХешСуммы.Добавить(XMLСтрока(ДанныеНастройки.Субконто1));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеНастройки.Субконто2) Тогда
		ДанныеХешСуммы.Добавить(XMLСтрока(ДанныеНастройки.Субконто2));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеНастройки.Субконто3) Тогда
		ДанныеХешСуммы.Добавить(XMLСтрока(ДанныеНастройки.Субконто3));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли