
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИспользоватьВнеоборотныеАктивы = 
		Константы.ИспользоватьВнеоборотныеАктивы2_2.Получить()
		ИЛИ Константы.ИспользоватьВнеоборотныеАктивы2_4.Получить();
		
	ИспользоватьУправлениеРемонтами = Константы.ИспользоватьУправлениеРемонтами.Получить();
										
	ПараметрыНабора = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
	ПараметрыНабора.Используется = (ИспользоватьВнеоборотныеАктивы ИЛИ ИспользоватьУправлениеРемонтами);
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Справочник_ОбъектыЭксплуатации_Общие", ПараметрыНабора);


КонецПроцедуры

#КонецОбласти

#КонецЕсли
