////////////////////////////////////////////////////////////////////////////////
// ОУП: Процедуры подсистемы оперативного учета производства
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

//++ Устарело_Производство21


//-- Устарело_Производство21

// Оформляет документ выработки сотрудников на основании распоряжений
//
// Параметры:
//  СписокРаспоряжений	- Массив - список распоряжений.
//
Процедура ОформитьВыработкуСотрудниковПоРаспоряжениям(СписокРаспоряжений) Экспорт
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Распоряжения", СписокРаспоряжений);
	
	ПараметрыОформления = ОперативныйУчетПроизводстваВызовСервера.ПараметрыОформленияВыработкиСотрудников(СтруктураОтбора);
	
	Если ПараметрыОформления = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'По выбранным распоряжениям выработка сотрудников уже оформлена, оформление не требуется или не доступна.'"));
		Возврат;
	КонецЕсли;
	
	Если ПараметрыОформления.ТребуетсяОдинДокумент Тогда
		
		ПараметрыОформления.Вставить("ЗаполнитьПоОтбору", Истина);
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ПараметрыОформления);
		ОткрытьФорму("Документ.ВыработкаСотрудников.ФормаОбъекта", ПараметрыФормы);
		
	Иначе
		
		Результат = ОперативныйУчетПроизводстваВызовСервера.СформироватьВыработкуСотрудниковПоОтбору(ПараметрыОформления);
		
		Если Результат.КоличествоДокументов > 0 Тогда
			ОткрытьФорму("Документ.ВыработкаСотрудников.Форма.ФормаСпискаНовыхДокументов",
				Результат,,,,,);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Не удалось оформить выработку по выбранным распоряжениям. Требуется перейти в форму ""К оформлению"" и создать документы вручную.'"));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры



//++ Устарело_Производство21


//-- Устарело_Производство21

#КонецОбласти

//++ Устарело_Производство21


//-- Устарело_Производство21
