#Область ПрограммныйИнтерфейс

Процедура ЗаписатьОшибку(Комментарий, Данные = Неопределено, Постфикс = "") Экспорт

	ВыполнитьЗаписьЖурналаРегистрации(УровеньЖурналаРегистрации.Ошибка, Комментарий, Данные, Постфикс);
	
КонецПроцедуры

Процедура ЗаписатьИнформацию(Комментарий, Данные = Неопределено, Постфикс = "") Экспорт

	ВыполнитьЗаписьЖурналаРегистрации(УровеньЖурналаРегистрации.Информация, Комментарий, Данные, Постфикс);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьЗаписьЖурналаРегистрации(Уровень, Комментарий, Данные = Неопределено, Постфикс = "")
	Перем ОбъектМетаданных;
	
	Если Данные <> Неопределено Тогда
		ОбъектМетаданных = Данные.Метаданные();
	КонецЕсли;
	
	ИмяСобытия = ИмяСобытия(Постфикс);
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, ОбъектМетаданных, Данные, Комментарий);	
	
КонецПроцедуры

Функция ИмяСобытия(Постфикс) Экспорт
	
	ГлобальноеИмяСобытия = "Учет себестоимости";
	
	Результат = ГлобальноеИмяСобытия;
	
	Если ЗначениеЗаполнено(Постфикс) Тогда
		Результат = Результат + "." + Постфикс;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти