#Область ПрограммныйИнтерфейс

// Формирует список шаблонов заданий очереди.
//
// см. ОчередьЗаданийПереопределяемый.ПриПолученииСпискаШаблонов
//
Процедура ПриПолученииСпискаШаблонов(ШаблоныЗаданий) Экспорт
	
	//++ Локализация
	
	// ЭлектронноеВзаимодействие
	ЭлектронноеВзаимодействие.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	// Конец ЭлектронноеВзаимодействие
	
	//++ НЕ УТ
	ОбщегоНазначенияБРО.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	ЗарплатаКадры.ПриПолученииСпискаШаблоновОчередиЗаданий(ШаблоныЗаданий);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.ОтражениеДокументовВРеглУчете.Имя);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.СписаниеЗатратНаВыпуск.Имя);
	//-- НЕ УТ
	
	ИнтеграцияЕГАИС.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	ИнтеграцияВЕТИС.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	ИнтеграцияИСМП.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	ИнтеграцияЗЕРНО.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	ИнтеграцияСАТУРН.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.ОтправкаНаМодерациюСвязейТоваровЯндексМаркет.Имя);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.ПолучениеРекомендацийПоСклейкеТовараЯндексМаркет.Имя);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.ПолучениеСтатусовМодерацииТоваровЯндексМаркет.Имя);
	
	// РаспознаваниеДокументов
	РаспознаваниеДокументов.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	// КонецРаспознаваниеДокументов
	
	//-- Локализация
	
КонецПроцедуры

// Заполняет соответствие имен методов их псевдонимам для вызова из очереди заданий.
//
// см. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков
//
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	
	//++ Локализация

	//++ НЕ УТ
	ОбщегоНазначенияБРО.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	ЗарплатаКадры.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	//-- НЕ УТ
	
	// ЭлектронноеВзаимодействие
	ЭлектронноеВзаимодействие.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	// Конец ЭлектронноеВзаимодействие
	
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОбменССайтом.ИмяМетода);
	
	//++ НЕ УТ
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.СписаниеЗатратНаВыпуск.ИмяМетода);	
	//-- НЕ УТ
	
	
	ИнтеграцияСАТУРН.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	ИнтеграцияЕГАИС.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	ИнтеграцияВЕТИС.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	ИнтеграцияИСМП.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	ИнтеграцияЗЕРНО.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	
	//++ НЕ УТ
	УниверсальныйОбменСБанками.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ПроверкаРНПТ.ИмяМетода);
	//-- НЕ УТ
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОтправкаНаМодерациюСвязейТоваровЯндексМаркет.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ПолучениеРекомендацийПоСклейкеТовараЯндексМаркет.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ПолучениеСтатусовМодерацииТоваровЯндексМаркет.ИмяМетода);
	
	// РаспознаваниеДокументов
	РаспознаваниеДокументов.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	// КонецРаспознаваниеДокументов

	ИнтеграцияСМаркетплейсомOzonСервер.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти