#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Отражает подтверждение ставки 0% в регистрах учета НДС
//
// Параметры:
// 	ДокументРеализации - ДокументСсылка - Документ продажи на экспорт
// 	ДатаПодтверждения - Дата - Дата подтверждения экспорта
// 	Организация - СправочникСсылка.Организации - Организация, в которой подтверждается экспорт 
//
Процедура ОтразитьДокументПоПодтверждениюСтавки0(ДокументРеализации, ДатаПодтверждения, Организация, ФормироватьПроводки) Экспорт
	
	Движения = Новый Структура;
	
	НДСЗаписиКнигиПродаж = РегистрыНакопления.НДСЗаписиКнигиПродаж.СоздатьНаборЗаписей();
	НДСЗаписиКнигиПродаж.Отбор.Регистратор.Установить(ДокументРеализации);
	Движения.Вставить("НДСЗаписиКнигиПродаж", НДСЗаписиКнигиПродаж);
	
	//++ НЕ УТ
	Если ФормироватьПроводки Тогда
		ОтражениеДокументовВРеглУчете = РегистрыСведений.ОтражениеДокументовВРеглУчете.СоздатьНаборЗаписей();
		ОтражениеДокументовВРеглУчете.Отбор.Регистратор.Установить(ДокументРеализации);
		Движения.Вставить("ОтражениеДокументовВРеглУчете", ОтражениеДокументовВРеглУчете);
		
		Хозрасчетный = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
		Хозрасчетный.Отбор.Регистратор.Установить(ДокументРеализации);
		Движения.Вставить("Хозрасчетный", Хозрасчетный);
	КонецЕсли;
	//-- НЕ УТ
	
	
	Регистры = Новый Структура;
	Регистры.Вставить("НДСЗаписиКнигиПродаж");
	//++ НЕ УТ
	Если ФормироватьПроводки Тогда
		Регистры.Вставить("ОтражениеДокументовВРеглУчете");
	КонецЕсли;
	//-- НЕ УТ

	
	ТаблицыДляДвижений = ПроведениеДокументов.ДанныеДокументаДляПроведения(ДокументРеализации, Регистры);
	
	УчетНДСУП.ОтразитьДвижения(ТаблицыДляДвижений, Движения, Ложь);
	//++ НЕ УТ
	Если ФормироватьПроводки Тогда
		ТаблицыДляДвижений.Вставить("ТаблицаВыборочнойРегистрацииКОтражению",
			РеглУчетПроведениеСервер.ТаблицаВыборочнойРегистрацииКОтражению());
		РеглУчетПроведениеСервер.ДобавитьПараметрыВыборочнойРегистрацииКОтражениюВРеглУчете(
			ТаблицыДляДвижений.ТаблицаВыборочнойРегистрацииКОтражению,
			Организация,
			ДатаПодтверждения);
			
		РеглУчетПроведениеСервер.ОтразитьДвижения(ТаблицыДляДвижений, Движения, Ложь);
	КонецЕсли;
	//-- НЕ УТ
	
	
	Для Каждого Движение Из Движения Цикл
		Движение.Значение.Записать();
	КонецЦикла;
	
	
КонецПроцедуры


#КонецОбласти

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецЕсли
