////////////////////////////////////////////////////////////////////////////////
// Процедуры, используемые для локализации документа "Амортизация ОС".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	//++ Локализация
	МеханизмыДокумента.Добавить("РегламентированныйУчет");
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытий

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект.АмортизацияОС2_4 - Обрабатываемый документ.
//  Отказ - Булево - Признак проведения документа.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то проведение документа выполнено не будет.
//  РежимПроведения - РежимПроведенияДокумента - В данный параметр передается текущий режим проведения.
//
Процедура ОбработкаПроведения(Объект, Отказ, РежимПроведения) Экспорт
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект.АмортизацияОС2_4 - Обрабатываемый объект
//  Отказ - Булево - Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то будет выполнен отказ от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Объект, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект.АмортизацияОС2_4 - Обрабатываемый объект.
//  ДанныеЗаполнения - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения - Строка, Неопределено - Текст, используемый для заполнения документа. 
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
Процедура ОбработкаЗаполнения(Объект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект.АмортизацияОС2_4 - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то запись выполнена не будет и будет вызвано исключение.
//
Процедура ОбработкаУдаленияПроведения(Объект, Отказ) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект.АмортизацияОС2_4 - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то запись выполнена не будет и будет вызвано исключение.
//  РежимЗаписи - РежимЗаписиДокумента - В параметр передается текущий режим записи документа. Позволяет определить в теле процедуры режим записи.
//  РежимПроведения - РежимПроведенияДокумента - В данный параметр передается текущий режим проведения.
//
Процедура ПередЗаписью(Объект, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект.АмортизацияОС2_4 - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина, то запись выполнена не будет и будет вызвано исключение.
//
Процедура ПриЗаписи(Объект, Отказ) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект.АмортизацияОС2_4 - Обрабатываемый объект
//  ОбъектКопирования - ДокументОбъект.АмортизацияОС2_4 - Исходный документ, который является источником копирования.
//
Процедура ПриКопировании(Объект, ОбъектКопирования) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	
КонецПроцедуры

// Добавляет команду создания документа "Авансовый отчет".
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
Процедура ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт


КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	//++ Локализация
	Отчеты.СправкаРасчетАмортизацииОС2_4.ДобавитьКомандуОтчетаПоДокументуАмортизацииОС(КомандыОтчетов);
	//-- Локализация
	
КонецПроцедуры

// Добавляет команды печати.
// 
// Параметры:
// 	КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область ПроводкиРегУчета

// Функция возвращает текст запроса для отражения документа в регламентированном учете.
//
// Возвращаемое значение:
//	Строка - Текст запроса
//
Функция ТекстОтраженияВРеглУчете() Экспорт
	
	ТекстЗапроса = "";
	
	//++ Локализация

	СписокЗапросов = Новый Массив;
	
	ВнеоборотныеАктивыЛокализация.ТекстОтраженияВРеглУчетеНачисленияАмортизацииОС(СписокЗапросов);
	ВнеоборотныеАктивыЛокализация.ТекстОтраженияВРеглУчетеАмортизационнойПремии(СписокЗапросов);
	
	ТекстЗапроса = СтрСоединить(СписокЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());

	//-- Локализация
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Функция возвращает текст запроса дополнительных временных таблиц,
// необходимых для отражения в регламентированном учете
//
// Возвращаемое значение:
//   Строка - сформированный текст запроса.
//
Функция ТекстЗапросаВТОтраженияВРеглУчете() Экспорт
	
	ТекстЗапроса = "";

	//++ Локализация

	СписокЗапросов = Новый Массив;
	
	ВнеоборотныеАктивыЛокализация.ТекстЗапросаВТНачислениеАмортизацииОС(СписокЗапросов);
	
	СписокЗапросов.Добавить(Символы.ПС);

	ТекстЗапроса = СтрСоединить(СписокЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	//-- Локализация
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область Проведение

// Процедура дополняет тексты запросов проведения документа.
//
// Параметры:
//  Запрос - Запрос - Общий запрос проведения документа.
//  ТекстыЗапроса - СписокЗначений - Список текстов запроса проведения.
//  Регистры - Строка, Структура - Список регистров проведения документа через запятую или в ключах структуры.
//
Процедура ДополнитьТекстыЗапросовПроведения(Запрос, ТекстыЗапроса, Регистры) Экспорт
	
	//++ Локализация
	
	ТекстЗапросаТаблицаСтоимостьОС(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаПорядокОтраженияПрочихОпераций(Запрос, ТекстыЗапроса, Регистры);
	
	ВнеоборотныеАктивыЛокализация.ТекстЗапросаТаблицаОтражениеДокументовВРеглУчете_Амортизация(Запрос, ТекстыЗапроса, Регистры);
	
	//-- Локализация
	
КонецПроцедуры

Процедура СформироватьЗаданияКЗакрытиюМесяца(Объект) Экспорт

	//++ Локализация
	
	ПериодРасчета = ВнеоборотныеАктивыЛокализация.ПериодРасчетаНалогаНаИмущество(Объект.Организация, Объект.Дата);
	Если ПериодРасчета <> Неопределено Тогда
		РегистрыСведений.ЗаданияКЗакрытиюМесяца.СоздатьЗаписьРегистра(
			ПериодРасчета, Объект.Ссылка, Объект.Организация, Перечисления.ОперацииЗакрытияМесяца.РасчетНалогаНаИмущество);
	КонецЕсли;
	
	ПериодРасчета = ВнеоборотныеАктивыЛокализация.СледующийПериодПризнанияВНУАрендныхПлатежей(Объект.Организация, Объект.Дата);
	Если ПериодРасчета <> Неопределено Тогда
		РегистрыСведений.ЗаданияКЗакрытиюМесяца.СоздатьЗаписьРегистра(
			ПериодРасчета, Объект.Ссылка, Объект.Организация, Перечисления.ОперацииЗакрытияМесяца.ПризнаниеВНалоговомУчетеАрендныхПлатежей);
	КонецЕсли;
	
	//-- Локализация
	
КонецПроцедуры

Процедура ТекстЗапросаТаблицаДвиженияПоПрочимАктивамПассивам(СписокЗапросовОбъединение) Экспорт
	
	//++ Локализация
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Период                                             КАК Период,
	|	АмортизационнаяПремия.Организация                   КАК Организация,
	|	АмортизационнаяПремия.Подразделение                 КАК Подразделение,
	|	АмортизационнаяПремия.НаправлениеДеятельности       КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.РасчетыПоВыделенномуИмуществу) КАК Статья,
	|	АмортизационнаяПремия.ОрганизацияПолучательРасходов КАК Аналитика,
	|	НЕОПРЕДЕЛЕНО                                         КАК НастройкаСчетовУчета,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПрочихАктивовПассивов.Дебет) КАК ДебетКредит,
	|
	|	0 КАК СуммаРегл,
	|	0 КАК ПостояннаяРазница,
	|	-АмортизационнаяПремия.Сумма КАК ВременнаяРазница,
	|	0 КАК СуммаУпр,
	|	0 КАК СуммаСНДС,
	|	0 КАК СуммаБезНДС,
	|
	|	АмортизационнаяПремия.ИдентификаторСтроки КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВключениеАмортизационнойПремииВРасходы) КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	АмортизационнаяПремия КАК АмортизационнаяПремия
	|ГДЕ
	|	АмортизационнаяПремия.Организация = &Организация
	|	И АмортизационнаяПремия.НомерПакета = &НомерПакета
	|	И АмортизационнаяПремия.ОрганизацияПолучательРасходов <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период                                              КАК Период,
	|	АмортизационнаяПремия.ОрганизацияПолучательРасходов  КАК Организация,
	|	АмортизационнаяПремия.КорПодразделение               КАК Подразделение,
	|	АмортизационнаяПремия.КорНаправлениеДеятельности     КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.РасчетыПоВыделенномуИмуществу) КАК Статья,
	|	АмортизационнаяПремия.Организация                    КАК Аналитика,
	|	НЕОПРЕДЕЛЕНО                                          КАК НастройкаСчетовУчета,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПрочихАктивовПассивов.Кредит) КАК ДебетКредит,
	|
	|	0 КАК СуммаРегл,
	|	0 КАК ПостояннаяРазница,
	|	-АмортизационнаяПремия.Сумма КАК ВременнаяРазница,
	|	0 КАК СуммаУпр,
	|	0 КАК СуммаСНДС,
	|	0 КАК СуммаБезНДС,
	|
	|	АмортизационнаяПремия.ИдентификаторСтроки КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВключениеАмортизационнойПремииВРасходы) КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	АмортизационнаяПремия КАК АмортизационнаяПремия
	|ГДЕ
	|	АмортизационнаяПремия.Организация = &Организация
	|	И АмортизационнаяПремия.НомерПакета = &НомерПакета
	|	И АмортизационнаяПремия.ОрганизацияПолучательРасходов <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)";
	
	СписокЗапросовОбъединение.Добавить(ТекстЗапроса);
		
	//-- Локализация
	
КонецПроцедуры
 
Процедура ДополнитьТекстЗапросаТаблицаВтИсходныеПрочиеРасходы(СписокЗапросовОбъединение) Экспорт
	
	//++ Локализация
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&Период                                           КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)            КАК ВидДвижения,
	|	ВЫБОР
	|		КОГДА АмортизационнаяПремия.ПередаватьРасходыВДругуюОрганизацию
	|			ТОГДА АмортизационнаяПремия.ОрганизацияПолучательРасходов
	|		ИНАЧЕ АмортизационнаяПремия.Организация
	|	КОНЕЦ                                             КАК Организация,
	|	АмортизационнаяПремия.КорПодразделение            КАК Подразделение,
	|	АмортизационнаяПремия.СтатьяРасходов              КАК СтатьяРасходов,
	|	АмортизационнаяПремия.АналитикаРасходов           КАК АналитикаРасходов,
	|	АмортизационнаяПремия.КорНаправлениеДеятельности  КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО                                      КАК ВидДеятельностиНДС,
	|
	|	0 КАК СуммаСНДС,
	|	0 КАК СуммаБезНДС,
	|	0 КАК СуммаБезНДСУпр,
	|	0 КАК СуммаСНДСРегл,
	|	0 КАК СуммаБезНДСРегл,
	|	0 КАК ПостояннаяРазница,
	|	-АмортизационнаяПремия.Сумма КАК ВременнаяРазница,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВключениеАмортизационнойПремииВРасходы) КАК ХозяйственнаяОперация,
	|
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
	|	
	|	АмортизационнаяПремия.ИдентификаторСтроки КАК ИдентификаторФинЗаписи,
	|
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВключениеАмортизационнойПремииВРасходы) КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	АмортизационнаяПремия КАК АмортизационнаяПремия
	|ГДЕ
	|	АмортизационнаяПремия.Организация = &Организация
	|	И АмортизационнаяПремия.НомерПакета = &НомерПакета";

	СписокЗапросовОбъединение.Добавить(ТекстЗапроса);
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область ФормаДокумента

Процедура ПриСозданииНаСервере(Форма) Экспорт

	//++ Локализация
	
	Если НЕ ПолучитьФункциональнуюОпцию("УправлениеПредприятием") 
		Тогда
		Форма.Элементы.ФормаПроводкиМеждУчета.Видимость = Ложь;
	КонецЕсли; 
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область ФормаРасчетАмортизации

Процедура ДополнитьСлужебныеПараметрыФормыРасчетАмортизации(Знач СлужебныеПараметры) Экспорт

	//++ Локализация
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	АмортизацияОС2_4.Ссылка КАК Ссылка,
	|	АмортизацияОС2_4.Организация КАК Организация,
	|	АмортизацияОС2_4.НомерПакета,
	|	АмортизацияОС2_4.Дата КАК Дата
	|ИЗ
	|	Документ.АмортизацияОС2_4 КАК АмортизацияОС2_4
	|ГДЕ
	|	АмортизацияОС2_4.Ссылка В(&СписокДокументов)
	|	И НЕ АмортизацияОС2_4.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АмортизацияОС.Ссылка,
	|	АмортизацияОС.Организация,
	|	0,
	|	АмортизацияОС.Дата КАК Дата
	|ИЗ
	|	Документ.АмортизацияОС КАК АмортизацияОС
	|ГДЕ
	|	АмортизацияОС.Ссылка В(&СписокДокументов)
	|	И НЕ АмортизацияОС.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Организация";
	
	СлужебныеПараметры.Вставить("ТекстЗапроса", ТекстЗапроса);
	
	СлужебныеПараметры.СобытияЗаписи.Добавить("Запись_АмортизацияОС");
	СлужебныеПараметры.ТипыДокументов.Добавить("ДокументСсылка.АмортизацияОС");
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область РасчетАмортизации

// 
// Параметры:
// 	СписокЗапросов - Массив из Строка - Список запросов, который нужно дозаполнить.
// 	ПараметрыРасчета - см. ВнеоборотныеАктивы.НовыеПараметрыРасчетаАмортизации
Процедура ДополнитьТекстЗапросаПараметрыРасчетаАмортизации(СписокЗапросов, ПараметрыРасчета) Экспорт
	
	//++ Локализация
	
	ОбъектУчета = "ОсновноеСредство";
				
	#Область ДатыПоследнегоИзменения
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.НачалоМесяца КАК НачалоМесяца,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ОсновноеСредство КАК ОсновноеСредство,
	|	
	|	МАКСИМУМ(ВложенныйЗапрос.Дата) КАК Дата,
	|	МАКСИМУМ(ВложенныйЗапрос.ПринятиеКУчетуПрошлойДатойБУ) КАК ПринятиеКУчетуПрошлойДатойБУ,
	|	МАКСИМУМ(ВложенныйЗапрос.ДатаДокументаПринятияКУчетуБУ) КАК ДатаДокументаПринятияКУчетуБУ,
	|	МАКСИМУМ(ВложенныйЗапрос.ПринятиеКУчетуПрошлойДатойНУ) КАК ПринятиеКУчетуПрошлойДатойНУ,
	|	МАКСИМУМ(ВложенныйЗапрос.ДатаДокументаПринятияКУчетуНУ) КАК ДатаДокументаПринятияКУчетуНУ
	|
	|ПОМЕСТИТЬ ДатыПоследнегоИзмененияБУ
	|
	|ИЗ
	|
	|	(ВЫБРАТЬ
	|		ПараметрыАмортизацииОСБУ.НачалоМесяца КАК НачалоМесяца,
	|		ПараметрыАмортизацииОСБУ.Организация КАК Организация,
	|		ПараметрыАмортизацииОСБУ.ОсновноеСредство КАК ОсновноеСредство,
	|	
	|		ВЫБОР
	|			КОГДА ИСТИНА В (ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА ИЗ ВТ_АрендованныеОС КАК АрендованныеОС ГДЕ АрендованныеОС.ОсновноеСредство = ПараметрыАмортизацииОСБУ.ОсновноеСредство И АрендованныеОС.НачалоМесяца = &НачалоМесяца)
	|				ТОГДА ВЫБОР 
	|						КОГДА ЕСТЬNULL(УчетнаяПолитикаБухУчета.ПорядокНачисленияАмортизацииАренда, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)) = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)
	|							ТОГДА ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения
	|						ИНАЧЕ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения, МЕСЯЦ, 1), МЕСЯЦ)
	|					КОНЕЦ
	|
	|			КОГДА ЕСТЬNULL(УчетнаяПолитикаБухУчета.ПорядокНачисленияАмортизацииОС, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)) = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)
	|				ТОГДА ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения
	|
	|			ИНАЧЕ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения, МЕСЯЦ, 1), МЕСЯЦ)
	|
	|		КОНЕЦ КАК Дата,
	|
	|		ЕСТЬNULL(ПринятиеКУчетуОС_БУ.ПринятиеКУчетуПрошлойДатой, ЛОЖЬ)
	|			И ЕСТЬNULL(ПринятиеКУчетуОС_БУ.ОтражатьВБУ, ЛОЖЬ) КАК ПринятиеКУчетуПрошлойДатойБУ,
	|
	|		ЕСТЬNULL(ПервоначальныеСведенияОС.ДокументВводаВЭксплуатациюБУ.Дата, ДАТАВРЕМЯ(1,1,1)) КАК ДатаДокументаПринятияКУчетуБУ,
	|
	|		ЕСТЬNULL(ПринятиеКУчетуОС_НУ.ПринятиеКУчетуПрошлойДатой, ЛОЖЬ)
	|			И ЕСТЬNULL(ПринятиеКУчетуОС_НУ.ОтражатьВНУ, ЛОЖЬ) КАК ПринятиеКУчетуПрошлойДатойНУ,
	|
	|		ЕСТЬNULL(ПервоначальныеСведенияОС.ДокументВводаВЭксплуатациюНУ.Дата, ДАТАВРЕМЯ(1,1,1)) КАК ДатаДокументаПринятияКУчетуНУ
	|
	|	ИЗ
	|		ПараметрыАмортизацииОСБУ КАК ПараметрыАмортизацииОСБУ
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияОС КАК ПервоначальныеСведенияОС
	|			ПО (ПервоначальныеСведенияОС.Организация = ПараметрыАмортизацииОСБУ.Организация)
	|				И (ПервоначальныеСведенияОС.ОсновноеСредство = ПараметрыАмортизацииОСБУ.ОсновноеСредство)
	|				И (ПервоначальныеСведенияОС.НачалоМесяца = ПараметрыАмортизацииОСБУ.НачалоМесяца)
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОС2_4 КАК ПринятиеКУчетуОС_БУ
	|			ПО (ПринятиеКУчетуОС_БУ.Ссылка = ПервоначальныеСведенияОС.ДокументВводаВЭксплуатациюБУ)
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОС2_4 КАК ПринятиеКУчетуОС_НУ
	|			ПО (ПринятиеКУчетуОС_НУ.Ссылка = ПервоначальныеСведенияОС.ДокументВводаВЭксплуатациюНУ)
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаБухУчета.СрезПоследних(&НачалоМесяца) КАК УчетнаяПолитикаБухУчета
	|			ПО УчетнаяПолитикаБухУчета.Организация = ПараметрыАмортизацииОСБУ.Организация.ГоловнаяОрганизация
	|
	|	) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.НачалоМесяца,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ОсновноеСредство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НачалоМесяца,
	|	Организация,
	|	ОсновноеСредство";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
		
	#Область АмортизацияОСПриПереходеКЛинейномуМетоду
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НелинейныйМетод.Организация КАК Организация,
	|	ЕСТЬNULL(МИНИМУМ(ЛинейныйМетод.Период), ДАТАВРЕМЯ(2009, 1, 1)) КАК Дата
	|
	|ПОМЕСТИТЬ ДатыПереходаКЛинейномуМетоду
	|
	|ИЗ
	|	РегистрСведений.НастройкиУчетаНалогаНаПрибыль.СрезПоследних(
	|		&НачалоМесяца, 
	|		МетодНачисленияАмортизацииНУ = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Нелинейный)) КАК НелинейныйМетод
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаНалогаНаПрибыль КАК ЛинейныйМетод
	|		ПО ЛинейныйМетод.Организация = НелинейныйМетод.Организация
	|			И ЛинейныйМетод.МетодНачисленияАмортизацииНУ = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Линейный)
	|			И ЛинейныйМетод.Период МЕЖДУ ДАТАВРЕМЯ(2009, 1, 1) И &НачалоМесяца
	|			И ЛинейныйМетод.Период > НелинейныйМетод.Период
	| 
	|СГРУППИРОВАТЬ ПО
	|	НелинейныйМетод.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АмортизацияОС.Организация КАК Организация,
	|	АмортизацияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СУММА(ВЫБОР КОГДА АмортизацияОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА -АмортизацияОС.АмортизацияНУ
	|		ИНАЧЕ АмортизацияОС.АмортизацияНУ
	|	КОНЕЦ) КАК АмортизацияНУ
	|
	|ПОМЕСТИТЬ АмортизацияОСПриПереходеКЛинейномуМетоду
	|
	|ИЗ
	|
	|	ДатыПереходаКЛинейномуМетоду КАК ДатыПереходаКЛинейномуМетоду
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияОС КАК АмортизацияОС
	|		ПО АмортизацияОС.Организация.ГоловнаяОрганизация = ДатыПереходаКЛинейномуМетоду.Организация
	|			И АмортизацияОС.Период < ДатыПереходаКЛинейномуМетоду.Дата
	|			И АмортизацияОС.Активность
	|
	|ГДЕ
	|	ДатыПереходаКЛинейномуМетоду.Дата > ДАТАВРЕМЯ(2009, 1, 1)
	|	И (АмортизацияОС.Организация, АмортизацияОС.ОсновноеСредство) В
	|			(ВЫБРАТЬ
	|				СписокОС.Организация,
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС)
	|
	|СГРУППИРОВАТЬ ПО
	|	АмортизацияОС.Организация,
	|	АмортизацияОС.ОсновноеСредство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
		
	#КонецОбласти
	
	#Область ГрафикиАмортизацииОС
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ГрафикиАмортизацииОС.Организация       КАК Организация,
	|	ГрафикиАмортизацииОС.ОсновноеСредство  КАК ОсновноеСредство,
	|	ГрафикиАмортизацииОС.ГрафикАмортизации КАК ГрафикАмортизации,
	|
	|	&КоэффициентПериода КАК КоэффициентПериода
	|
	|ПОМЕСТИТЬ ГрафикиАмортизацииОС
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииОСБУ.СрезПоследних(
	|			&КонецПредыдущегоМесяца,
	|			(Организация, ОсновноеСредство) В
	|					(ВЫБРАТЬ
	|						СписокОС.Организация,
	|						СписокОС.ОсновноеСредство
	|					ИЗ
	|						СписокОбъектовУчета_БУ КАК СписокОС)) КАК ГрафикиАмортизацииОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГодовыеГрафикиАмортизацииОС КАК ГодовыеГрафикиАмортизацииОС
	|		ПО ГодовыеГрафикиАмортизацииОС.Ссылка = ГрафикиАмортизацииОС.ГрафикАмортизации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КоэффициентПериода", ВнеоборотныеАктивыСлужебный.ТекстПоляКоэффициентПериода("&НачалоМесяца"));
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
		
	#Область Изменения_БУ
	
	#Область ИзменениеПараметров
	ТекстЗапроса =
	// ПараметрыАмортизацииОСБУ
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоМесяца КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.МоментВремени,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.ОсновноеСредство,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.ДатаПоследнегоИзменения КАК ДатаПоследнегоИзменения,
	|	ДанныеРегистра.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользования,
	|	ДанныеРегистра.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемНаработки,
	|	ДанныеРегистра.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации,
	|	ДанныеРегистра.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ДанныеРегистра.КоэффициентАмортизацииБУ,
	|	ДанныеРегистра.КоэффициентУскорения КАК КоэффициентУскоренияБУ,
	|	ДанныеРегистра.ГрафикАмортизации,
	|	ДанныеРегистра.ЛиквидационнаяСтоимость
	|
	|ПОМЕСТИТЬ ПараметрыАмортизацииОСБУ_Изменения
	|
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииОСБУ КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И ДанныеРегистра.ДатаИсправления = ДАТАВРЕМЯ(1,1,1)
	|
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуУзловКомпонентовАмортизации
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|
	|	И ДанныеРегистра.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоПредыдущегоМесяца КАК НачалоМесяца,
	|	&КонецПозапрошлогоМесяца КАК ПериодПараметров,
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.МоментВремени,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.ОсновноеСредство,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.ДатаПоследнегоИзменения КАК ДатаПоследнегоИзменения,
	|	ДанныеРегистра.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользования,
	|	ДанныеРегистра.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемНаработки,
	|	ДанныеРегистра.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации,
	|	ДанныеРегистра.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ДанныеРегистра.КоэффициентАмортизацииБУ,
	|	ДанныеРегистра.КоэффициентУскорения КАК КоэффициентУскоренияБУ,
	|	ДанныеРегистра.ГрафикАмортизации,
	|	ДанныеРегистра.ЛиквидационнаяСтоимость
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииОСБУ КАК ДанныеРегистра
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОбъектовУчета_Доначисление_БУ КАК Доначисление
	|		ПО ДанныеРегистра.ОсновноеСредство = Доначисление.ОсновноеСредство
	|
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
	|	И ДанныеРегистра.Период >= Доначисление.Период
	|	И ДанныеРегистра.ДатаИсправления = ДАТАВРЕМЯ(1,1,1)
	|
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуУзловКомпонентовАмортизации
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// ПервоначальныеСведенияОС
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоМесяца КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.МоментВремени,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.ОсновноеСредство,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.МетодНачисленияАмортизацииБУ,
	|	ДанныеРегистра.ПорядокУчетаБУ
	|
	|ПОМЕСТИТЬ ПервоначальныеСведенияОС_ИзмененияБУ
	|
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОС КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И ДанныеРегистра.ДатаИсправления = ДАТАВРЕМЯ(1,1,1)
	|
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуУзловКомпонентовАмортизации
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|
	|	И ДанныеРегистра.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоПредыдущегоМесяца КАК НачалоМесяца,
	|	&КонецПозапрошлогоМесяца КАК ПериодПараметров,
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.МоментВремени,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.ОсновноеСредство,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.МетодНачисленияАмортизацииБУ,
	|	ДанныеРегистра.ПорядокУчетаБУ
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОС КАК ДанныеРегистра
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОбъектовУчета_Доначисление_БУ КАК Доначисление
	|		ПО ДанныеРегистра.ОсновноеСредство = Доначисление.ОсновноеСредство
	|
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
	|	И ДанныеРегистра.Период >= Доначисление.Период
	|	И ДанныеРегистра.ДатаИсправления = ДАТАВРЕМЯ(1,1,1)
	|
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуУзловКомпонентовАмортизации
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// ПорядокУчетаОС
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоМесяца КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.МоментВремени,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.ОсновноеСредство,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.ГруппаФинансовогоУчета,
	|	ДанныеРегистра.НаправлениеДеятельности,
	|	ДанныеРегистра.ПоказательНаработки,
	|	ДанныеРегистра.ОбъемНаработки
	|
	|ПОМЕСТИТЬ ПорядокУчетаОС_ИзмененияБУ
	|
	|ИЗ
	|	РегистрСведений.ПорядокУчетаОС КАК ДанныеРегистра
	|
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И ДанныеРегистра.ДатаИсправления = ДАТАВРЕМЯ(1,1,1)
	|
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуУзловКомпонентовАмортизации
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|
	|	И ДанныеРегистра.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоПредыдущегоМесяца КАК НачалоМесяца,
	|	&КонецПозапрошлогоМесяца КАК ПериодПараметров,
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.МоментВремени,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.ОсновноеСредство,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.ГруппаФинансовогоУчета,
	|	ДанныеРегистра.НаправлениеДеятельности,
	|	ДанныеРегистра.ПоказательНаработки,
	|	ДанныеРегистра.ОбъемНаработки
	|ИЗ
	|	РегистрСведений.ПорядокУчетаОС КАК ДанныеРегистра
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОбъектовУчета_Доначисление_БУ КАК Доначисление
	|		ПО ДанныеРегистра.ОсновноеСредство = Доначисление.ОсновноеСредство
	|
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
	|	И ДанныеРегистра.Период >= Доначисление.Период
	|	И ДанныеРегистра.ДатаИсправления = ДАТАВРЕМЯ(1,1,1)
	|
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуУзловКомпонентовАмортизации
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// ПорядокУчетаОСБУ
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоМесяца КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.МоментВремени,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.ОсновноеСредство,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.СостояниеБУ,
	|	ДанныеРегистра.НачислятьАмортизациюБУ,
	|	ДанныеРегистра.СпособОтраженияРасходовБУ,
	|	ДанныеРегистра.СтатьяРасходовБУ,
	|	ДанныеРегистра.АналитикаРасходовБУ,
	|	ДанныеРегистра.ПередаватьРасходыВДругуюОрганизацию,
	|	ДанныеРегистра.ОрганизацияПолучательРасходов,
	|	ДанныеРегистра.АмортизационнаяГруппа
	|
	|ПОМЕСТИТЬ ПорядокУчетаОСБУ_Изменения
	|
	|ИЗ
	|	РегистрСведений.ПорядокУчетаОСБУ КАК ДанныеРегистра
	|
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И ДанныеРегистра.ДатаИсправления = ДАТАВРЕМЯ(1,1,1)
	|
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуУзловКомпонентовАмортизации
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|
	|	И ДанныеРегистра.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоПредыдущегоМесяца КАК НачалоМесяца,
	|	&КонецПозапрошлогоМесяца КАК ПериодПараметров,
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.МоментВремени,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.ОсновноеСредство,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.СостояниеБУ,
	|	ДанныеРегистра.НачислятьАмортизациюБУ,
	|	ДанныеРегистра.СпособОтраженияРасходовБУ,
	|	ДанныеРегистра.СтатьяРасходовБУ,
	|	ДанныеРегистра.АналитикаРасходовБУ,
	|	ДанныеРегистра.ПередаватьРасходыВДругуюОрганизацию,
	|	ДанныеРегистра.ОрганизацияПолучательРасходов,
	|	ДанныеРегистра.АмортизационнаяГруппа
	|ИЗ
	|	РегистрСведений.ПорядокУчетаОСБУ КАК ДанныеРегистра
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОбъектовУчета_Доначисление_БУ КАК Доначисление
	|		ПО ДанныеРегистра.ОсновноеСредство = Доначисление.ОсновноеСредство
	|
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
	|	И ДанныеРегистра.Период >= Доначисление.Период
	|	И ДанныеРегистра.ДатаИсправления = ДАТАВРЕМЯ(1,1,1)
	|
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуУзловКомпонентовАмортизации
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// МестонахождениеОС
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоМесяца КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.МоментВремени,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.ОсновноеСредство,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.Местонахождение
	|
	|ПОМЕСТИТЬ МестонахождениеОС_ИзмененияБУ
	|
	|ИЗ
	|	РегистрСведений.МестонахождениеОС КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И ДанныеРегистра.ДатаИсправления = ДАТАВРЕМЯ(1,1,1)
	|
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуУзловКомпонентовАмортизации
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|
	|	И ДанныеРегистра.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоПредыдущегоМесяца КАК НачалоМесяца,
	|	&КонецПозапрошлогоМесяца КАК ПериодПараметров,
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.МоментВремени,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.ОсновноеСредство,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.Местонахождение
	|ИЗ
	|	РегистрСведений.МестонахождениеОС КАК ДанныеРегистра
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОбъектовУчета_Доначисление_БУ КАК Доначисление
	|		ПО ДанныеРегистра.ОсновноеСредство = Доначисление.ОсновноеСредство
	|
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
	|	И ДанныеРегистра.Период >= Доначисление.Период
	|	И ДанныеРегистра.ДатаИсправления = ДАТАВРЕМЯ(1,1,1)
	|
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуУзловКомпонентовАмортизации
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ИзменениеСтоимости
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СтоимостьОС.НачалоМесяца КАК НачалоМесяца,
	|	СтоимостьОС.ПериодПараметров КАК ПериодПараметров,
	|	СтоимостьОС.Период КАК Период,
	|	СтоимостьОС.Регистратор КАК Регистратор,
	|	СтоимостьОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОС.Организация КАК Организация,
	|
	|	СУММА(СтоимостьОС.СтоимостьРегл) КАК СтоимостьРегл
	|
	|ПОМЕСТИТЬ СтоимостьОС_ИзмененияБУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		&НачалоМесяца КАК НачалоМесяца,
	|		&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|		СтоимостьОС.Период КАК Период,
	|		СтоимостьОС.Регистратор КАК Регистратор,
	|		СтоимостьОС.ОсновноеСредство КАК ОсновноеСредство,
	|		СтоимостьОС.Организация КАК Организация,
	|		СтоимостьОС.ПредварительнаяСтоимостьРегл КАК СтоимостьРегл
	|	ИЗ
	|		РегистрНакопления.СтоимостьОС КАК СтоимостьОС
	|	ГДЕ
	|		СтоимостьОС.Активность
	|		И СтоимостьОС.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|		И СтоимостьОС.ОтражатьВРеглУчете
	|		И СтоимостьОС.Регистратор ССЫЛКА Документ.МодернизацияОС2_4
	|
	|		И СтоимостьОС.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&НачалоМесяца,
	|		&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|		СписаниеОС2_4.Дата,
	|		СписаниеОС2_4.Ссылка,
	|		ТаблицаОС.ОсновноеСредство,
	|		СписаниеОС2_4.Организация,
	|		-ТаблицаОС.СуммаСписанияБУ
	|	ИЗ
	|		Документ.СписаниеОС2_4 КАК СписаниеОС2_4
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеОС2_4.ОС КАК ТаблицаОС
	|			ПО (ТаблицаОС.Ссылка = СписаниеОС2_4.Ссылка)
	|	ГДЕ
	|		СписаниеОС2_4.Проведен
	|		И СписаниеОС2_4.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|		И СписаниеОС2_4.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеОСЧастичное)
	|		И ТаблицаОС.СуммаСписанияБУ <> 0
	|
	|		И ТаблицаОС.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&НачалоМесяца,
	|		&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|		ДанныеДокумента.Дата,
	|		ДанныеДокумента.Ссылка,
	|		ДанныеДокумента.ОсновноеСредство,
	|		ДанныеДокумента.Организация,
	|		-СУММА(ТаблицаОС.СтоимостьБУ)
	|	ИЗ
	|		Документ.РазукомплектацияОС КАК ДанныеДокумента
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РазукомплектацияОС.ОС КАК ТаблицаОС
	|			ПО (ТаблицаОС.Ссылка = ДанныеДокумента.Ссылка)
	|	ГДЕ
	|		ДанныеДокумента.Проведен
	|		И ДанныеДокумента.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|		И ДанныеДокумента.ОтражатьВРеглУчете
	|
	|		И ДанныеДокумента.ХозяйственнаяОперация В(
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазукомплектацияОСЧастичная),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыделениеУзловКомпонентовАмортизации))
	|
	|		И ТаблицаОС.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДанныеДокумента.Дата,
	|		ДанныеДокумента.Ссылка,
	|		ДанныеДокумента.ОсновноеСредство,
	|		ДанныеДокумента.Организация
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&НачалоМесяца,
	|		&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|		ПереоценкаОС.Дата,
	|		ПереоценкаОС.Ссылка,
	|		ТаблицаОС.ОсновноеСредство,
	|		ПереоценкаОС.Организация,
	|		ТаблицаОС.СтоимостьБУ
	|	ИЗ
	|		Документ.ПереоценкаОС2_4 КАК ПереоценкаОС
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПереоценкаОС2_4.ОС КАК ТаблицаОС
	|			ПО (ТаблицаОС.Ссылка = ПереоценкаОС.Ссылка)
	|	ГДЕ
	|		ПереоценкаОС.Проведен
	|		И ПереоценкаОС.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|		И ПереоценкаОС.ОтражатьВРеглУчете
	|		И ТаблицаОС.СтоимостьБУ <> 0
	|
	|		И ТаблицаОС.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&НачалоМесяца,
	|		&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|		ИзменениеУсловийДоговораАренды.Дата,
	|		ИзменениеУсловийДоговораАренды.Ссылка,
	|		ТаблицаОС.ОсновноеСредство,
	|		ИзменениеУсловийДоговораАренды.Организация,
	|		ТаблицаОС.СтоимостьБУ
	|	ИЗ
	|		Документ.ИзменениеУсловийДоговораАренды КАК ИзменениеУсловийДоговораАренды
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийДоговораАренды.ОС КАК ТаблицаОС
	|			ПО (ТаблицаОС.Ссылка = ИзменениеУсловийДоговораАренды.Ссылка)
	|	ГДЕ
	|		ИзменениеУсловийДоговораАренды.Проведен
	|		И ИзменениеУсловийДоговораАренды.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|		И ТаблицаОС.СтоимостьБУ <> 0
	|
	|		И ТаблицаОС.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&НачалоМесяца,
	|		&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|		Корректировка.Дата,
	|		Корректировка.Ссылка,
	|		ТаблицаОС.ОсновноеСредство,
	|		Корректировка.Организация,
	|		ТаблицаОС.СтоимостьБУ
	|	ИЗ
	|		Документ.КорректировкаСтоимостиИАмортизацииОС КАК Корректировка
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС.ОС КАК ТаблицаОС
	|			ПО (ТаблицаОС.Ссылка = Корректировка.Ссылка)
	|	ГДЕ
	|		Корректировка.Проведен
	|		И Корректировка.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|		И Корректировка.ОтражатьВРеглУчете
	|		И ТаблицаОС.СтоимостьБУ <> 0
	|
	|		И ТаблицаОС.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&НачалоПредыдущегоМесяца,
	|		&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|		СтоимостьОС.Период,
	|		СтоимостьОС.Регистратор,
	|		СтоимостьОС.ОсновноеСредство,
	|		СтоимостьОС.Организация,
	|		СтоимостьОС.СтоимостьРегл - СтоимостьОС.ПредварительнаяСтоимостьРегл
	|	ИЗ
	|		РегистрНакопления.СтоимостьОС КАК СтоимостьОС
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОбъектовУчета_Доначисление_БУ КАК Доначисление
	|			ПО СтоимостьОС.ОсновноеСредство = Доначисление.ОсновноеСредство
	|
	|	ГДЕ
	|		СтоимостьОС.Активность
	|		И СтоимостьОС.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
	|		И СтоимостьОС.ОтражатьВРеглУчете
	|		И СтоимостьОС.Период >= Доначисление.Период
	|
	|		И СтоимостьОС.Регистратор ССЫЛКА Документ.МодернизацияОС2_4
	|
	|		И СтоимостьОС.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоПредыдущегоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&НачалоМесяца,
	|		&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|		СтоимостьОС.Период,
	|		СтоимостьОС.Регистратор,
	|		СтоимостьОС.ОсновноеСредство,
	|		СтоимостьОС.Организация,
	|		СтоимостьОС.СтоимостьРегл
	|	ИЗ
	|		РегистрНакопления.СтоимостьОС КАК СтоимостьОС
	|
	|	ГДЕ
	|		СтоимостьОС.Активность
	|		И СтоимостьОС.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|		И СтоимостьОС.Регистратор ССЫЛКА Документ.НачислениеСписаниеРезервовПредстоящихРасходов
	|		И СтоимостьОС.СтоимостьРегл <> 0
	|
	|		И (СтоимостьОС.Организация, СтоимостьОС.ОсновноеСредство) В
	|			(ВЫБРАТЬ
	|				СписокОС.Организация,
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|
	|
	|	) КАК СтоимостьОС
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьОС.НачалоМесяца,
	|	СтоимостьОС.ПериодПараметров,
	|	СтоимостьОС.Период,
	|	СтоимостьОС.Регистратор,
	|	СтоимостьОС.ОсновноеСредство,
	|	СтоимостьОС.Организация
	|
	|ИМЕЮЩИЕ
	|	СУММА(СтоимостьОС.СтоимостьРегл) <> 0
	|";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ИзменениеАмортизации
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&НачалоМесяца КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|	Корректировка.Дата КАК Период,
	|	Корректировка.Ссылка КАК Регистратор,
	|	ТаблицаОС.ОсновноеСредство КАК ОсновноеСредство,
	|	Корректировка.Организация КАК Организация,
	|	ТаблицаОС.АмортизацияБУ КАК АмортизацияРегл
	|
	|ПОМЕСТИТЬ АмортизацияОС_ИзмененияБУ
	|
	|ИЗ
	|	Документ.КорректировкаСтоимостиИАмортизацииОС КАК Корректировка
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС.ОС КАК ТаблицаОС
	|		ПО (ТаблицаОС.Ссылка = Корректировка.Ссылка)
	|ГДЕ
	|	Корректировка.Проведен
	|	И Корректировка.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И Корректировка.ОтражатьВРеглУчете
	|	И ТаблицаОС.АмортизацияБУ <> 0
	|
	|	И ТаблицаОС.ОсновноеСредство В
	|		(ВЫБРАТЬ
	|			СписокОС.ОсновноеСредство
	|		ИЗ
	|			СписокОбъектовУчета_БУ КАК СписокОС
	|		ГДЕ
	|			СписокОС.НачалоМесяца = &НачалоМесяца
	|			И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ОбъединениеВсехИзменений
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаИзменений.НачалоМесяца КАК НачалоМесяца,
	|	ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|	ТаблицаИзменений.Регистратор,
	|	МАКСИМУМ(ТаблицаИзменений.Период) КАК Период,
	|	МАКСИМУМ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ТаблицаИзменений.Период, МЕСЯЦ, 1), МЕСЯЦ)) КАК НачалоСледующегоМесяца,
	|	ТаблицаИзменений.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаИзменений.Организация КАК Организация,
	|	МАКСИМУМ(ПервоначальныеСведенияОСПоследнее.Период) КАК ПервоначальныеСведенияОСПоследнееПериод,
	|	МАКСИМУМ(ПараметрыАмортизацииОСБУПоследнее.Период) КАК ПараметрыАмортизацииОСБУПоследнееПериод,
	|	МАКСИМУМ(ПорядокУчетаОСИзмененияПоследнее.Период) КАК ПорядокУчетаОСИзмененияПоследнееПериод,
	|	МАКСИМУМ(ПорядокУчетаОСБУИзмененияПоследнее.Период) КАК ПорядокУчетаОСБУИзмененияПоследнееПериод,
	|	МАКСИМУМ(МестонахождениеОСИзмененияПоследнее.Период) КАК МестонахождениеОСИзмененияПоследнееПериод
	|
	|ПОМЕСТИТЬ ТаблицаИзмененийБУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаИзменений.НачалоМесяца КАК НачалоМесяца,
	|		ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|		ТаблицаИзменений.Регистратор КАК Регистратор,
	|		ТаблицаИзменений.Период КАК Период,
	|		ТаблицаИзменений.ОсновноеСредство КАК ОсновноеСредство,
	|		ТаблицаИзменений.Организация КАК Организация
	|	ИЗ
	|		ПараметрыАмортизацииОСБУ_Изменения КАК ТаблицаИзменений
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаИзменений.НачалоМесяца КАК НачалоМесяца,
	|		ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|		ТаблицаИзменений.Регистратор КАК Регистратор,
	|		ТаблицаИзменений.Период КАК Период,
	|		ТаблицаИзменений.ОсновноеСредство КАК ОсновноеСредство,
	|		ТаблицаИзменений.Организация КАК Организация
	|	ИЗ
	|		ПервоначальныеСведенияОС_ИзмененияБУ КАК ТаблицаИзменений
	|	
	|	ОБЪЕДИНИТЬ
	|
	|	ВЫБРАТЬ
	|		ТаблицаИзменений.НачалоМесяца,
	|		ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|		ТаблицаИзменений.Регистратор,
	|		ТаблицаИзменений.Период,
	|		ТаблицаИзменений.ОсновноеСредство,
	|		ТаблицаИзменений.Организация
	|	ИЗ
	|		ПорядокУчетаОС_ИзмененияБУ КАК ТаблицаИзменений
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаИзменений.НачалоМесяца,
	|		ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|		ТаблицаИзменений.Регистратор,
	|		ТаблицаИзменений.Период,
	|		ТаблицаИзменений.ОсновноеСредство,
	|		ТаблицаИзменений.Организация
	|	ИЗ
	|		ПорядокУчетаОСБУ_Изменения КАК ТаблицаИзменений
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаИзменений.НачалоМесяца,
	|		ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|		ТаблицаИзменений.Регистратор,
	|		ТаблицаИзменений.Период,
	|		ТаблицаИзменений.ОсновноеСредство,
	|		ТаблицаИзменений.Организация
	|	ИЗ
	|		МестонахождениеОС_ИзмененияБУ КАК ТаблицаИзменений
	|
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаИзменений.НачалоМесяца,
	|		ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|		ТаблицаИзменений.Регистратор,
	|		ТаблицаИзменений.Период,
	|		ТаблицаИзменений.ОсновноеСредство,
	|		ТаблицаИзменений.Организация
	|	ИЗ
	|		СтоимостьОС_ИзмененияБУ КАК ТаблицаИзменений
	|
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаИзменений.НачалоМесяца,
	|		ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|		ТаблицаИзменений.Регистратор,
	|		ТаблицаИзменений.Период,
	|		ТаблицаИзменений.ОсновноеСредство,
	|		ТаблицаИзменений.Организация
	|	ИЗ
	|		АмортизацияОС_ИзмененияБУ КАК ТаблицаИзменений
	|
	|	) КАК ТаблицаИзменений
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияОС_ИзмененияБУ КАК ПервоначальныеСведенияОСПоследнее
	|		ПО (ПервоначальныеСведенияОСПоследнее.Организация = ТаблицаИзменений.Организация)
	|			И (ПервоначальныеСведенияОСПоследнее.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (ПервоначальныеСведенияОСПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПервоначальныеСведенияОСПоследнее.Период <= ТаблицаИзменений.Период)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииОСБУ_Изменения КАК ПараметрыАмортизацииОСБУПоследнее
	|		ПО (ПараметрыАмортизацииОСБУПоследнее.Организация = ТаблицаИзменений.Организация)
	|			И (ПараметрыАмортизацииОСБУПоследнее.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (ПараметрыАмортизацииОСБУПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПараметрыАмортизацииОСБУПоследнее.Период <= ТаблицаИзменений.Период)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОС_ИзмененияБУ КАК ПорядокУчетаОСИзмененияПоследнее
	|		ПО (ПорядокУчетаОСИзмененияПоследнее.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (ПорядокУчетаОСИзмененияПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПорядокУчетаОСИзмененияПоследнее.Период <= ТаблицаИзменений.Период)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОСБУ_Изменения КАК ПорядокУчетаОСБУИзмененияПоследнее
	|		ПО (ПорядокУчетаОСБУИзмененияПоследнее.Организация = ТаблицаИзменений.Организация)
	|			И (ПорядокУчетаОСБУИзмененияПоследнее.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (ПорядокУчетаОСБУИзмененияПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПорядокУчетаОСБУИзмененияПоследнее.Период <= ТаблицаИзменений.Период)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОС_ИзмененияБУ КАК МестонахождениеОСИзмененияПоследнее
	|		ПО (МестонахождениеОСИзмененияПоследнее.Организация = ТаблицаИзменений.Организация)
	|			И (МестонахождениеОСИзмененияПоследнее.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (МестонахождениеОСИзмененияПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (МестонахождениеОСИзмененияПоследнее.Период <= ТаблицаИзменений.Период)
	|
	|ГДЕ
	|	ТаблицаИзменений.ОсновноеСредство В (
	|		ВЫБРАТЬ
	|			СписокОС.ОсновноеСредство
	|		ИЗ
	|			СписокОбъектовУчета_БУ КАК СписокОС)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.НачалоМесяца,
	|	ТаблицаИзменений.ПериодПараметров,
	|	ТаблицаИзменений.Регистратор,
	|	ТаблицаИзменений.Организация,
	|	ТаблицаИзменений.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаИзменений.Организация,
	|	ТаблицаИзменений.ОсновноеСредство,
	|	ТаблицаИзменений.НачалоМесяца,
	|	ТаблицаИзменений.Регистратор,
	|	МИНИМУМ(ТаблицаИзмененийСледующее.Период) КАК ПериодСледующее
	|
	|ПОМЕСТИТЬ ТаблицаИзмененийСледующееБУ
	|
	|ИЗ
	|	ТаблицаИзмененийБУ КАК ТаблицаИзменений
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИзмененийБУ КАК ТаблицаИзмененийСледующее
	|		ПО (ТаблицаИзмененийСледующее.Организация = ТаблицаИзменений.Организация)
	|			И (ТаблицаИзмененийСледующее.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (ТаблицаИзмененийСледующее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ТаблицаИзмененийСледующее.Период > ТаблицаИзменений.Период
	|				ИЛИ ТаблицаИзмененийСледующее.Период = ТаблицаИзменений.Период
	|						И ТаблицаИзмененийСледующее.Регистратор > ТаблицаИзменений.Регистратор)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.НачалоМесяца,
	|	ТаблицаИзменений.Регистратор,
	|	ТаблицаИзменений.Организация,
	|	ТаблицаИзменений.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаИзменений.Организация,
	|	ТаблицаИзменений.ОсновноеСредство,
	|	МИНИМУМ(ТаблицаИзменений.Период) КАК ПериодСледующее
	|
	|ПОМЕСТИТЬ ТаблицаИзмененийВЭтомМесяцеБУ
	|
	|ИЗ
	|	ТаблицаИзмененийБУ КАК ТаблицаИзменений
	|ГДЕ
	|	(ТаблицаИзменений.НачалоМесяца = &НачалоМесяца)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.Организация,
	|	ТаблицаИзменений.ОсновноеСредство";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область Изменения_БУ
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаИзменений.НачалоМесяца КАК НачалоМесяца,
	|
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, МЕСЯЦ) = ТаблицаИзменений.НачалоМесяца
	|			ТОГДА НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, ДЕНЬ)
	|		ИНАЧЕ ТаблицаИзменений.ПериодПараметров 
	|	КОНЕЦ КАК ПериодПараметров,
	|
	|	КОНЕЦПЕРИОДА(ТаблицаИзменений.НачалоМесяца, МЕСЯЦ) КАК КонецМесяца,
	|	КОНЕЦПЕРИОДА(ТаблицаИзменений.Период, ДЕНЬ) КАК ДатаИзменений,
	|	ТаблицаИзменений.Регистратор КАК Регистратор,
	|	ТаблицаИзменений.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаИзменений.Организация КАК Организация,
	|
	|	(НЕ ОбъединениеОС.Ссылка ЕСТЬ NULL
	|		ИЛИ НЕ РазукомплектацияОС.Ссылка ЕСТЬ NULL) КАК ПолученПриРазукомплектацииОбъединении,
	|
	|	ВЫБОР 
	|		КОГДА ТаблицаИзменений.НачалоМесяца = &НачалоПредыдущегоМесяца
	|
	|			ТОГДА ВЫБОР
	|					КОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(ТаблицаИзмененийВЭтомМесяце.ПериодСледующее, &КонецМесяца), ДЕНЬ) = &НачалоМесяца
	|						ТОГДА &НачалоМесяца 
	|					ИНАЧЕ ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ТаблицаИзмененийВЭтомМесяце.ПериодСледующее, ДЕНЬ, -1), &КонецМесяца)
	|				КОНЕЦ
	| 
	|		КОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(ТаблицаИзмененийСледующее.ПериодСледующее, &КонецМесяца), ДЕНЬ) = &НачалоМесяца
	|
	|			ТОГДА &НачалоМесяца
	| 
	|		ИНАЧЕ ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ТаблицаИзмененийСледующее.ПериодСледующее, ДЕНЬ, -1), &КонецМесяца)
	| 
	|	КОНЕЦ КАК Период,
	|
	|	РАЗНОСТЬДАТ(ТаблицаИзменений.Период, ЕСТЬNULL(ТаблицаИзмененийСледующее.ПериодСледующее, ТаблицаИзменений.НачалоСледующегоМесяца), ДЕНЬ) КАК СрокДействия,
	|	ЕСТЬNULL(СтоимостьОСИзменения.СтоимостьРегл, 0) КАК СтоимостьРеглИзменение, // Изменение стоимости документом
	|	ЕСТЬNULL(АмортизацияОСИзменения.АмортизацияРегл, 0) КАК АмортизацияРеглИзменение, // Изменение амортизации документом
	|
	|	ПараметрыАмортизацииОСБУПоследнее.ДатаПоследнегоИзменения,
	|	ПараметрыАмортизацииОСБУПоследнее.СрокИспользования,
	|	ПараметрыАмортизацииОСБУПоследнее.ОбъемНаработки,
	|	ПараметрыАмортизацииОСБУПоследнее.КоэффициентАмортизацииБУ,
	|	ПараметрыАмортизацииОСБУПоследнее.КоэффициентУскоренияБУ,
	|	ПараметрыАмортизацииОСБУПоследнее.ЛиквидационнаяСтоимость,
	|	ПараметрыАмортизацииОСБУПоследнее.ГрафикАмортизации,
	|	ПараметрыАмортизацииОСБУПоследнее.ПРДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОСБУПоследнее.СтоимостьДляВычисленияАмортизации,
	|
	|	ПервоначальныеСведенияОСПоследнее.МетодНачисленияАмортизацииБУ,
	|	ПервоначальныеСведенияОСПоследнее.ПорядокУчетаБУ,
	|
	|	ПорядокУчетаОСИзмененияПоследнее.ГруппаФинансовогоУчета,
	|	ПорядокУчетаОСИзмененияПоследнее.НаправлениеДеятельности,
	|	ПорядокУчетаОСИзмененияПоследнее.ПоказательНаработки,
	|
	|	ПорядокУчетаОСБУИзмененияПоследнее.СостояниеБУ,
	|	ПорядокУчетаОСБУИзмененияПоследнее.НачислятьАмортизациюБУ,
	|	ПорядокУчетаОСБУИзмененияПоследнее.СпособОтраженияРасходовБУ,
	|	ПорядокУчетаОСБУИзмененияПоследнее.СтатьяРасходовБУ,
	|	ПорядокУчетаОСБУИзмененияПоследнее.АналитикаРасходовБУ,
	|	ПорядокУчетаОСБУИзмененияПоследнее.ПередаватьРасходыВДругуюОрганизацию,
	|	ПорядокУчетаОСБУИзмененияПоследнее.ОрганизацияПолучательРасходов,
	|	ПорядокУчетаОСБУИзмененияПоследнее.АмортизационнаяГруппа,
	|
	|	МестонахождениеОСИзмененияПоследнее.Местонахождение,
	|	&КоэффициентПериода КАК КоэффициентПериода
	|
	|ПОМЕСТИТЬ Изменения_БУ
	|
	|ИЗ
	|	ТаблицаИзмененийБУ КАК ТаблицаИзменений
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИзмененийСледующееБУ КАК ТаблицаИзмененийСледующее
	|		ПО (ТаблицаИзмененийСледующее.Организация = ТаблицаИзменений.Организация)
	|			И (ТаблицаИзмененийСледующее.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (ТаблицаИзмененийСледующее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ТаблицаИзмененийСледующее.Регистратор = ТаблицаИзменений.Регистратор)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИзмененийВЭтомМесяцеБУ КАК ТаблицаИзмененийВЭтомМесяце
	|		ПО (ТаблицаИзмененийВЭтомМесяце.Организация = ТаблицаИзменений.Организация)
	|			И (ТаблицаИзмененийВЭтомМесяце.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыПоследнегоИзмененияБУ КАК ДатыПоследнегоИзменения
	|		ПО (ДатыПоследнегоИзменения.Организация = ТаблицаИзменений.Организация)
	|			И (ДатыПоследнегоИзменения.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (ДатыПоследнегоИзменения.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияОС_ИзмененияБУ КАК ПервоначальныеСведенияОСПоследнее
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияОС_ИзмененияБУ КАК ПервоначальныеСведенияОССледующее
	|			ПО (ПервоначальныеСведенияОССледующее.Организация = ПервоначальныеСведенияОСПоследнее.Организация)
	|				И (ПервоначальныеСведенияОССледующее.ОсновноеСредство = ПервоначальныеСведенияОСПоследнее.ОсновноеСредство)
	|				И (ПервоначальныеСведенияОССледующее.НачалоМесяца = ПервоначальныеСведенияОСПоследнее.НачалоМесяца)
	|				И (ПервоначальныеСведенияОССледующее.Период = ПервоначальныеСведенияОСПоследнее.Период)
	|				И (ПервоначальныеСведенияОССледующее.МоментВремени > ПервоначальныеСведенияОСПоследнее.МоментВремени)
	|		ПО (ПервоначальныеСведенияОСПоследнее.Организация = ТаблицаИзменений.Организация)
	|			И (ПервоначальныеСведенияОСПоследнее.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (ПервоначальныеСведенияОСПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПервоначальныеСведенияОСПоследнее.Период = ТаблицаИзменений.ПервоначальныеСведенияОСПоследнееПериод)
	|			И (ПервоначальныеСведенияОССледующее.Регистратор ЕСТЬ NULL)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииОСБУ_Изменения КАК ПараметрыАмортизацииОСБУПоследнее
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииОСБУ_Изменения КАК ПараметрыАмортизацииОСБУСледующее
	|			ПО (ПараметрыАмортизацииОСБУСледующее.Организация = ПараметрыАмортизацииОСБУПоследнее.Организация)
	|				И (ПараметрыАмортизацииОСБУСледующее.ОсновноеСредство = ПараметрыАмортизацииОСБУПоследнее.ОсновноеСредство)
	|				И (ПараметрыАмортизацииОСБУСледующее.НачалоМесяца = ПараметрыАмортизацииОСБУПоследнее.НачалоМесяца)
	|				И (ПараметрыАмортизацииОСБУСледующее.Период = ПараметрыАмортизацииОСБУПоследнее.Период)
	|				И (ПараметрыАмортизацииОСБУСледующее.МоментВремени > ПараметрыАмортизацииОСБУПоследнее.МоментВремени)
	|		ПО (ПараметрыАмортизацииОСБУПоследнее.Организация = ТаблицаИзменений.Организация)
	|			И (ПараметрыАмортизацииОСБУПоследнее.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (ПараметрыАмортизацииОСБУПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПараметрыАмортизацииОСБУПоследнее.Период = ТаблицаИзменений.ПараметрыАмортизацииОСБУПоследнееПериод)
	|			И (ПараметрыАмортизацииОСБУСледующее.Регистратор ЕСТЬ NULL)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОС_ИзмененияБУ КАК ПорядокУчетаОСИзмененияПоследнее
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОС_ИзмененияБУ КАК ПорядокУчетаОСИзмененияСледующее
	|			ПО (ПорядокУчетаОСИзмененияСледующее.Организация = ПорядокУчетаОСИзмененияПоследнее.Организация)
	|				И (ПорядокУчетаОСИзмененияСледующее.ОсновноеСредство = ПорядокУчетаОСИзмененияПоследнее.ОсновноеСредство)
	|				И (ПорядокУчетаОСИзмененияСледующее.НачалоМесяца = ПорядокУчетаОСИзмененияПоследнее.НачалоМесяца)
	|				И (ПорядокУчетаОСИзмененияСледующее.Период = ПорядокУчетаОСИзмененияПоследнее.Период)
	|				И (ПорядокУчетаОСИзмененияСледующее.МоментВремени > ПорядокУчетаОСИзмененияПоследнее.МоментВремени)
	|		ПО (ПорядокУчетаОСИзмененияПоследнее.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (ПорядокУчетаОСИзмененияПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПорядокУчетаОСИзмененияПоследнее.Период = ТаблицаИзменений.ПорядокУчетаОСИзмененияПоследнееПериод)
	|			И (ПорядокУчетаОСИзмененияСледующее.Регистратор ЕСТЬ NULL)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОСБУ_Изменения КАК ПорядокУчетаОСБУИзмененияПоследнее
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОСБУ_Изменения КАК ПорядокУчетаОСБУИзмененияСледующее
	|			ПО (ПорядокУчетаОСБУИзмененияСледующее.Организация = ПорядокУчетаОСБУИзмененияПоследнее.Организация)
	|				И (ПорядокУчетаОСБУИзмененияСледующее.ОсновноеСредство = ПорядокУчетаОСБУИзмененияПоследнее.ОсновноеСредство)
	|				И (ПорядокУчетаОСБУИзмененияСледующее.НачалоМесяца = ПорядокУчетаОСБУИзмененияПоследнее.НачалоМесяца)
	|				И (ПорядокУчетаОСБУИзмененияСледующее.Период = ПорядокУчетаОСБУИзмененияПоследнее.Период)
	|				И (ПорядокУчетаОСБУИзмененияСледующее.МоментВремени > ПорядокУчетаОСБУИзмененияПоследнее.МоментВремени)
	|		ПО (ПорядокУчетаОСБУИзмененияПоследнее.Организация = ТаблицаИзменений.Организация)
	|			И (ПорядокУчетаОСБУИзмененияПоследнее.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (ПорядокУчетаОСБУИзмененияПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПорядокУчетаОСБУИзмененияПоследнее.Период = ТаблицаИзменений.ПорядокУчетаОСБУИзмененияПоследнееПериод)
	|			И (ПорядокУчетаОСБУИзмененияСледующее.Регистратор ЕСТЬ NULL)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОС_ИзмененияБУ КАК МестонахождениеОСИзмененияПоследнее
	|			ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОС_ИзмененияБУ КАК МестонахождениеОСИзмененияСледующее
	|			ПО (МестонахождениеОСИзмененияСледующее.Организация = МестонахождениеОСИзмененияПоследнее.Организация)
	|				И (МестонахождениеОСИзмененияСледующее.ОсновноеСредство = МестонахождениеОСИзмененияПоследнее.ОсновноеСредство)
	|				И (МестонахождениеОСИзмененияСледующее.НачалоМесяца = МестонахождениеОСИзмененияПоследнее.НачалоМесяца)
	|				И (МестонахождениеОСИзмененияСледующее.Период = МестонахождениеОСИзмененияПоследнее.Период)
	|				И (МестонахождениеОСИзмененияСледующее.МоментВремени > МестонахождениеОСИзмененияПоследнее.МоментВремени)
	|		ПО (МестонахождениеОСИзмененияПоследнее.Организация = ТаблицаИзменений.Организация)
	|			И (МестонахождениеОСИзмененияПоследнее.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (МестонахождениеОСИзмененияПоследнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (МестонахождениеОСИзмененияПоследнее.Период = ТаблицаИзменений.МестонахождениеОСИзмененияПоследнееПериод)
	|			И (МестонахождениеОСИзмененияСледующее.Регистратор ЕСТЬ NULL)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьОС_ИзмененияБУ КАК СтоимостьОСИзменения
	|		ПО (СтоимостьОСИзменения.Организация = ТаблицаИзменений.Организация)
	|			И (СтоимостьОСИзменения.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (СтоимостьОСИзменения.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (СтоимостьОСИзменения.Регистратор = ТаблицаИзменений.Регистратор)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияОС_ИзмененияБУ КАК АмортизацияОСИзменения
	|		ПО (АмортизацияОСИзменения.Организация = ТаблицаИзменений.Организация)
	|			И (АмортизацияОСИзменения.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (АмортизацияОСИзменения.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (АмортизацияОСИзменения.Регистратор = ТаблицаИзменений.Регистратор)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбъединениеОС КАК ОбъединениеОС
	|		ПО (ОбъединениеОС.Ссылка = ТаблицаИзменений.Регистратор)
	|			И (ОбъединениеОС.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РазукомплектацияОС.ОС КАК РазукомплектацияОС
	|		ПО (РазукомплектацияОС.Ссылка = ТаблицаИзменений.Регистратор)
	|			И (РазукомплектацияОС.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГодовыеГрафикиАмортизацииОС КАК ГодовыеГрафикиАмортизацииОС
	|		ПО ГодовыеГрафикиАмортизацииОС.Ссылка = ПараметрыАмортизацииОСБУПоследнее.ГрафикАмортизации";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КоэффициентПериода", ВнеоборотныеАктивыСлужебный.ТекстПоляКоэффициентПериода("ТаблицаИзменений.НачалоМесяца"));

	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#КонецОбласти
	
	#Область ПериодИзменения_БУ
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Изменения_БУ.НачалоМесяца           КАК НачалоМесяца,
	|	Изменения_БУ.ОсновноеСредство       КАК ОсновноеСредство,
	|	Изменения_БУ.Организация            КАК Организация,
	|	МИНИМУМ(Изменения_БУ.ДатаИзменений) КАК Период
	|ПОМЕСТИТЬ ПериодИзменения_БУ
	|ИЗ
	|	Изменения_БУ КАК Изменения_БУ
	|
	|СГРУППИРОВАТЬ ПО
	|	Изменения_БУ.НачалоМесяца,
	|	Изменения_БУ.ОсновноеСредство,
	|	Изменения_БУ.Организация";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область СписокОССПараметрами_БУ
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВЫБОР 
	|		КОГДА ПериодИзмененияВТекущемМесяце.Период ЕСТЬ NULL
	|			ТОГДА СписокОС.ПериодНачисления
	|		КОГДА НАЧАЛОПЕРИОДА(ПериодИзмененияВТекущемМесяце.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(ПериодИзмененияВТекущемМесяце.Период, МЕСЯЦ)
	|			ТОГДА ПериодИзмененияВТекущемМесяце.Период
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ПериодИзмененияВТекущемМесяце.Период, ДЕНЬ, -1)
	|	КОНЕЦ КАК Период,
	|
	|	СписокОС.ЭтоДоначисление,
	|	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СписокОС.Организация КАК Организация,
	|
	|	ВЫБОР
	|		КОГДА СписокОС.ЭтоДоначисление
	|			ТОГДА МестонахождениеОСНаНачалоМесяца.Местонахождение
	|		ИНАЧЕ МестонахождениеОС.Местонахождение 
	|	КОНЕЦ КАК Подразделение,
	|
	|	ВЫБОР
	|		КОГДА СписокОС.ЭтоДоначисление
	|			ТОГДА ПорядокУчетаОСНаНачалоМесяца.ГруппаФинансовогоУчета
	|		ИНАЧЕ ПорядокУчетаОС.ГруппаФинансовогоУчета 
	|	КОНЕЦ КАК ГруппаФинансовогоУчета,
	|
	|	ВЫБОР
	|		КОГДА СписокОС.ЭтоДоначисление
	|			ТОГДА ПорядокУчетаОСНаНачалоМесяца.НаправлениеДеятельности
	|		ИНАЧЕ ПорядокУчетаОС.НаправлениеДеятельности 
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|
	|	ПорядокУчетаОС.ПоказательНаработки,
	|	ПорядокУчетаОС.ОбъемНаработки,
	|	ПараметрыАмортизацииОСБУ.ОбъемПродукцииРаботДляВычисленияАмортизации,
	|
	|	СписокОС.НачислятьАмортизациюБУ КАК НачислятьАмортизациюБУ,
	|	СписокОС.НачислятьАмортизациюНУ КАК НачислятьАмортизациюНУ,
	|	СписокОС.АмортизацияНачисляетсяПоСтандартамМУ КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|	СписокОС.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	ВЫБОР
	|		КОГДА СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СоСледующегоМесяца)
	|	КОНЕЦ КАК ПорядокНачисленияАмортизацииБУ,
	|
	|	ПорядокУчетаОСБУ.СтатьяРасходовБУ КАК СтатьяРасходов,
	|	ПорядокУчетаОСБУ.АналитикаРасходовБУ КАК АналитикаРасходов,
	|
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(СписокОС.ОсновноеСредство КАК Справочник.ОбъектыЭксплуатации).ТипОС = ЗНАЧЕНИЕ(Перечисление.ТипыОС.ГрупповоеОС)
	|				И ПорядокУчетаОСБУ.СпособОтраженияРасходовБУ В (&ПустыеСпособыОтраженияРасходов)
	|			ТОГДА СписокОС.ОсновноеСредство
	|		ИНАЧЕ ПорядокУчетаОСБУ.СпособОтраженияРасходовБУ
	|	КОНЕЦ КАК СпособОтраженияРасходов,
	|
	|	ПорядокУчетаОСБУ.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ПорядокУчетаОСБУ.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|
	|	ЕСТЬNULL(ГрафикиАмортизацииОС.ГрафикАмортизации, ЗНАЧЕНИЕ(Справочник.ГодовыеГрафикиАмортизацииОС.ПустаяСсылка)) КАК ГрафикАмортизации,
	|	ЕСТЬNULL(ГрафикиАмортизацииОС.КоэффициентПериода, 0) КАК КоэффициентПериода,
	|
	// РесурсНазначенный
	|	ВЫБОР 
	|		КОГДА ПервоначальныеСведенияОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)
	|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииОСБУ.ОбъемПродукцииРаботДляВычисленияАмортизации, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СрокИспользованияДляВычисленияАмортизации, 0)
	|	КОНЕЦ КАК РесурсНазначенный,
	|
	// РесурсВыработанныйЗаТекущийПериод
	|	ВЫБОР
	|		КОГДА ДатыПоследнегоИзменения.Дата = НАЧАЛОПЕРИОДА(ПериодИзменения_БУ.Период, ДЕНЬ)
	|			ТОГДА 0
	|
	|		КОГДА ПервоначальныеСведенияОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)
	|
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР 
	|					КОГДА НЕ ПериодИзменения_БУ.Период ЕСТЬ NULL
	|						ТОГДА ВЫБОР 
	|								КОГДА НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|									ТОГДА (РАЗНОСТЬДАТ(ДатыПоследнегоИзменения.Дата, ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ПериодИзменения_БУ.Период, ДЕНЬ, -1), СписокОС.КонецМесяца), ДЕНЬ) + 1)
	|									ИНАЧЕ (РАЗНОСТЬДАТ(СписокОС.НачалоМесяца, ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ПериодИзменения_БУ.Период, ДЕНЬ, -1), СписокОС.КонецМесяца), ДЕНЬ) + 1)
	|							КОНЕЦ / ДЕНЬ(СписокОС.КонецМесяца)
	|					ИНАЧЕ 1
	|				КОНЕЦ * ВЫБОР
	|							КОГДА СписокОС.ЭтоДоначисление
	|								ТОГДА ЕСТЬNULL(ВыработкаОС.ОбъемВыработкиЗаПрошлыйМесяц, 0)
	|							КОГДА НЕ СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|									И НАЧАЛОПЕРИОДА(ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ, МЕСЯЦ) = &НачалоПредыдущегоМесяца
	|								ТОГДА ЕСТЬNULL(ВыработкаОС.ОбъемВыработки, 0) + ЕСТЬNULL(ВыработкаОС.ОбъемВыработкиЗаПрошлыйМесяц, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВыработкаОС.ОбъемВыработки, 0)
	|						КОНЕЦ КАК ЧИСЛО(20,8))
	|	
	|		КОГДА НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|
	|			ТОГДА ВЫРАЗИТЬ((РАЗНОСТЬДАТ(ДатыПоследнегоИзменения.Дата, ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ПериодИзменения_БУ.Период, ДЕНЬ, -1), СписокОС.КонецМесяца), ДЕНЬ) + 1)
	|					/ ДЕНЬ(СписокОС.КонецМесяца) КАК ЧИСЛО(20,8))
	|	
	|		ИНАЧЕ ВЫРАЗИТЬ((РАЗНОСТЬДАТ(СписокОС.НачалоМесяца, ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ПериодИзменения_БУ.Период, ДЕНЬ, -1), СписокОС.КонецМесяца), ДЕНЬ) + 1)
	|					/ ДЕНЬ(СписокОС.КонецМесяца) КАК ЧИСЛО(20,8))
	|
	|	КОНЕЦ КАК РесурсВыработанныйЗаТекущийПериод,
	|
	// РесурсВыработанныйЗаПрошлыйПериод
	|	ВЫБОР 
	|		КОГДА ПервоначальныеСведенияОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)
	|			ТОГДА ВЫБОР
	|					КОГДА СписокОС.ЭтоДоначисление
	|						ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВыработкаОС.ОбъемВыработкиНаНачалоПредыдущегоМесяца, 0) КАК ЧИСЛО(20,8))
	|					КОГДА НЕ СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|							И НАЧАЛОПЕРИОДА(ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ, МЕСЯЦ) = &НачалоПредыдущегоМесяца
	|						ТОГДА 0
	|					ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВыработкаОС.ОбъемВыработкиНаНачалоМесяца, 0) КАК ЧИСЛО(20,8))
	|				КОНЕЦ
	|
	|		КОГДА НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|				ИЛИ ДатыПоследнегоИзменения.Дата ЕСТЬ NULL
	|
	|			ТОГДА ВЫРАЗИТЬ(0 КАК ЧИСЛО(20,8))
	|
			// В следующем месяце после принятия к учету: [кол-во отработаннных дней в мес принятия] / [всего дней в мес принятия]
	|		КОГДА КОНЕЦПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(СписокОС.НачалоМесяца, МЕСЯЦ, -1), МЕСЯЦ)
	|
	|			ТОГДА ВЫРАЗИТЬ((РАЗНОСТЬДАТ(ДатыПоследнегоИзменения.Дата, КОНЕЦПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ), ДЕНЬ) + 1) 
	|					/ ДЕНЬ(КОНЕЦПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ)) КАК ЧИСЛО(20,8))
	|
			// В более поздних месяцах: [кол-во отработаннных дней в мес принятия] / [всего дней в мес принятия] + [кол-во месяцев после принятия до начала месяца]
	|		ИНАЧЕ
	|			ВЫРАЗИТЬ((РАЗНОСТЬДАТ(ДатыПоследнегоИзменения.Дата, КОНЕЦПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ), ДЕНЬ) + 1) 
	|				/ ДЕНЬ(КОНЕЦПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ))
	|				+ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДатыПоследнегоИзменения.Дата, МЕСЯЦ, 1), МЕСЯЦ), СписокОС.КонецМесяца, МЕСЯЦ) КАК ЧИСЛО(20,8))
	|
	|	КОНЕЦ КАК РесурсВыработанныйЗаПрошлыйПериод,
	|
	// ОтработанныхМесяцевПолныхЛет
	|	ВЫБОР
	|		КОГДА ГОД(ДатыПоследнегоИзменения.Дата) <> ГОД(СписокОС.НачалоМесяца) ТОГДА
	|			13 - МЕСЯЦ(ДатыПоследнегоИзменения.Дата)
	|				+ 12 * (ГОД(СписокОС.НачалоМесяца) - Год(ДатыПоследнегоИзменения.Дата) - 1)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОтработанныхМесяцевПолныхЛет,
	|
	// ЧислоЛетПользования
	|	ВЫБОР
	|		КОГДА ПараметрыАмортизацииОСБУ.СрокИспользованияДляВычисленияАмортизации / 12 < 1
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ПараметрыАмортизацииОСБУ.СрокИспользованияДляВычисленияАмортизации / 12 - 0.5 КАК ЧИСЛО(4,0))
	|	КОНЕЦ
	|		+ ВЫБОР 
	|			КОГДА (ПараметрыАмортизацииОСБУ.СрокИспользованияДляВычисленияАмортизации / 12 
	|					- ВЫБОР
	|							КОГДА ПараметрыАмортизацииОСБУ.СрокИспользованияДляВычисленияАмортизации / 12 < 1
	|								ТОГДА 0
	|							ИНАЧЕ ВЫРАЗИТЬ(ПараметрыАмортизацииОСБУ.СрокИспользованияДляВычисленияАмортизации / 12 - 0.5 КАК ЧИСЛО(4,0))
	|						КОНЕЦ) > 0 
	|				ТОГДА 1 
	|			ИНАЧЕ 0 
	|		КОНЕЦ КАК ЧислоЛетПользования,
	|
	// ЧислоПрошедшихЛет
	|	ВЫБОР
	|		КОГДА (&ЧислоПрошедшихЛет / 12) < 1
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(&ЧислоПрошедшихЛет / 12 - 0.5 КАК ЧИСЛО(4,0))
	|	КОНЕЦ КАК ЧислоПрошедшихЛет,
	|
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0)   КАК СтоимостьНУ,
	|
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьПР, 0)   КАК СтоимостьПР,
	|
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьВР, 0)   КАК СтоимостьВР,
	|
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.МодернизацияОС2_4)
	|				И (СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|						И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ ДатыПоследнегоИзменения.ПринятиеКУчетуПрошлойДатойБУ
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, МЕСЯЦ) = СписокОС.НачалоМесяца)
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьРегл, 0) * ЕСТЬNULL(ПредварительнаяСтоимостьОС.ДоляЦФ, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0)
	| 
	|	КОНЕЦ КАК СтоимостьЦФ,
	|
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0) КАК СтоимостьНУЦФ,
	|
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.МодернизацияОС2_4)
	|				И (СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|						И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ ДатыПоследнегоИзменения.ПринятиеКУчетуПрошлойДатойБУ
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, МЕСЯЦ) = СписокОС.НачалоМесяца)
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьРегл, 0) * ЕСТЬNULL(ПредварительнаяСтоимостьОС.ДоляЦФ, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0)
	| 
	|	КОНЕЦ КАК СтоимостьПРЦФ,
	|
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьВРЦФ, 0) КАК СтоимостьВРЦФ,
	|	ЕСТЬNULL(СтоимостьОС.АмортизационнаяПремия, 0) КАК АмортизационнаяПремия,
	|	
	|	ЕСТЬNULL(СтоимостьОСНаНачалоГода.СтоимостьРегл, 0) 
	|		+ ЕСТЬNULL(СтоимостьОСНаНачалоГода.СтоимостьЦФ, 0)
	|		- ЕСТЬNULL(АмортизацияОСНаНачалоГода.АмортизацияРегл, 0) 
	|		- ЕСТЬNULL(АмортизацияОСНаНачалоГода.АмортизацияЦФ, 0) КАК СтоимостьНаНачалоГода,
	|
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0)
	|		+ ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0) КАК СтоимостьНУНачальныйОстаток,
	|
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияНУ, 0) КАК ОстаточнаяСтоимостьНУ,
	|
	// ОстаточнаяСтоимостьПР
	|	ВЫБОР
	|		КОГДА СписокОС.ЭтоДоначисление
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьРегл, 0)
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьОС.СтоимостьПР, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияПР, 0) 
	|	КОНЕЦ КАК ОстаточнаяСтоимостьПР,
	|
	// ОстаточнаяСтоимостьЦФ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.МодернизацияОС2_4)
	|				И (СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|						И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ ДатыПоследнегоИзменения.ПринятиеКУчетуПрошлойДатойБУ
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, МЕСЯЦ) = СписокОС.НачалоМесяца)
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьРегл, 0) * ЕСТЬNULL(ПредварительнаяСтоимостьОС.ДоляЦФ, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияЦФ, 0)
	| 
	|	КОНЕЦ КАК ОстаточнаяСтоимостьЦФ,
	|
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияНУЦФ, 0) КАК ОстаточнаяСтоимостьНУЦФ,
	|
	// ОстаточнаяСтоимостьПРЦФ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.МодернизацияОС2_4)
	|				И (СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|						И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ ДатыПоследнегоИзменения.ПринятиеКУчетуПрошлойДатойБУ
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, МЕСЯЦ) = СписокОС.НачалоМесяца)
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьРегл, 0) * ЕСТЬNULL(ПредварительнаяСтоимостьОС.ДоляЦФ, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияПРЦФ, 0)
	| 
	|	КОНЕЦ КАК ОстаточнаяСтоимостьПРЦФ,
	|	
	// СтоимостьРегл
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И (СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ ДатыПоследнегоИзменения.ПринятиеКУчетуПрошлойДатойБУ
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, МЕСЯЦ) = СписокОС.НачалоМесяца)
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьРегл, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьОС.СтоимостьРегл, 0)
	|
	|	КОНЕЦ КАК СтоимостьРегл,
	|
	// ОстаточнаяСтоимостьРегл
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И (СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ ДатыПоследнегоИзменения.ПринятиеКУчетуПрошлойДатойБУ
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, МЕСЯЦ) = СписокОС.НачалоМесяца)
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьРегл, 0) - ЕСТЬNULL(ПредварительнаяАмортизацияОС.АмортизацияРегл, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьОС.СтоимостьРегл, 0) 
	|				+ ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0)
	|				- ЕСТЬNULL(АмортизацияОС.АмортизацияРегл, 0)
	|				- ЕСТЬNULL(АмортизацияОС.АмортизацияЦФ, 0)
	|
	|	КОНЕЦ КАК ОстаточнаяСтоимостьРегл,
	|
	// СтоимостьДляВычисленияАмортизации
	|	ВЫБОР 
	|		КОГДА НЕ СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|
	|			ТОГДА ПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизации
	|
	|		КОГДА ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И (СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ ДатыПоследнегоИзменения.ПринятиеКУчетуПрошлойДатойБУ
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, МЕСЯЦ) = СписокОС.НачалоМесяца)
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьРегл, 0) - ЕСТЬNULL(ПредварительнаяАмортизацияОС.АмортизацияРегл, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьОС.СтоимостьРегл, 0) 
	|				+ ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0)
	|				- ЕСТЬNULL(АмортизацияОС.АмортизацияРегл, 0)
	|				- ЕСТЬNULL(АмортизацияОС.АмортизацияЦФ, 0)
	|
	|	КОНЕЦ КАК СтоимостьДляВычисленияАмортизации,
	|
	|	ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизации, 0) КАК СтоимостьДляВычисленияПР,
	|
	|	ЕСТЬNULL(АмортизацияОС.АмортизацияРегл, 0) КАК АмортизацияРегл,
	|
	|	ЕСТЬNULL(АмортизацияОС.АмортизацияНУ, 0)
	|		+ ЕСТЬNULL(АмортизацияОС.АмортизацияНУЦФ, 0) КАК АмортизацияНУНачальныйОстаток,
	|
	|	ЕСТЬNULL(ОбесценениеНаНачалоМесяца.ОстатокОбесцененияРегл, 0) КАК ОстатокОбесцененияРегл,
	|
	// ОбъемВыработки
	|	ВЫБОР
	|		КОГДА СписокОС.ЭтоДоначисление
	|			ТОГДА ЕСТЬNULL(ВыработкаОС.ОбъемВыработкиЗаПрошлыйМесяц, 0)
	|		КОГДА НЕ СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|				И НАЧАЛОПЕРИОДА(ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ, МЕСЯЦ) = &НачалоПредыдущегоМесяца
	|			ТОГДА ЕСТЬNULL(ВыработкаОС.ОбъемВыработки, 0) + ЕСТЬNULL(ВыработкаОС.ОбъемВыработкиЗаПрошлыйМесяц, 0)
	|		ИНАЧЕ ЕСТЬNULL(ВыработкаОС.ОбъемВыработки, 0)
	|	КОНЕЦ КАК ОбъемВыработки,
	|
	// ОбъемВыработкиНаНачалоМесяца
	|	ВЫБОР
	|		КОГДА СписокОС.ЭтоДоначисление
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВыработкаОС.ОбъемВыработкиНаНачалоПредыдущегоМесяца, 0) КАК ЧИСЛО(20,8))
	|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВыработкаОС.ОбъемВыработкиНаНачалоМесяца, 0) КАК ЧИСЛО(20,8))
	|	КОНЕЦ КАК ОбъемВыработкиНаНачалоМесяца,
	|
	|	ПервоначальныеСведенияОС.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|	ПервоначальныеСведенияОС.ПорядокУчетаНУ КАК ПорядокУчетаНУ,
	|	ПервоначальныеСведенияОС.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизацииБУ,
	|
	|	ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СрокПолезногоИспользованияБУ, 0) КАК СрокПолезногоИспользованияБУ,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСБУ.КоэффициентАмортизацииБУ, 0) КАК КоэффициентАмортизацииБУ,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСБУ.КоэффициентУскорения, 0) КАК КоэффициентУскоренияБУ,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСБУ.ОбъемПродукцииРаботДляВычисленияАмортизации, 0) КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СрокИспользованияДляВычисленияАмортизации, 0) КАК СрокИспользованияДляВычисленияАмортизации,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСБУ.ЛиквидационнаяСтоимость, 0) КАК ЛиквидационнаяСтоимость,
	|	ЕСТЬNULL(ДатыПоследнегоИзменения.Дата, ДАТАВРЕМЯ(1,1,1)) КАК ДатаПоследнегоИзменения,
	|
	// ПРДляВычисленияАмортизации
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.МодернизацияОС2_4)
	|				И (СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|						И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ ДатыПоследнегоИзменения.ПринятиеКУчетуПрошлойДатойБУ
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, МЕСЯЦ) = СписокОС.НачалоМесяца)
	|				И ЕСТЬNULL(ПредварительнаяСтоимостьОС.ДоляЦФ, 0) <> 0
	|
	|		ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьРегл, 0) * ЕСТЬNULL(ПредварительнаяСтоимостьОС.ДоляЦФ, 0)
	|
	|		ИНАЧЕ ПараметрыАмортизацииОСБУ.ПРДляВычисленияАмортизации
	|
	|	КОНЕЦ КАК ПРДляВычисленияАмортизации,
	|
	// КоэффициентЦФБУ
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.МодернизацияОС2_4)
	|				И (СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|						И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ ДатыПоследнегоИзменения.ПринятиеКУчетуПрошлойДатойБУ
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, МЕСЯЦ) = СписокОС.НачалоМесяца)
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьОС.ДоляЦФ, 0)
	|
	|		КОГДА ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0) = 0
	|			ИЛИ (ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияЦФ, 0)) <= 0
	|
	|			ТОГДА 0
	|
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьРегл, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияРегл, 0)) <= 0
	|
	|			ТОГДА 1
	|
	|		КОГДА ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизацииЦФ, 0) <> 0
	|				И ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизации, 0) <> 0
	|
	|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизацииЦФ, 0) 
	|					/ ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизации, 0)
	|
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьРегл, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0)) <> 0
	|
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0) 
	|							/ (ЕСТЬNULL(СтоимостьОС.СтоимостьРегл, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0)) КАК ЧИСЛО (23, 10))
	|
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентЦФБУ,
	|
	// КоэффициентЦФНУ
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0) = 0
	|				ИЛИ (ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияНУЦФ, 0)) <= 0
	|
	|			ТОГДА 0
	|
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияНУ, 0)) <= 0
	|
	|			ТОГДА 1
	|
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0)) <> 0
	|
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0) 
	|							/ (ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0)) КАК ЧИСЛО (23, 10))
	|
	|		ИНАЧЕ 0
	|
	|	КОНЕЦ КАК КоэффициентЦФНУ,
	|
	// КоэффициентЦФПР
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.МодернизацияОС2_4)
	|				И (СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|						И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ ДатыПоследнегоИзменения.ПринятиеКУчетуПрошлойДатойБУ
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, МЕСЯЦ) = СписокОС.НачалоМесяца)
	|				И ЕСТЬNULL(ПредварительнаяСтоимостьОС.ДоляЦФ, 0) <> 0
	|
	|			ТОГДА 1
	|
	|		КОГДА ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0) = 0
	|			ИЛИ (ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияЦФ, 0)) <= 0
	|
	|			ТОГДА 0
	|
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьПР, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияПР, 0)) <= 0
	|
	|			ТОГДА 1
	|
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьПР, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0)) <> 0
	|
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0) 
	|							/ (ЕСТЬNULL(СтоимостьОС.СтоимостьПР, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0)) КАК ЧИСЛО (23, 10))
	|
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентЦФПР
	|
	|ПОМЕСТИТЬ СписокОССПараметрами_БУ
	|
	|ИЗ
	|	СписокОбъектовУчета_БУ КАК СписокОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодИзменения_БУ КАК ПериодИзменения_БУ
	|		ПО (ПериодИзменения_БУ.Организация = СписокОС.Организация)
	|			И (ПериодИзменения_БУ.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПериодИзменения_БУ.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодИзменения_БУ КАК ПериодИзмененияВТекущемМесяце
	|		ПО (ПериодИзмененияВТекущемМесяце.Организация = СписокОС.Организация)
	|			И (ПериодИзмененияВТекущемМесяце.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПериодИзмененияВТекущемМесяце.НачалоМесяца = &НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыПоследнегоИзмененияБУ КАК ДатыПоследнегоИзменения
	|		ПО (ДатыПоследнегоИзменения.Организация = СписокОС.Организация)
	|			И (ДатыПоследнегоИзменения.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ДатыПоследнегоИзменения.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОС КАК ПорядокУчетаОС
	|		ПО (ПорядокУчетаОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПорядокУчетаОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|			И (ПорядокУчетаОС.ПериодПараметров = СписокОС.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОС КАК ПорядокУчетаОСНаНачалоМесяца
	|		ПО (ПорядокУчетаОСНаНачалоМесяца.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПорядокУчетаОСНаНачалоМесяца.НачалоМесяца = &НачалоМесяца)
	|			И (ПорядокУчетаОСНаНачалоМесяца.ПериодПараметров = &КонецПредыдущегоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьОС_НаНачалоМесяца КАК СтоимостьОС
	|		ПО (СтоимостьОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (СтоимостьОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьОС_НаНачалоГода КАК СтоимостьОСНаНачалоГода
	|		ПО (СтоимостьОСНаНачалоГода.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредварительнаяСтоимостьОС КАК ПредварительнаяСтоимостьОС
	|		ПО (ПредварительнаяСтоимостьОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПредварительнаяСтоимостьОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредварительнаяАмортизацияОС КАК ПредварительнаяАмортизацияОС
	|		ПО (ПредварительнаяАмортизацияОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПредварительнаяАмортизацияОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|			И (ДатыПоследнегоИзменения.ПринятиеКУчетуПрошлойДатойБУ)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияОС_НаНачалоМесяца КАК АмортизацияОС
	|		ПО (АмортизацияОС.Организация = СписокОС.Организация)
	|			И (АмортизацияОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (АмортизацияОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияОС_НаНачалоГода КАК АмортизацияОСНаНачалоГода
	|		ПО (АмортизацияОСНаНачалоГода.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбесценениеВНА КАК ОбесценениеНаНачалоМесяца
	|		ПО (ОбесценениеНаНачалоМесяца.Организация = СписокОС.Организация)
	|			И (ОбесценениеНаНачалоМесяца.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ОбесценениеНаНачалоМесяца.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОС КАК МестонахождениеОС
	|		ПО (МестонахождениеОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (МестонахождениеОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|			И (МестонахождениеОС.ПериодПараметров = СписокОС.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОС КАК МестонахождениеОСНаНачалоМесяца
	|		ПО (МестонахождениеОСНаНачалоМесяца.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (МестонахождениеОСНаНачалоМесяца.НачалоМесяца = &НачалоМесяца)
	|			И (МестонахождениеОСНаНачалоМесяца.ПериодПараметров = &КонецПредыдущегоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияОС КАК ПервоначальныеСведенияОС
	|		ПО (ПервоначальныеСведенияОС.Организация = СписокОС.Организация)
	|			И (ПервоначальныеСведенияОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПервоначальныеСведенияОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|			И (ПервоначальныеСведенияОС.ПериодПараметров = СписокОС.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииОСБУ КАК ПараметрыАмортизацииОСБУ
	|		ПО (ПараметрыАмортизацииОСБУ.Организация = СписокОС.Организация)
	|			И (ПараметрыАмортизацииОСБУ.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПараметрыАмортизацииОСБУ.НачалоМесяца = СписокОС.НачалоМесяца)
	|			И (ПараметрыАмортизацииОСБУ.ПериодПараметров = СписокОС.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОСБУ КАК ПорядокУчетаОСБУ
	|		ПО (ПорядокУчетаОСБУ.Организация = СписокОС.Организация)
	|			И (ПорядокУчетаОСБУ.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПорядокУчетаОСБУ.НачалоМесяца = СписокОС.НачалоМесяца)
	|			И (ПорядокУчетаОСБУ.ПериодПараметров = СписокОС.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГрафикиАмортизацииОС КАК ГрафикиАмортизацииОС
	|		ПО (ГрафикиАмортизацииОС.Организация = СписокОС.Организация)
	|			И (ГрафикиАмортизацииОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыработкаОС КАК ВыработкаОС
	|		ПО (ВыработкаОС.ОсновноеСредство = ПорядокУчетаОС.ОсновноеСредство)
	|			И (ВыработкаОС.ПоказательНаработки = ПорядокУчетаОС.ПоказательНаработки)
	|			И (ВыработкаОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|ГДЕ
	|	СписокОС.НачислятьАмортизациюБУ
	|	И (НЕ СписокОС.ЭтоДоначисление
	|		ИЛИ СписокОС.НачалоМесяца = НАЧАЛОПЕРИОДА(ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ, МЕСЯЦ))
	|	И НЕ СписокОС.ПолученПриРазукомплектацииОбъединении
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация";
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"&ЧислоПрошедшихЛет", 
		ВнеоборотныеАктивыСлужебный.ТекстПоляФактическийСрокИспользования("ДОБАВИТЬКДАТЕ(ДатыПоследнегоИзменения.Дата, МЕСЯЦ, 1)"));
	
	СписокЗапросов.Добавить(ТекстЗапроса);
		
	#КонецОбласти
	
	#Область СписокОССИзмененнымиПараметрами_БУ
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Изменения_БУ.Период КАК Период,
	|	Изменения_БУ.Регистратор КАК Регистратор,
	|	Изменения_БУ.ОсновноеСредство КАК ОсновноеСредство,
	|	Изменения_БУ.Организация КАК Организация,
	|	(Изменения_БУ.НачалоМесяца = &НачалоПредыдущегоМесяца) КАК ЭтоДоначисление,
	|
	|	СписокОС.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	Изменения_БУ.ПолученПриРазукомплектацииОбъединении КАК ПолученПриРазукомплектацииОбъединении,
	| 
	|	ЕСТЬNULL(Изменения_БУ.ГруппаФинансовогоУчета, ПорядокУчетаОС.ГруппаФинансовогоУчета) КАК ГруппаФинансовогоУчета,
	|
	|	ЕСТЬNULL(Изменения_БУ.НаправлениеДеятельности, ПорядокУчетаОС.НаправлениеДеятельности) КАК НаправлениеДеятельности,
	|
	|	ЕСТЬNULL(Изменения_БУ.ПоказательНаработки, ПорядокУчетаОС.ПоказательНаработки) КАК ПоказательНаработки,
	|	ЕСТЬNULL(Изменения_БУ.ОбъемНаработки, ЕСТЬNULL(ПорядокУчетаОС.ОбъемНаработки, 0)) КАК ОбъемНаработки,
	|
	|	ЕСТЬNULL(Изменения_БУ.НачислятьАмортизациюБУ, СписокОС.НачислятьАмортизациюБУ) КАК НачислятьАмортизациюБУ,
	|	СписокОС.АмортизацияНачисляетсяПоСтандартамМУ КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету) КАК ПорядокНачисленияАмортизацииБУ,
	|
	|	ЕСТЬNULL(Изменения_БУ.СтатьяРасходовБУ, ПорядокУчетаОСБУ.СтатьяРасходовБУ) КАК СтатьяРасходов,
	|	ЕСТЬNULL(Изменения_БУ.АналитикаРасходовБУ, ПорядокУчетаОСБУ.АналитикаРасходовБУ) КАК АналитикаРасходов,
	|
	|	ЕСТЬNULL(Изменения_БУ.СпособОтраженияРасходовБУ, ПорядокУчетаОСБУ.СпособОтраженияРасходовБУ) КАК СпособОтраженияРасходов,
	|	ЕСТЬNULL(Изменения_БУ.ПередаватьРасходыВДругуюОрганизацию, ПорядокУчетаОСБУ.ПередаватьРасходыВДругуюОрганизацию) КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ЕСТЬNULL(Изменения_БУ.ОрганизацияПолучательРасходов, ПорядокУчетаОСБУ.ОрганизацияПолучательРасходов) КАК ОрганизацияПолучательРасходов,
	|
	|	ЕСТЬNULL(Изменения_БУ.ГрафикАмортизации, ЕСТЬNULL(ГрафикиАмортизацииОС.ГрафикАмортизации, ЗНАЧЕНИЕ(Справочник.ГодовыеГрафикиАмортизацииОС.ПустаяСсылка))) КАК ГрафикАмортизации,
	|	ЕСТЬNULL(Изменения_БУ.КоэффициентПериода, ЕСТЬNULL(ГрафикиАмортизацииОС.КоэффициентПериода, 0)) КАК КоэффициентПериода,
	|
	// РесурсНазначенный
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(Изменения_БУ.МетодНачисленияАмортизацииБУ, ПервоначальныеСведенияОС.МетодНачисленияАмортизацииБУ) = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)
	|			ТОГДА ЕСТЬNULL(Изменения_БУ.ОбъемНаработки, ЕСТЬNULL(ПараметрыАмортизацииОСБУ.ОбъемПродукцииРаботДляВычисленияАмортизации, 0))
	|		ИНАЧЕ ЕСТЬNULL(Изменения_БУ.СрокИспользования, ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СрокИспользованияДляВычисленияАмортизации, 0))
	|	КОНЕЦ КАК РесурсНазначенный,
	|
	// РесурсВыработанныйЗаТекущийПериод
	|	ВЫРАЗИТЬ(ВЫБОР 
	|		КОГДА ЕСТЬNULL(Изменения_БУ.МетодНачисленияАмортизацииБУ, ПервоначальныеСведенияОС.МетодНачисленияАмортизацииБУ) = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)
	|			ТОГДА ВЫБОР
	|					КОГДА Изменения_БУ.НачалоМесяца = &НачалоПредыдущегоМесяца
	|						ТОГДА ЕСТЬNULL(ВыработкаОС.ОбъемВыработкиЗаПрошлыйМесяц, 0)
	|					ИНАЧЕ ЕСТЬNULL(ВыработкаОС.ОбъемВыработки, 0)
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ * Изменения_БУ.СрокДействия / ДЕНЬ(Изменения_БУ.КонецМесяца) КАК ЧИСЛО(20,8)) КАК РесурсВыработанныйЗаТекущийПериод,
	|	  
	// РесурсВыработанныйЗаПрошлыйПериод
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(Изменения_БУ.МетодНачисленияАмортизацииБУ, ПервоначальныеСведенияОС.МетодНачисленияАмортизацииБУ) = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)
	|			ТОГДА ВЫБОР
	|					КОГДА Изменения_БУ.НачалоМесяца = &НачалоПредыдущегоМесяца
	|						ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВыработкаОС.ОбъемВыработкиНаНачалоПредыдущегоМесяца, 0) КАК ЧИСЛО(20,8))
	|					ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВыработкаОС.ОбъемВыработкиНаНачалоМесяца, 0) КАК ЧИСЛО(20,8))
	|				КОНЕЦ
	|
	|		КОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения), МЕСЯЦ) = Изменения_БУ.НачалоМесяца
	|			ТОГДА ВЫРАЗИТЬ(0 КАК ЧИСЛО(20,8))
	|	
	|		КОГДА ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения) ЕСТЬ NULL
	|			ТОГДА ВЫРАЗИТЬ(0 КАК ЧИСЛО(20,8))
	|
	|		ИНАЧЕ
	|			ВЫРАЗИТЬ((РАЗНОСТЬДАТ(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения), КОНЕЦПЕРИОДА(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения), МЕСЯЦ), ДЕНЬ) + 1) / ДЕНЬ(КОНЕЦПЕРИОДА(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения), МЕСЯЦ))
	|			+ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения), МЕСЯЦ, 1), МЕСЯЦ), Изменения_БУ.КонецМесяца, МЕСЯЦ) КАК ЧИСЛО(20,8))
	|	КОНЕЦ КАК РесурсВыработанныйЗаПрошлыйПериод,
	|
	// ОтработанныхМесяцевПолныхЛет
	|	ВЫБОР
	|		КОГДА ГОД(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения)) <> ГОД(Изменения_БУ.НачалоМесяца) ТОГДА
	|			13 - МЕСЯЦ(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения))
	|				+ 12 * (ГОД(Изменения_БУ.НачалоМесяца) - Год(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения)) - 1)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОтработанныхМесяцевПолныхЛет,
	|
	|	ЕСТЬNULL(Изменения_БУ.АмортизационнаяГруппа, СписокОС.АмортизационнаяГруппа) КАК АмортизационнаяГруппа,
	|
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьРегл, 0) КАК СтоимостьРегл,
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьПР, 0) КАК СтоимостьПР,
	|	ЕСТЬNULL(АмортизацияОС.АмортизацияРегл, 0) КАК АмортизацияРегл,
	|
	|	Изменения_БУ.СтоимостьРеглИзменение КАК СтоимостьРеглИзменение,
	|	Изменения_БУ.АмортизацияРеглИзменение КАК АмортизацияРеглИзменение,
	|
	|	ЕСТЬNULL(СтоимостьОСНаНачалоГода.СтоимостьРегл, 0) 
	|		+ ЕСТЬNULL(СтоимостьОСНаНачалоГода.СтоимостьЦФ, 0)
	|		- ЕСТЬNULL(АмортизацияОСНаНачалоГода.АмортизацияРегл, 0) 
	|		- ЕСТЬNULL(АмортизацияОСНаНачалоГода.АмортизацияЦФ, 0) КАК СтоимостьНаНачалоГода,
	|
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0)
	|		+ ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0) КАК СтоимостьНУНачальныйОстаток,
	|
	// ОстаточнаяСтоимостьРегл
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьРегл, 0) 
	|				+ ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0)
	|				- ЕСТЬNULL(АмортизацияОС.АмортизацияРегл, 0)
	|				- ЕСТЬNULL(АмортизацияОС.АмортизацияЦФ, 0) КАК ОстаточнаяСтоимостьРегл,
	|
	// ОстаточнаяСтоимостьЦФ
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0)
	|				- ЕСТЬNULL(АмортизацияОС.АмортизацияЦФ, 0) КАК ОстаточнаяСтоимостьЦФ,
	|
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьПР, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияПР, 0) КАК ОстаточнаяСтоимостьПР,
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияПРЦФ, 0) КАК ОстаточнаяСтоимостьПРЦФ,
	|	
	|	ЕСТЬNULL(ОбесценениеНаНачалоМесяца.ОстатокОбесцененияРегл, 0) КАК ОстатокОбесцененияРегл,
	|
	|	ЕСТЬNULL(Изменения_БУ.Местонахождение, МестонахождениеОС.Местонахождение) КАК Подразделение,
	|
	|	ЕСТЬNULL(ВыработкаОС.ОбъемВыработкиНаНачалоМесяца, 0) КАК ОбъемВыработкиНаНачалоМесяца,
	|
	|	ЕСТЬNULL(Изменения_БУ.МетодНачисленияАмортизацииБУ, ПервоначальныеСведенияОС.МетодНачисленияАмортизацииБУ) КАК МетодНачисленияАмортизацииБУ,
	|	ЕСТЬNULL(Изменения_БУ.КоэффициентАмортизацииБУ, ПараметрыАмортизацииОСБУ.КоэффициентАмортизацииБУ) КАК КоэффициентАмортизацииБУ,
	|	ЕСТЬNULL(Изменения_БУ.КоэффициентУскоренияБУ, ЕСТЬNULL(ПараметрыАмортизацииОСБУ.КоэффициентУскорения, 0)) КАК КоэффициентУскоренияБУ,
	|	ЕСТЬNULL(Изменения_БУ.ЛиквидационнаяСтоимость, ЕСТЬNULL(ПараметрыАмортизацииОСБУ.ЛиквидационнаяСтоимость, 0)) КАК ЛиквидационнаяСтоимость,
	|	ЕСТЬNULL(Изменения_БУ.ПорядокУчетаБУ, ПервоначальныеСведенияОС.ПорядокУчетаБУ) КАК ПорядокУчетаБУ,
	|	ЕСТЬNULL(Изменения_БУ.СтоимостьДляВычисленияАмортизации, ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизации, 0)) КАК СтоимостьДляВычисленияПР,
	|
	// ПРДляВычисленияАмортизации
	|	ВЫБОР 
	|		КОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения), МЕСЯЦ) = Изменения_БУ.НачалоМесяца
	|				И ТИПЗНАЧЕНИЯ(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения)) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И ТИПЗНАЧЕНИЯ(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения)) <> ТИП(Документ.МодернизацияОС2_4)
	|				И ЕСТЬNULL(ПредварительнаяСтоимостьОС.ДоляЦФ, 0) <> 0
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьРегл, 0) * ЕСТЬNULL(ПредварительнаяСтоимостьОС.ДоляЦФ, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(Изменения_БУ.ПРДляВычисленияАмортизации, ЕСТЬNULL(ПараметрыАмортизацииОСБУ.ПРДляВычисленияАмортизации, 0))
	| 
	|	КОНЕЦ КАК ПРДляВычисленияАмортизации,
	|
	// КоэффициентЦФБУ
	|	ВЫБОР 
	|		КОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения), МЕСЯЦ) = Изменения_БУ.НачалоМесяца
	|				И ТИПЗНАЧЕНИЯ(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения)) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И ТИПЗНАЧЕНИЯ(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения)) <> ТИП(Документ.МодернизацияОС2_4)
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьОС.ДоляЦФ, 0)
	|
	|		КОГДА ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0) = 0
	|				ИЛИ (ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияЦФ, 0)) <= 0
	|
	|			ТОГДА 0
	|
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьРегл, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияРегл, 0)) <= 0
	|
	|			ТОГДА 1
	|
	|		КОГДА ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизацииЦФ, 0) <> 0
	|				И ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизации, 0) <> 0
	|
	|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизацииЦФ, 0) 
	|					/ ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизации, 0)
	|
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьРегл, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0)) <> 0
	|
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0) 
	|							/ (ЕСТЬNULL(СтоимостьОС.СтоимостьРегл, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0)) КАК ЧИСЛО (23, 10))
	|
	|		ИНАЧЕ 0
	|
	|	КОНЕЦ КАК КоэффициентЦФБУ,
	|
	// КоэффициентЦФНУ
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0) = 0
	|				ИЛИ (ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияНУЦФ, 0)) <= 0
	|
	|			ТОГДА 0
	|
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияНУ, 0)) <= 0
	|
	|			ТОГДА 1
	|
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0)) <> 0
	|
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0) 
	|							/ (ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0)) КАК ЧИСЛО (23, 10))
	|		ИНАЧЕ 0
	|
	|	КОНЕЦ КАК КоэффициентЦФНУ,
	|
	// КоэффициентЦФПР
	|	ВЫБОР 
	|		КОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения), МЕСЯЦ) = Изменения_БУ.НачалоМесяца
	|				И ТИПЗНАЧЕНИЯ(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения)) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И ТИПЗНАЧЕНИЯ(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения)) <> ТИП(Документ.МодернизацияОС2_4)
	|				И ЕСТЬNULL(ПредварительнаяСтоимостьОС.ДоляЦФ, 0) <> 0
	|
	|			ТОГДА 1
	|
	|		КОГДА ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0) = 0
	|				ИЛИ (ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияПРЦФ, 0)) <= 0
	|
	|			ТОГДА 0
	|
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьПР, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияПР, 0)) <= 0
	|
	|			ТОГДА 1
	|
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьПР, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0)) <> 0
	|
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0) 
	|							/ (ЕСТЬNULL(СтоимостьОС.СтоимостьПР, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0)) КАК ЧИСЛО (23, 10))
	|
	|		ИНАЧЕ 0
	|
	|	КОНЕЦ КАК КоэффициентЦФПР
	|
	|ПОМЕСТИТЬ СписокОССИзмененнымиПараметрами_БУ
	|
	|ИЗ
	|	Изменения_БУ КАК Изменения_БУ
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокОбъектовУчета_БУ КАК СписокОС
	|		ПО (СписокОС.Организация = Изменения_БУ.Организация)
	|			И (СписокОС.ОсновноеСредство = Изменения_БУ.ОсновноеСредство)
	|			И (СписокОС.НачалоМесяца = Изменения_БУ.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодИзменения_БУ КАК ПериодИзменения_БУ
	|		ПО (ПериодИзменения_БУ.Организация = СписокОС.Организация)
	|			И (ПериодИзменения_БУ.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПериодИзменения_БУ.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодИзменения_БУ КАК ПериодИзмененияВТекущемМесяце
	|		ПО (ПериодИзмененияВТекущемМесяце.Организация = СписокОС.Организация)
	|			И (ПериодИзмененияВТекущемМесяце.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПериодИзмененияВТекущемМесяце.НачалоМесяца = &НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОС КАК ПорядокУчетаОС
	|		ПО (ПорядокУчетаОС.ОсновноеСредство = Изменения_БУ.ОсновноеСредство)
	|			И (ПорядокУчетаОС.НачалоМесяца = Изменения_БУ.НачалоМесяца)
	|			И (ПорядокУчетаОС.ПериодПараметров = Изменения_БУ.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьОС_НаНачалоМесяца КАК СтоимостьОС
	|		ПО (СтоимостьОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (СтоимостьОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьОС_НаНачалоГода КАК СтоимостьОСНаНачалоГода
	|		ПО (СтоимостьОСНаНачалоГода.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредварительнаяСтоимостьОС КАК ПредварительнаяСтоимостьОС
	|		ПО (ПредварительнаяСтоимостьОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПредварительнаяСтоимостьОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияОС_НаНачалоМесяца КАК АмортизацияОС
	|		ПО (АмортизацияОС.Организация = СписокОС.Организация)
	|			И (АмортизацияОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (АмортизацияОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияОС_НаНачалоГода КАК АмортизацияОСНаНачалоГода
	|		ПО (АмортизацияОСНаНачалоГода.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбесценениеВНА КАК ОбесценениеНаНачалоМесяца
	|		ПО (ОбесценениеНаНачалоМесяца.Организация = СписокОС.Организация)
	|			И (ОбесценениеНаНачалоМесяца.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ОбесценениеНаНачалоМесяца.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОС КАК МестонахождениеОС
	|		ПО (МестонахождениеОС.ОсновноеСредство = Изменения_БУ.ОсновноеСредство)
	|			И (МестонахождениеОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|			И (МестонахождениеОС.ПериодПараметров = СписокОС.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияОС КАК ПервоначальныеСведенияОС
	|		ПО (ПервоначальныеСведенияОС.Организация = Изменения_БУ.Организация)
	|			И (ПервоначальныеСведенияОС.ОсновноеСредство = Изменения_БУ.ОсновноеСредство)
	|			И (ПервоначальныеСведенияОС.НачалоМесяца = Изменения_БУ.НачалоМесяца)
	|			И (ПервоначальныеСведенияОС.ПериодПараметров = Изменения_БУ.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииОСБУ КАК ПараметрыАмортизацииОСБУ
	|		ПО (ПараметрыАмортизацииОСБУ.Организация = Изменения_БУ.Организация)
	|			И (ПараметрыАмортизацииОСБУ.ОсновноеСредство = Изменения_БУ.ОсновноеСредство)
	|			И (ПараметрыАмортизацииОСБУ.НачалоМесяца = Изменения_БУ.НачалоМесяца)
	|			И (ПараметрыАмортизацииОСБУ.ПериодПараметров = Изменения_БУ.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОСБУ КАК ПорядокУчетаОСБУ
	|		ПО (ПорядокУчетаОСБУ.Организация = Изменения_БУ.Организация)
	|			И (ПорядокУчетаОСБУ.ОсновноеСредство = Изменения_БУ.ОсновноеСредство)
	|			И (ПорядокУчетаОСБУ.НачалоМесяца = Изменения_БУ.НачалоМесяца)
	|			И (ПорядокУчетаОСБУ.ПериодПараметров = Изменения_БУ.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГрафикиАмортизацииОС КАК ГрафикиАмортизацииОС
	|		ПО (ГрафикиАмортизацииОС.Организация = СписокОС.Организация)
	|			И (ГрафикиАмортизацииОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыработкаОС КАК ВыработкаОС
	|		ПО (ВыработкаОС.ОсновноеСредство = ПорядокУчетаОС.ОсновноеСредство)
	|			И (ВыработкаОС.ПоказательНаработки = ПорядокУчетаОС.ПоказательНаработки)
	|			И (ВыработкаОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЭтоДоначисление, 
	|	ОсновноеСредство";
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"&ЧислоПрошедшихЛет", 
		ВнеоборотныеАктивыСлужебный.ТекстПоляФактическийСрокИспользования("ДОБАВИТЬКДАТЕ(ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения, МЕСЯЦ, 1)"));
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"&НормаАмортизации", 
		ВнеоборотныеАктивыЛокализация.ТекстПоляНормаАмортизации("СписокОС.АмортизационнаяГруппа"));
	
	СписокЗапросов.Добавить(ТекстЗапроса);
		
	#КонецОбласти
	
	#Область СписокОССПараметрами_НУ
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СписокОС.Организация КАК Организация,
	|
	|	ПорядокУчетаОС.ГруппаФинансовогоУчета,
	|	ПорядокУчетаОС.НаправлениеДеятельности,
	|	МестонахождениеОС.Местонахождение КАК Подразделение,
	|	МестонахождениеОС.Арендатор КАК Арендатор,
	|
	|	ПорядокУчетаОС.ПоказательНаработки,
	|	ПорядокУчетаОС.ОбъемНаработки,
	|
	|	СписокОС.НачислятьАмортизациюНУ КАК НачислятьАмортизациюНУ,
	|
	|	ПорядокУчетаОСБУ.СтатьяРасходовНУ КАК СтатьяРасходовНУ,
	|	ПорядокУчетаОСБУ.АналитикаРасходовНУ КАК АналитикаРасходовНУ,
	|	ПорядокУчетаОСБУ.СтатьяРасходовАмортизационнойПремии КАК СтатьяРасходовАмортизационнойПремии,
	|	ПорядокУчетаОСБУ.АналитикаРасходовАмортизационнойПремии КАК АналитикаРасходовАмортизационнойПремии,
	|
	|	ВЫБОР
	|		КОГДА СписокОС.ОсновноеСредство.ТипОС = ЗНАЧЕНИЕ(Перечисление.ТипыОС.ГрупповоеОС)
	|				И ПорядокУчетаОСБУ.СпособОтраженияРасходовНУ В (&ПустыеСпособыОтраженияРасходов)
	|			ТОГДА СписокОС.ОсновноеСредство
	|		ИНАЧЕ ПорядокУчетаОСБУ.СпособОтраженияРасходовНУ
	|	КОНЕЦ КАК СпособОтраженияРасходов,
	|
	|	ПорядокУчетаОСБУ.СпособОтраженияРасходовАмортизационнойПремии КАК СпособОтраженияРасходовАмортизационнойПремии,
	|	ПорядокУчетаОСБУ.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ПорядокУчетаОСБУ.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|
	|	СписокОС.АмортизационнаяГруппа КАК АмортизационнаяГруппа,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СпециальныйКоэффициент, 1) <> 0
	|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СпециальныйКоэффициент, 1)
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК СпециальныйКоэффициентНУ,
	|
	|	&НормаАмортизации КАК НормаАмортизации,
	|
	// ФактическийСрокПриПереходеКЛинейномуМетоду
	|	ВЫБОР
	|		КОГДА ГОД(ЕСТЬNULL(ДатыПереходаКЛинейномуМетоду.Дата, ДАТАВРЕМЯ(2009,1,1))) = 2009
	|			ТОГДА ЕСТЬNULL(ПервоначальныеСведенияОС.ФактическийСрокИспользованияДо2009, 0)
	|		КОГДА ЕСТЬNULL(ДатыПереходаКЛинейномуМетоду.Дата, ДАТАВРЕМЯ(2009,1,1)) <= ЕСТЬNULL(ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ, ДАТАВРЕМЯ(1,1,1))
	|			ТОГДА 0
	|		ИНАЧЕ (ГОД(ЕСТЬNULL(ДатыПереходаКЛинейномуМетоду.Дата, ДАТАВРЕМЯ(2009,1,1))) 
	|					- ГОД(ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ)) * 12 
	|				+ (МЕСЯЦ(ЕСТЬNULL(ДатыПереходаКЛинейномуМетоду.Дата, ДАТАВРЕМЯ(2009,1,1))) - МЕСЯЦ(ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ)) - 1
	|	КОНЕЦ КАК ФактическийСрокПриПереходеКЛинейномуМетоду,
	|
	// АмортизацияПриПереходеКЛинейномуМетоду
	|	ВЫБОР
	|		КОГДА ГОД(ЕСТЬNULL(ДатыПереходаКЛинейномуМетоду.Дата, ДАТАВРЕМЯ(2009,1,1))) = 2009
	|			ТОГДА ЕСТЬNULL(ПервоначальныеСведенияОС.АмортизацияДо2009, 0)
	|		КОГДА ЕСТЬNULL(ДатыПереходаКЛинейномуМетоду.Дата, ДАТАВРЕМЯ(2009,1,1)) <= ЕСТЬNULL(ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ, ДАТАВРЕМЯ(1,1,1))
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(АмортизацияОСПриПереходеКЛинейномуМетоду.АмортизацияНУ, 0)
	|	КОНЕЦ КАК АмортизацияПриПереходеКЛинейномуМетоду,
	|
	|	ВЫБОР
	|		КОГДА ДатыПоследнегоИзменения.ПринятиеКУчетуПрошлойДатойБУ
	|				И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, МЕСЯЦ) = СписокОС.НачалоМесяца
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьРегл, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0)
	| 
	|	КОНЕЦ КАК СтоимостьНУ,
	|
	|	ЕСТЬNULL(СтоимостьОС.АмортизационнаяПремия, 0) КАК АмортизационнаяПремия,
	|
	|	ВЫБОР
	|		КОГДА ДатыПоследнегоИзменения.ПринятиеКУчетуПрошлойДатойБУ
	|				И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, МЕСЯЦ) = СписокОС.НачалоМесяца
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьРегл, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0)
	|				+ ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0)
	| 
	|	КОНЕЦ КАК СтоимостьНУНачальныйОстаток,
	|
	|	ВЫБОР
	|		КОГДА ДатыПоследнегоИзменения.ПринятиеКУчетуПрошлойДатойБУ
	|				И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, МЕСЯЦ) = СписокОС.НачалоМесяца
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьРегл, 0) - ЕСТЬNULL(ПредварительнаяАмортизацияОС.АмортизацияРегл, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0) 
	|				- ЕСТЬNULL(АмортизацияОС.АмортизацияНУ, 0)
	| 
	|	КОНЕЦ КАК ОстаточнаяСтоимостьНУ,
	|	
	|	ЕСТЬNULL(АмортизацияОС.АмортизацияНУ, 0)
	|		+ ЕСТЬNULL(АмортизацияОС.АмортизацияНУЦФ, 0) КАК АмортизацияНУНачальныйОстаток,
	|
	|	ВЫБОР
	|		КОГДА СписокОС.АмортизационнаяГруппа В (
	|						ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ВосьмаяГруппа), 
	|						ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДевятаяГруппа), 
	|						ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДесятаяГруппа))
	|					И СписокОС.ОсновноеСредство.ГруппаОС В (ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Здания), ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Сооружения))
	|				ИЛИ СписокОС.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ОтдельнаяГруппа)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Линейный)
	|		ИНАЧЕ ЕСТЬNULL(РегУчетнаяПолитика.МетодНачисленияАмортизацииНУ, ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Линейный))
	|	КОНЕЦ КАК МетодНачисленияАмортизацииНУ,
	|
	|	ПервоначальныеСведенияОС.ПорядокУчетаБУ,
	|	ПараметрыАмортизацииОСБУ.СрокПолезногоИспользованияНУ,
	|
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0) = 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизацииЦФ, 0) <> 0
	|				И ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизации, 0) <> 0
	|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизацииЦФ, 0) / ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизации, 0)
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьРегл, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0)) <> 0
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0) / (ЕСТЬNULL(СтоимостьОС.СтоимостьРегл, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0)) КАК ЧИСЛО (23, 10))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентЦФБУ,
	|
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0)) <> 0
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0) / (ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0)) КАК ЧИСЛО (23, 10))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентЦФНУ,
	|
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьПР, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0)) <> 0
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0) / (ЕСТЬNULL(СтоимостьОС.СтоимостьПР, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0)) КАК ЧИСЛО (23, 10))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентЦФПР
	|
	|ПОМЕСТИТЬ СписокОССПараметрами_НУ
	|
	|ИЗ
	|	СписокОбъектовУчета_БУ КАК СписокОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОС КАК ПорядокУчетаОС
	|		ПО (ПорядокУчетаОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПорядокУчетаОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|			И (ПорядокУчетаОС.ПериодПараметров = СписокОС.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьОС_НаНачалоМесяца КАК СтоимостьОС
	|		ПО (СтоимостьОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (СтоимостьОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияОС_НаНачалоМесяца КАК АмортизацияОС
	|		ПО (АмортизацияОС.Организация = СписокОС.Организация)
	|			И (АмортизацияОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (АмортизацияОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияОСПриПереходеКЛинейномуМетоду КАК АмортизацияОСПриПереходеКЛинейномуМетоду
	|		ПО (АмортизацияОСПриПереходеКЛинейномуМетоду.Организация = СписокОС.Организация)
	|			И (АмортизацияОСПриПереходеКЛинейномуМетоду.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОС КАК МестонахождениеОС
	|		ПО (МестонахождениеОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (МестонахождениеОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|			И (МестонахождениеОС.ПериодПараметров = СписокОС.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияОС КАК ПервоначальныеСведенияОС
	|		ПО (ПервоначальныеСведенияОС.Организация = СписокОС.Организация)
	|			И (ПервоначальныеСведенияОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПервоначальныеСведенияОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|			И (ПервоначальныеСведенияОС.ПериодПараметров = СписокОС.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииОСБУ КАК ПараметрыАмортизацииОСБУ
	|		ПО (ПараметрыАмортизацииОСБУ.Организация = СписокОС.Организация)
	|			И (ПараметрыАмортизацииОСБУ.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПараметрыАмортизацииОСБУ.НачалоМесяца = СписокОС.НачалоМесяца)
	|			И (ПараметрыАмортизацииОСБУ.ПериодПараметров = СписокОС.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОСБУ КАК ПорядокУчетаОСБУ
	|		ПО (ПорядокУчетаОСБУ.Организация = СписокОС.Организация)
	|			И (ПорядокУчетаОСБУ.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПорядокУчетаОСБУ.НачалоМесяца = СписокОС.НачалоМесяца)
	|			И (ПорядокУчетаОСБУ.ПериодПараметров = СписокОС.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыПереходаКЛинейномуМетоду КАК ДатыПереходаКЛинейномуМетоду
	|		ПО (ДатыПереходаКЛинейномуМетоду.Организация = СписокОС.Организация)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредварительнаяСтоимостьОС КАК ПредварительнаяСтоимостьОС
	|		ПО (ПредварительнаяСтоимостьОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПредварительнаяСтоимостьОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредварительнаяАмортизацияОС КАК ПредварительнаяАмортизацияОС
	|		ПО (ПредварительнаяАмортизацияОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПредварительнаяАмортизацияОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыПоследнегоИзмененияБУ КАК ДатыПоследнегоИзменения
	|		ПО (ДатыПоследнегоИзменения.Организация = СписокОС.Организация)
	|			И (ДатыПоследнегоИзменения.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ДатыПоследнегоИзменения.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаНалогаНаПрибыль.СрезПоследних(&КонецМесяца) КАК РегУчетнаяПолитика
	|		ПО РегУчетнаяПолитика.Организация = СписокОС.Организация
	|
	|ГДЕ
	|	СписокОС.НачислятьАмортизациюНУ
	|	И НЕ СписокОС.ЭтоДоначисление
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация";
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"&НормаАмортизации", 
		ВнеоборотныеАктивыЛокализация.ТекстПоляНормаАмортизации("СписокОС.АмортизационнаяГруппа"));
		
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область СпособыОтраженияРасходовБУ
	
	ТекстЗапроса =
	"ВЫБРАТЬ 
	|	СписокОС.СпособОтраженияРасходов КАК Ссылка
	|
	|ПОМЕСТИТЬ втСпособыОтраженияРасходовБУ
	|
	|ИЗ 
	|	СписокОССПараметрами_БУ КАК СписокОС
	|
	|ГДЕ 
	|	НЕ СписокОС.СпособОтраженияРасходов В (&ПустыеСпособыОтраженияРасходов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	СписокОС.СпособОтраженияРасходов
	|
	|ИЗ 
	|	СписокОССИзмененнымиПараметрами_БУ КАК СписокОС
	|
	|ГДЕ 
	|	НЕ СписокОС.СпособОтраженияРасходов В (&ПустыеСпособыОтраженияРасходов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	СписокОС.СпособОтраженияРасходов
	|
	|ИЗ 
	|	СписокОССПараметрами_НУ КАК СписокОС
	|
	|ГДЕ 
	|	НЕ СписокОС.СпособОтраженияРасходов В (&ПустыеСпособыОтраженияРасходов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	СписокОС.СпособОтраженияРасходовАмортизационнойПремии
	|
	|ИЗ 
	|	СписокОССПараметрами_НУ КАК СписокОС
	|
	|ГДЕ 
	|	НЕ СписокОС.СпособОтраженияРасходовАмортизационнойПремии В (&ПустыеСпособыОтраженияРасходов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаАмортизация.Ссылка                               КАК СпособОтраженияРасходов,
	|	ТаблицаАмортизация.Подразделение                        КАК Подразделение,
	|	ТаблицаАмортизация.НаправлениеДеятельности              КАК НаправлениеДеятельности,
	|	ТаблицаАмортизация.СтатьяРасходов                       КАК СтатьяРасходов,
	|	ТаблицаАмортизация.АналитикаРасходов                    КАК АналитикаРасходов,
	|	ТаблицаАмортизация.ПередаватьРасходыВДругуюОрганизацию  КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ТаблицаАмортизация.ОрганизацияПолучательРасходов        КАК ОрганизацияПолучательРасходов,
	|	ТаблицаАмортизация.Коэффициент                          КАК База,
	|	ТаблицаАмортизация.СуммаКоэффициентовПредыдущихСтрок    КАК БазаНакопленная,
	|	ТаблицаАмортизация.Ссылка.СуммаКоэффициентовАмортизации КАК СуммаБазы,
	|	ЛОЖЬ                                                    КАК ЭтоАмортизационнаяПремия
	|
	|ПОМЕСТИТЬ СпособыОтраженияРасходовБУ
	|
	|ИЗ
	|	Документ.ИзменениеПараметровОС2_4.Амортизация КАК ТаблицаАмортизация
	|
	|ГДЕ
	|	ТаблицаАмортизация.Ссылка В (ВЫБРАТЬ СпособыОтраженияРасходов.Ссылка ИЗ втСпособыОтраженияРасходовБУ КАК СпособыОтраженияРасходов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаАмортизация.Ссылка                               КАК СпособОтраженияРасходов,
	|	ТаблицаАмортизация.Подразделение                        КАК Подразделение,
	|	ТаблицаАмортизация.НаправлениеДеятельности              КАК НаправлениеДеятельности,
	|	ТаблицаАмортизация.СтатьяРасходов                       КАК СтатьяРасходов,
	|	ТаблицаАмортизация.АналитикаРасходов                    КАК АналитикаРасходов,
	|	ТаблицаАмортизация.ПередаватьРасходыВДругуюОрганизацию  КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ТаблицаАмортизация.ОрганизацияПолучательРасходов        КАК ОрганизацияПолучательРасходов,
	|	ТаблицаАмортизация.Коэффициент                          КАК База,
	|	ТаблицаАмортизация.СуммаКоэффициентовПредыдущихСтрок    КАК БазаНакопленная,
	|	ТаблицаАмортизация.Ссылка.СуммаКоэффициентовАмортизационнойПремии КАК СуммаБазы,
	|	ИСТИНА                                                  КАК ЭтоАмортизационнаяПремия
	|
	|ИЗ
	|	Документ.ИзменениеПараметровОС2_4.АмортизационнаяПремия КАК ТаблицаАмортизация
	|
	|ГДЕ
	|	ТаблицаАмортизация.Ссылка В (ВЫБРАТЬ СпособыОтраженияРасходов.Ссылка ИЗ втСпособыОтраженияРасходовБУ КАК СпособыОтраженияРасходов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТМЦВЭксплуатации_Распределение.ОсновноеСредство         КАК СпособОтраженияРасходов,
	|	ТМЦВЭксплуатации_Распределение.Подразделение            КАК Подразделение,
	|	ТМЦВЭксплуатации_Распределение.НаправлениеДеятельности  КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО                                            КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО                                            КАК АналитикаРасходов,
	|	ИСТИНА                                                  КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ТМЦВЭксплуатации_Распределение.Организация              КАК ОрганизацияПолучательРасходов,
	|	ТМЦВЭксплуатации_Распределение.База                     КАК База,
	|	ТМЦВЭксплуатации_Распределение.БазаНакопленная          КАК БазаНакопленная,
	|	ТМЦВЭксплуатации_Распределение.СуммаБазы                КАК СуммаБазы,
	|	ЛОЖЬ                                                    КАК ЭтоАмортизационнаяПремия
	|
	|ИЗ
	|	ТМЦВЭксплуатации_Распределение КАК ТМЦВЭксплуатации_Распределение
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СпособОтраженияРасходов,
	|	ЭтоАмортизационнаяПремия";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти		
		
	//-- Локализация
	
КонецПроцедуры

// 
// Возвращаемое значение:
//  Строка - Текст запроса
Функция ТекстЗапросаСписокОбъектовУчетаДоначислениеВсе() Экспорт
	
	ТекстЗапроса = Неопределено;
	
	//++ Локализация
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СписокОбъектовУчета.Организация      КАК Организация,
	|	СписокОбъектовУчета.ОсновноеСредство КАК ОсновноеСредство,
	|	СписокОбъектовУчета.Период           КАК Период
	|
	|ПОМЕСТИТЬ СписокОбъектовУчета_Доначисление_Все
	|ИЗ
	|	СписокОбъектовУчета_Доначисление_УУ КАК СписокОбъектовУчета
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СписокОбъектовУчета.Организация      КАК Организация,
	|	СписокОбъектовУчета.ОсновноеСредство КАК ОсновноеСредство,
	|	СписокОбъектовУчета.Период           КАК Период
	|ИЗ
	|	СписокОбъектовУчета_Доначисление_БУ КАК СписокОбъектовУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация";
	
	//-- Локализация
	
	Возврат ТекстЗапроса;

КонецФункции

// 
// Параметры:
//  СписокЗапросов - Массив из Строка - 
//  ПараметрыРасчета - см. ВнеоборотныеАктивы.НовыеПараметрыРасчетаАмортизации
Процедура ДополнитьТекстЗапросаПроверкаПараметровРасчета(СписокЗапросов, ПараметрыРасчета) Экспорт

	//++ Локализация
	
	#Область ПроверкаПараметровРасчета_БУ
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СписокОС.Организация КАК Организация,
	|	СписокОС.ОбъектУчета КАК ОбъектУчета,
	|	СписокОС.НеУказанСрокИспользованияБУ КАК НеУказанСрокИспользованияБУ,
	|	СписокОС.НеУказанОбъемНаработки КАК НеУказанОбъемНаработки,
	|	СписокОС.ОбъемНаработкиВыработан КАК ОбъемНаработкиВыработан,
	|	СписокОС.НеУказанКоэффициентАмортизации КАК НеУказанКоэффициентАмортизации,
	|	СписокОС.НеУказанКоэффициентУскорения КАК НеУказанКоэффициентУскорения,
	|	СписокОС.МетодНачисленияНеПрименяется КАК МетодНачисленияНеПрименяется
	|
	|ПОМЕСТИТЬ ПроверкаПараметровРасчета_БУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокОС.Организация КАК Организация,
	|		СписокОС.ОсновноеСредство КАК ОбъектУчета,
	|
			// НеУказанСрокИспользованияБУ
	|		СписокОС.НачислятьАмортизациюБУ
	|			И СписокОС.МетодНачисленияАмортизацииБУ В (
	|					ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.Линейный),
	|					ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка),
	|					ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПоСуммеЧиселЛетИспользования))
	|			И СписокОС.СтоимостьДляВычисленияАмортизации <> 0 
	|			И СписокОС.СрокИспользованияДляВычисленияАмортизации = 0
	|			И (НЕ СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|				ИЛИ СписокОС.РесурсВыработанныйЗаТекущийПериод > 0) КАК НеУказанСрокИспользованияБУ,
	|
			// НеУказанОбъемНаработки
	|		СписокОС.НачислятьАмортизациюБУ
	|			И СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)
	|			И СписокОС.ОбъемНаработки = 0 КАК НеУказанОбъемНаработки,
	|
			// ОбъемНаработкиВыработан
	|		СписокОС.НачислятьАмортизациюБУ
	|			И СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)
	|			И (СписокОС.ОбъемНаработки - СписокОС.ОбъемВыработкиНаНачалоМесяца) <= 0 
	|			И СписокОС.ОбъемНаработки <> 0 
	|			И (СписокОС.ПорядокНачисленияАмортизацииБУ <> ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)
	|				ИЛИ СписокОС.РесурсВыработанныйЗаТекущийПериод > 0) КАК ОбъемНаработкиВыработан,
	|
			// НеУказанКоэффициентАмортизации
	|		СписокОС.НачислятьАмортизациюБУ
	|			И СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПоЕНАОФ)
	|			И СписокОС.КоэффициентАмортизацииБУ = 0 КАК НеУказанКоэффициентАмортизации,
	|
			// НеУказанКоэффициентУскорения
	|		СписокОС.НачислятьАмортизациюБУ
	|			И СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка)
	|			И СписокОС.КоэффициентУскоренияБУ = 0 КАК НеУказанКоэффициентУскорения,
	|
			// МетодНачисленияНеПрименяется
	|		СписокОС.НачислятьАмортизациюБУ
	|			И СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|			И СписокОС.МетодНачисленияАмортизацииБУ В (
	|				ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПоСуммеЧиселЛетИспользования),
	|				ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПоЕНАОФ),
	|				ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПоЕНАОФНа1000кмПробега)) КАК МетодНачисленияНеПрименяется
	|
	|	ИЗ
	|		СписокОССПараметрами_БУ КАК СписокОС
	|
	|	) СписокОС
	|
	|ГДЕ
	|	(СписокОС.НеУказанСрокИспользованияБУ
	|		ИЛИ СписокОС.НеУказанОбъемНаработки
	|		ИЛИ СписокОС.ОбъемНаработкиВыработан
	|		ИЛИ СписокОС.НеУказанКоэффициентАмортизации
	|		ИЛИ СписокОС.НеУказанКоэффициентУскорения
	|		ИЛИ СписокОС.МетодНачисленияНеПрименяется)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область ПроверкаПараметровРасчетаИзменения_БУ
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СписокОС.Организация КАК Организация,
	|	СписокОС.ОбъектУчета КАК ОбъектУчета,
	|	СписокОС.НеУказанСрокИспользованияБУ КАК НеУказанСрокИспользованияБУ,
	|	СписокОС.НеУказанОбъемНаработки КАК НеУказанОбъемНаработки,
	|	СписокОС.НеУказанРесурсВыработанный КАК НеУказанРесурсВыработанный,
	|	СписокОС.МетодНачисленияНеПрименяется КАК МетодНачисленияНеПрименяется
	|
	|ПОМЕСТИТЬ ПроверкаПараметровРасчетаИзменения_БУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокОС.Организация КАК Организация,
	|		СписокОС.ОсновноеСредство КАК ОбъектУчета,
	|
			// НеУказанСрокИспользованияБУ
	|		СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.Линейный)
	|			И ЕСТЬNULL(СписокОС.РесурсНазначенный, 0) = 0
	|			И СписокОС.РесурсВыработанныйЗаТекущийПериод > 0 КАК НеУказанСрокИспользованияБУ,
	|
			// НеУказанОбъемНаработки
	|		СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)
	|			И ЕСТЬNULL(СписокОС.РесурсНазначенный, 0) = 0 КАК НеУказанОбъемНаработки,
	|
			// НеУказанРесурсВыработанный
	|		СписокОС.РесурсВыработанныйЗаТекущийПериод ЕСТЬ NULL
	|			ИЛИ СписокОС.РесурсВыработанныйЗаПрошлыйПериод ЕСТЬ NULL КАК НеУказанРесурсВыработанный,
	|
			// МетодНачисленияНеПрименяется
	|		СписокОС.НачислятьАмортизациюБУ
	|			И СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|			И СписокОС.МетодНачисленияАмортизацииБУ В (
	|				ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПоСуммеЧиселЛетИспользования),
	|				ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПоЕНАОФ),
	|				ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПоЕНАОФНа1000кмПробега)) КАК МетодНачисленияНеПрименяется
	|	ИЗ
	|		СписокОССИзмененнымиПараметрами_БУ КАК СписокОС
	|	ГДЕ
	|		СписокОС.НачислятьАмортизациюБУ
	|		И (СписокОС.ОстаточнаяСтоимостьРегл + СписокОС.СтоимостьРеглИзменение) > 0
	|
	|	) КАК СписокОС
	|
	|ГДЕ
	|	(СписокОС.НеУказанСрокИспользованияБУ
	|		ИЛИ СписокОС.НеУказанОбъемНаработки
	|		ИЛИ СписокОС.НеУказанРесурсВыработанный
	|		ИЛИ СписокОС.МетодНачисленияНеПрименяется)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область ПроверкаПараметровРасчета_НУ
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СписокОС.Организация КАК Организация,
	|	СписокОС.ОбъектУчета КАК ОбъектУчета,
	|	СписокОС.НеУказанСрокИспользованияНУ КАК НеУказанСрокИспользованияНУ,
	|	СписокОС.НеУказанаАмортизационнаяГруппа КАК НеУказанаАмортизационнаяГруппа,
	|	СписокОС.НеУказанаСтатьяРасходовАмортизационнойПремии КАК НеУказанаСтатьяРасходовАмортизационнойПремии
	|
	|ПОМЕСТИТЬ ПроверкаПараметровРасчета_НУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокОС.Организация КАК Организация,
	|		СписокОС.ОсновноеСредство КАК ОбъектУчета,
	|
			// НеУказанСрокИспользованияНУ
	|		СписокОС.НачислятьАмортизациюНУ
	|			И СписокОС.МетодНачисленияАмортизацииНУ = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Линейный)
	|			И СписокОС.СрокПолезногоИспользованияНУ = 0 КАК НеУказанСрокИспользованияНУ,
	|
			// НеУказанаАмортизационнаяГруппа
	|		СписокОС.НачислятьАмортизациюНУ
	|			И СписокОС.МетодНачисленияАмортизацииНУ = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Нелинейный)
	|			И СписокОС.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ПустаяСсылка) КАК НеУказанаАмортизационнаяГруппа,
	|
			// НеУказанаСтатьяРасходовАмортизационнойПремии
	|		СписокОС.СтатьяРасходовАмортизационнойПремии = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			И СписокОС.АмортизационнаяПремия <> 0
	|			И СписокОС.СпособОтраженияРасходовАмортизационнойПремии В (&ПустыеСпособыОтраженияРасходов) КАК НеУказанаСтатьяРасходовАмортизационнойПремии
	|
	|	ИЗ
	|		СписокОССПараметрами_НУ КАК СписокОС
	|	ГДЕ
	|		СписокОС.НачислятьАмортизациюНУ
	|
	|	) КАК СписокОС
	|
	|ГДЕ
	|	(СписокОС.НеУказанСрокИспользованияНУ
	|		ИЛИ СписокОС.НеУказанаАмортизационнаяГруппа
	|		ИЛИ СписокОС.НеУказанаСтатьяРасходовАмортизационнойПремии)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	//-- Локализация
	
КонецПроцедуры

// 
// Параметры:
//  ПараметрыРасчета - см. ВнеоборотныеАктивы.НовыеПараметрыРасчетаАмортизации
//
Процедура ВыполнитьРасчетАмортизации(ПараметрыРасчета) Экспорт

	//++ Локализация
	
	ПараметрыРасчета.ИспользуемыеТаблицы = 
		ПараметрыРасчета.ИспользуемыеТаблицы 
		+ ",РасчетАмортизации_БУ,АмортизационнаяПремия";
	
	ИспользуемыеТаблицы = ОбщегоНазначенияУТ.СписокВременныхТаблиц(ПараметрыРасчета.МенеджерВременныхТаблиц);
	Для Каждого ИмяТаблицы Из СтрРазделить(ПараметрыРасчета.ИспользуемыеТаблицы, ",") Цикл
		ИспользуемыеТаблицы.Добавить(ИмяТаблицы);
	КонецЦикла;
	
	ДоначислитьАмортизациюБУЗаПрошлыйМесяц(ПараметрыРасчета);
	РассчитатьАмортизациюБУЗаТекущийМесяц(ПараметрыРасчета);
	
	РассчитатьАмортизациюНУ(ПараметрыРасчета);

	ОбъединитьРасчетАмортизацииБУНУ(ПараметрыРасчета);

	РассчитатьАмортизационнуюПремию(ПараметрыРасчета);
	
	ВернутьПараметрыРасчета(ПараметрыРасчета);
	
	ОбщегоНазначенияУТ.УничтожитьВременныеТаблицы(ПараметрыРасчета.МенеджерВременныхТаблиц,, ИспользуемыеТаблицы);
	
	//-- Локализация
	
КонецПроцедуры
 
// 
// Параметры:
//  СписокЗапросов - Массив из Строка - 
//  ПараметрыРасчета - см. ВнеоборотныеАктивы.НовыеПараметрыРасчетаАмортизации
Процедура ДополнитьТекстЗапросаСписокВсехОС(СписокЗапросов, ПараметрыРасчета) Экспорт

	//++ Локализация
	
	#Область СписокОбъектовУчета_Доначисление_БУ
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СтоимостьОС.Организация      КАК Организация,
	|	СтоимостьОС.ОсновноеСредство КАК ОсновноеСредство,
	|	МИНИМУМ(СтоимостьОС.Период)  КАК Период
	|
	|ПОМЕСТИТЬ СписокОбъектовУчета_Доначисление_БУ
	|
	|ИЗ
	|	РегистрНакопления.СтоимостьОС КАК СтоимостьОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаБухУчета.СрезПоследних(&КонецПредыдущегоМесяца) КАК УчетнаяПолитика
	|		ПО УчетнаяПолитика.Организация = СтоимостьОС.Организация.ГоловнаяОрганизация
	|ГДЕ
	|	СтоимостьОС.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
	|	И СтоимостьОС.ОтражатьВРеглУчете
	|	И СтоимостьОС.Активность
	|	И СтоимостьОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|	И ВЫБОР
	|		КОГДА ИСТИНА В (ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА ИЗ ВТ_АрендованныеОС КАК АрендованныеОС ГДЕ АрендованныеОС.ОсновноеСредство = СтоимостьОС.ОсновноеСредство И АрендованныеОС.НачалоМесяца = &НачалоПредыдущегоМесяца)
	|			ТОГДА ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииАренда, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииОС, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|	КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)
	|
	|	И СтоимостьОС.ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеКУчетуОС), 
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеКУчетуПредметовАренды),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.МодернизацияОС))
	|
	|	И (СтоимостьОС.Организация, СтоимостьОС.ОсновноеСредство) В
	|				(ВЫБРАТЬ
	|					ПакетыАмортизации.Организация,
	|					ПакетыАмортизации.ОбъектУчета
	|				ИЗ
	|					ПакетыАмортизации КАК ПакетыАмортизации)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьОС.Организация,
	|	СтоимостьОС.ОсновноеСредство
	|
	|ИМЕЮЩИЕ
	|	СУММА(СтоимостьОС.СтоимостьРегл - СтоимостьОС.ПредварительнаяСтоимостьРегл) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область СписокОбъектовУчета_БУ
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&КонецМесяца                    КАК ПериодНачисления,
	|	&НачалоМесяца                   КАК НачалоМесяца,
	|	&КонецМесяца                    КАК КонецМесяца,
	|	&КонецПредыдущегоМесяца         КАК Период,
	|	&КонецПредыдущегоМесяца         КАК ПериодПараметров,
	|	ЛОЖЬ                            КАК ЭтоДоначисление,
	|	ЛОЖЬ                            КАК ПолученПриРазукомплектацииОбъединении,
	|	ПорядокУчетаОС.Организация      КАК Организация,
	|	ПорядокУчетаОС.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ПорядокУчетаОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ПорядокУчетаОС.АмортизационнаяГруппа КАК АмортизационнаяГруппа,
	|
	|	ПорядокУчетаОС.НачислятьАмортизациюБУ КАК НачислятьАмортизациюБУ,
	|	ПорядокУчетаОС.НачислятьАмортизациюНУ КАК НачислятьАмортизациюНУ,
	|
	|	ПорядокУчетаОС.СпособОтраженияРасходовБУ КАК СпособОтраженияРасходовБУ,
	|	ПорядокУчетаОС.СпособОтраженияРасходовНУ КАК СпособОтраженияРасходовНУ,
	|	ПорядокУчетаОС.СпособОтраженияРасходовАмортизационнойПремии КАК СпособОтраженияРасходовАмортизационнойПремии,
	|
	|	ПорядокУчетаОС.СтатьяРасходовБУ    КАК СтатьяРасходовБУ,
	|	ПорядокУчетаОС.АналитикаРасходовБУ КАК АналитикаРасходовБУ,
	|	ПорядокУчетаОС.СтатьяРасходовНУ    КАК СтатьяРасходовНУ,
	|	ПорядокУчетаОС.АналитикаРасходовНУ КАК АналитикаРасходовНУ,
	|
	|	ПорядокУчетаОС.СтатьяРасходовАмортизационнойПремии    КАК СтатьяРасходовАмортизационнойПремии,
	|	ПорядокУчетаОС.АналитикаРасходовАмортизационнойПремии КАК АналитикаРасходовАмортизационнойПремии,
	|
	|	ПорядокУчетаОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ПорядокУчетаОС.ОрганизацияПолучательРасходов       КАК ОрганизацияПолучательРасходов,
	|
	|	ЕСТЬNULL(УчетнаяПолитикаУУ.ВариантПроводокПоОбесценениюВНА, ЗНАЧЕНИЕ(Перечисление.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения)) КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	ЕСТЬNULL(УчетнаяПолитика.ПрименяетсяФСБУ6, ИСТИНА) КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|
	|	ВЫБОР
	|		КОГДА ИСТИНА В (ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА ИЗ ВТ_АрендованныеОС КАК АрендованныеОС ГДЕ АрендованныеОС.ОсновноеСредство = ПорядокУчетаОС.ОсновноеСредство И АрендованныеОС.НачалоМесяца = &НачалоМесяца)
	|			ТОГДА ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииАренда, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииОС, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|	КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету) КАК АмортизацияНачисляетсяСДатыПринятияКУчету
	|
	|ПОМЕСТИТЬ СписокОбъектовУчета_БУ
	|
	|ИЗ
	|	РегистрСведений.ПорядокУчетаОСБУ.СрезПоследних(
	|			&КонецПредыдущегоМесяца,
	|			ДатаИсправления = ДАТАВРЕМЯ(1,1,1)
	|			И (Организация, ОсновноеСредство) В
	|				(ВЫБРАТЬ
	|					ПакетыАмортизации.Организация,
	|					ПакетыАмортизации.ОбъектУчета
	|				ИЗ
	|					ПакетыАмортизации КАК ПакетыАмортизации)) КАК ПорядокУчетаОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаБухУчета.СрезПоследних(&КонецМесяца) КАК УчетнаяПолитика
	|		ПО УчетнаяПолитика.Организация = ПорядокУчетаОС.Организация.ГоловнаяОрганизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета.СрезПоследних(&КонецМесяца) КАК УчетнаяПолитикаУУ
	|		ПО УчетнаяПолитикаУУ.Организация = ПорядокУчетаОС.Организация.ГоловнаяОрганизация
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	&КонецМесяца                    КАК ПериодНачисления,
	|	&НачалоПредыдущегоМесяца        КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца         КАК КонецМесяца,
	|	&НачалоПредыдущегоМесяца        КАК Период,
	|	&КонецПозапрошлогоМесяца        КАК ПериодПараметров,
	|	ИСТИНА                          КАК ЭтоДоначисление,
	|	ЛОЖЬ                            КАК ПолученПриРазукомплектацииОбъединении,
	|	ПорядокУчетаОС.Организация      КАК Организация,
	|	ПорядокУчетаОС.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ПорядокУчетаОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ПорядокУчетаОС.АмортизационнаяГруппа КАК АмортизационнаяГруппа,
	|
	|	ПорядокУчетаОС.НачислятьАмортизациюБУ КАК НачислятьАмортизациюБУ,
	|	ПорядокУчетаОС.НачислятьАмортизациюНУ КАК НачислятьАмортизациюНУ,
	|
	|	ПорядокУчетаОС.СпособОтраженияРасходовБУ КАК СпособОтраженияРасходовБУ,
	|	ПорядокУчетаОС.СпособОтраженияРасходовНУ КАК СпособОтраженияРасходовНУ,
	|	ПорядокУчетаОС.СпособОтраженияРасходовАмортизационнойПремии КАК СпособОтраженияРасходовАмортизационнойПремии,
	|
	|	ПорядокУчетаОС.СтатьяРасходовБУ    КАК СтатьяРасходовБУ,
	|	ПорядокУчетаОС.АналитикаРасходовБУ КАК АналитикаРасходовБУ,
	|	ПорядокУчетаОС.СтатьяРасходовНУ    КАК СтатьяРасходовНУ,
	|	ПорядокУчетаОС.АналитикаРасходовНУ КАК АналитикаРасходовНУ,
	|
	|	ПорядокУчетаОС.СтатьяРасходовАмортизационнойПремии    КАК СтатьяРасходовАмортизационнойПремии,
	|	ПорядокУчетаОС.АналитикаРасходовАмортизационнойПремии КАК АналитикаРасходовАмортизационнойПремии,
	|
	|	ПорядокУчетаОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ПорядокУчетаОС.ОрганизацияПолучательРасходов       КАК ОрганизацияПолучательРасходов,
	|
	|	ЕСТЬNULL(УчетнаяПолитикаУУ.ВариантПроводокПоОбесценениюВНА, ЗНАЧЕНИЕ(Перечисление.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения)) КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	ЕСТЬNULL(УчетнаяПолитика.ПрименяетсяФСБУ6, ИСТИНА) КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|
	|	ВЫБОР
	|		КОГДА ИСТИНА В (ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА ИЗ ВТ_АрендованныеОС КАК АрендованныеОС ГДЕ АрендованныеОС.ОсновноеСредство = ПорядокУчетаОС.ОсновноеСредство И АрендованныеОС.НачалоМесяца = &НачалоПредыдущегоМесяца)
	|			ТОГДА ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииАренда, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииОС, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|	КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету) КАК АмортизацияНачисляетсяСДатыПринятияКУчету
	|
	|ИЗ
	|	РегистрСведений.ПорядокУчетаОСБУ.СрезПоследних(
	|			&КонецПозапрошлогоМесяца,
	|			ДатаИсправления = ДАТАВРЕМЯ(1,1,1)
	|			И (Организация, ОсновноеСредство) В
	|				(ВЫБРАТЬ
	|					СписокОС.Организация,
	|					СписокОС.ОсновноеСредство
	|				ИЗ
	|					СписокОбъектовУчета_Доначисление_БУ КАК СписокОС)) КАК ПорядокУчетаОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаБухУчета.СрезПоследних(&КонецПредыдущегоМесяца) КАК УчетнаяПолитика
	|		ПО УчетнаяПолитика.Организация = ПорядокУчетаОС.Организация.ГоловнаяОрганизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета.СрезПоследних(&КонецПредыдущегоМесяца) КАК УчетнаяПолитикаУУ
	|		ПО УчетнаяПолитикаУУ.Организация = ПорядокУчетаОС.Организация.ГоловнаяОрганизация
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	&КонецМесяца                    КАК ПериодНачисления,
	|	&НачалоМесяца                   КАК НачалоМесяца,
	|	&КонецМесяца                    КАК КонецМесяца,
	|	НАЧАЛОПЕРИОДА(ПорядокУчетаОС.Период, ДЕНЬ) КАК Период,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПринятиеКУчетуОС.ПринятиеКУчетуПрошлойДатой, ЛОЖЬ)
	|			ТОГДА &КонецПредыдущегоМесяца
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(ПорядокУчетаОС.Период, ДЕНЬ)
	|	КОНЕЦ КАК ПериодПараметров,
	|
	|	ЛОЖЬ                            КАК ЭтоДоначисление,
	|	ТИПЗНАЧЕНИЯ(ПорядокУчетаОС.Регистратор) В (ТИП(Документ.РазукомплектацияОС), ТИП(Документ.ОбъединениеОС)) КАК ПолученПриРазукомплектацииОбъединении,
	|	ПорядокУчетаОС.Организация      КАК Организация,
	|	ПорядокУчетаОС.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ПорядокУчетаОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ПорядокУчетаОС.АмортизационнаяГруппа КАК АмортизационнаяГруппа,
	|
	|	ПорядокУчетаОС.НачислятьАмортизациюБУ КАК НачислятьАмортизациюБУ,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПринятиеКУчетуОС.ПринятиеКУчетуПрошлойДатой, ЛОЖЬ)
	|				И ЕСТЬNULL(ПринятиеКУчетуОС.ОтражатьВНУ, ЛОЖЬ)
	|			ТОГДА ПорядокУчетаОС.НачислятьАмортизациюНУ
	|		ИНАЧЕ ЛОЖЬ 
	|	КОНЕЦ КАК НачислятьАмортизациюНУ,
	|
	|	ПорядокУчетаОС.СпособОтраженияРасходовБУ КАК СпособОтраженияРасходовБУ,
	|	НЕОПРЕДЕЛЕНО КАК СпособОтраженияРасходовНУ,
	|	НЕОПРЕДЕЛЕНО КАК СпособОтраженияРасходовАмортизационнойПремии,
	|
	|	ПорядокУчетаОС.СтатьяРасходовБУ    КАК СтатьяРасходовБУ,
	|	ПорядокУчетаОС.АналитикаРасходовБУ КАК АналитикаРасходовБУ,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПринятиеКУчетуОС.ПринятиеКУчетуПрошлойДатой, ЛОЖЬ)
	|				И ЕСТЬNULL(ПринятиеКУчетуОС.ОтражатьВНУ, ЛОЖЬ)
	|			ТОГДА ПорядокУчетаОС.СтатьяРасходовНУ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО 
	|	КОНЕЦ КАК СтатьяРасходовНУ,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПринятиеКУчетуОС.ПринятиеКУчетуПрошлойДатой, ЛОЖЬ)
	|				И ЕСТЬNULL(ПринятиеКУчетуОС.ОтражатьВНУ, ЛОЖЬ)
	|			ТОГДА ПорядокУчетаОС.АналитикаРасходовНУ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО 
	|	КОНЕЦ КАК АналитикаРасходовНУ,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПринятиеКУчетуОС.ПринятиеКУчетуПрошлойДатой, ЛОЖЬ)
	|				И ЕСТЬNULL(ПринятиеКУчетуОС.ОтражатьВНУ, ЛОЖЬ)
	|			ТОГДА ПорядокУчетаОС.СтатьяРасходовАмортизационнойПремии
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО 
	|	КОНЕЦ КАК СтатьяРасходовАмортизационнойПремии,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПринятиеКУчетуОС.ПринятиеКУчетуПрошлойДатой, ЛОЖЬ)
	|				И ЕСТЬNULL(ПринятиеКУчетуОС.ОтражатьВНУ, ЛОЖЬ)
	|			ТОГДА ПорядокУчетаОС.АналитикаРасходовАмортизационнойПремии
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО 
	|	КОНЕЦ КАК АналитикаРасходовАмортизационнойПремии,
	|
	|	ПорядокУчетаОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ПорядокУчетаОС.ОрганизацияПолучательРасходов       КАК ОрганизацияПолучательРасходов,
	|
	|	ЕСТЬNULL(УчетнаяПолитикаУУ.ВариантПроводокПоОбесценениюВНА, ЗНАЧЕНИЕ(Перечисление.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения)) КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	ЕСТЬNULL(УчетнаяПолитика.ПрименяетсяФСБУ6, ИСТИНА) КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|
	|	ВЫБОР
	|		КОГДА ИСТИНА В (ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА ИЗ ВТ_АрендованныеОС КАК АрендованныеОС ГДЕ АрендованныеОС.ОсновноеСредство = ПорядокУчетаОС.ОсновноеСредство И АрендованныеОС.НачалоМесяца = &НачалоМесяца)
	|			ТОГДА ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииАренда, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииОС, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|	КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету) КАК АмортизацияНачисляетсяСДатыПринятияКУчету
	|
	|ИЗ
	|	РегистрСведений.ПорядокУчетаОСБУ КАК ПорядокУчетаОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаБухУчета.СрезПоследних(&КонецМесяца) КАК УчетнаяПолитика
	|		ПО УчетнаяПолитика.Организация = ПорядокУчетаОС.Организация.ГоловнаяОрганизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета.СрезПоследних(&КонецМесяца) КАК УчетнаяПолитикаУУ
	|		ПО УчетнаяПолитикаУУ.Организация = ПорядокУчетаОС.Организация.ГоловнаяОрганизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОС2_4 КАК ПринятиеКУчетуОС
	|		ПО ПринятиеКУчетуОС.Ссылка = ПорядокУчетаОС.Регистратор
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуУзловКомпонентовАмортизации КАК ПринятиеКУчетуУзловКомпонентовАмортизации
	|		ПО ПринятиеКУчетуУзловКомпонентовАмортизации.Ссылка = ПорядокУчетаОС.Регистратор
	|
	|ГДЕ
	|	ПорядокУчетаОС.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И ПорядокУчетаОС.СостояниеБУ = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету)
	|
	|	И (ЕСТЬNULL(ПринятиеКУчетуОС.ПринятиеКУчетуПрошлойДатой, ЛОЖЬ)
	|			И ЕСТЬNULL(ПринятиеКУчетуОС.ОтражатьВБУ, ЛОЖЬ)
	|		ИЛИ ЕСТЬNULL(УчетнаяПолитика.ПрименяетсяФСБУ6, ИСТИНА)
	|				И ВЫБОР
	|					КОГДА ИСТИНА В (ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА ИЗ ВТ_АрендованныеОС КАК АрендованныеОС ГДЕ АрендованныеОС.ОсновноеСредство = ПорядокУчетаОС.ОсновноеСредство И АрендованныеОС.НачалоМесяца = &НачалоМесяца)
	|						ТОГДА ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииАренда, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|					ИНАЧЕ ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииОС, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|				КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|
	|	И (ТИПЗНАЧЕНИЯ(ПорядокУчетаОС.Регистратор) = ТИП(Документ.ПринятиеКУчетуОС2_4)
	|			И ЕСТЬNULL(ПринятиеКУчетуОС.ОтражатьВБУ, ЛОЖЬ)
	|		ИЛИ ТИПЗНАЧЕНИЯ(ПорядокУчетаОС.Регистратор) = ТИП(Документ.ПринятиеКУчетуУзловКомпонентовАмортизации)
	|			И ЕСТЬNULL(ПринятиеКУчетуУзловКомпонентовАмортизации.ОтражатьВРеглУчете, ЛОЖЬ)
	|		ИЛИ ТИПЗНАЧЕНИЯ(ПорядокУчетаОС.Регистратор) В (
	|				ТИП(Документ.РазукомплектацияОС),
	|				ТИП(Документ.ОбъединениеОС)))
	|
	|	И (ПорядокУчетаОС.Организация, ПорядокУчетаОС.ОсновноеСредство) В
	|				(ВЫБРАТЬ
	|					ПакетыАмортизации.Организация,
	|					ПакетыАмортизации.ОбъектУчета
	|				ИЗ
	|					ПакетыАмортизации КАК ПакетыАмортизации)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	&КонецМесяца                    КАК ПериодНачисления,
	|	&НачалоПредыдущегоМесяца        КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца         КАК КонецМесяца,
	|	НАЧАЛОПЕРИОДА(ПорядокУчетаОС.Период, ДЕНЬ) КАК Период,
	|	НАЧАЛОПЕРИОДА(ПорядокУчетаОС.Период, ДЕНЬ) КАК ПериодПараметров,
	|	ИСТИНА                          КАК ЭтоДоначисление,
	|	ЛОЖЬ                            КАК ПолученПриРазукомплектацииОбъединении,
	|	ПорядокУчетаОС.Организация      КАК Организация,
	|	ПорядокУчетаОС.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ПорядокУчетаОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ПорядокУчетаОС.АмортизационнаяГруппа КАК АмортизационнаяГруппа,
	|
	|	ПорядокУчетаОС.НачислятьАмортизациюБУ КАК НачислятьАмортизациюБУ,
	|	ПорядокУчетаОС.НачислятьАмортизациюНУ КАК НачислятьАмортизациюНУ,
	|
	|	ПорядокУчетаОС.СпособОтраженияРасходовБУ КАК СпособОтраженияРасходовБУ,
	|	ПорядокУчетаОС.СпособОтраженияРасходовНУ КАК СпособОтраженияРасходовНУ,
	|	ПорядокУчетаОС.СпособОтраженияРасходовАмортизационнойПремии КАК СпособОтраженияРасходовАмортизационнойПремии,
	|
	|	ПорядокУчетаОС.СтатьяРасходовБУ    КАК СтатьяРасходовБУ,
	|	ПорядокУчетаОС.АналитикаРасходовБУ КАК АналитикаРасходовБУ,
	|	ПорядокУчетаОС.СтатьяРасходовНУ    КАК СтатьяРасходовНУ,
	|	ПорядокУчетаОС.АналитикаРасходовНУ КАК АналитикаРасходовНУ,
	|
	|	ПорядокУчетаОС.СтатьяРасходовАмортизационнойПремии    КАК СтатьяРасходовАмортизационнойПремии,
	|	ПорядокУчетаОС.АналитикаРасходовАмортизационнойПремии КАК АналитикаРасходовАмортизационнойПремии,
	|
	|	ПорядокУчетаОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ПорядокУчетаОС.ОрганизацияПолучательРасходов       КАК ОрганизацияПолучательРасходов,
	|
	|	ЕСТЬNULL(УчетнаяПолитикаУУ.ВариантПроводокПоОбесценениюВНА, ЗНАЧЕНИЕ(Перечисление.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения)) КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	ЕСТЬNULL(УчетнаяПолитика.ПрименяетсяФСБУ6, ИСТИНА) КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|
	|	ВЫБОР
	|		КОГДА ИСТИНА В (ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА ИЗ ВТ_АрендованныеОС КАК АрендованныеОС ГДЕ АрендованныеОС.ОсновноеСредство = ПорядокУчетаОС.ОсновноеСредство И АрендованныеОС.НачалоМесяца = &НачалоПредыдущегоМесяца)
	|			ТОГДА ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииАренда, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииОС, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|	КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету) КАК АмортизацияНачисляетсяСДатыПринятияКУчету
	|
	|ИЗ
	|	РегистрСведений.ПорядокУчетаОСБУ КАК ПорядокУчетаОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаБухУчета.СрезПоследних(&КонецПредыдущегоМесяца) КАК УчетнаяПолитика
	|		ПО УчетнаяПолитика.Организация = ПорядокУчетаОС.Организация.ГоловнаяОрганизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета.СрезПоследних(&КонецПредыдущегоМесяца) КАК УчетнаяПолитикаУУ
	|		ПО УчетнаяПолитикаУУ.Организация = ПорядокУчетаОС.Организация.ГоловнаяОрганизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОС2_4 КАК ПринятиеКУчетуОС
	|		ПО ПринятиеКУчетуОС.Ссылка = ПорядокУчетаОС.Регистратор
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуУзловКомпонентовАмортизации КАК ПринятиеКУчетуУзловКомпонентовАмортизации
	|		ПО ПринятиеКУчетуУзловКомпонентовАмортизации.Ссылка = ПорядокУчетаОС.Регистратор
	|ГДЕ
	|	ПорядокУчетаОС.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
	|	И ПорядокУчетаОС.СостояниеБУ = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету)
	|
	|	И ЕСТЬNULL(УчетнаяПолитика.ПрименяетсяФСБУ6, ИСТИНА)
	|
	|	И ВЫБОР
	|		КОГДА ИСТИНА В (ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА ИЗ ВТ_АрендованныеОС КАК АрендованныеОС ГДЕ АрендованныеОС.ОсновноеСредство = ПорядокУчетаОС.ОсновноеСредство И АрендованныеОС.НачалоМесяца = &НачалоПредыдущегоМесяца)
	|			ТОГДА ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииАренда, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииОС, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|	КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)
	|
	|	И (ТИПЗНАЧЕНИЯ(ПорядокУчетаОС.Регистратор) = ТИП(Документ.ПринятиеКУчетуОС2_4)
	|			И ЕСТЬNULL(ПринятиеКУчетуОС.ОтражатьВБУ, ЛОЖЬ)
	|		ИЛИ ТИПЗНАЧЕНИЯ(ПорядокУчетаОС.Регистратор) = ТИП(Документ.ПринятиеКУчетуУзловКомпонентовАмортизации)
	|			И ЕСТЬNULL(ПринятиеКУчетуУзловКомпонентовАмортизации.ОтражатьВРеглУчете, ЛОЖЬ)
	|		ИЛИ ТИПЗНАЧЕНИЯ(ПорядокУчетаОС.Регистратор) = ТИП(Документ.РазукомплектацияОС))
	|
	|	И (ПорядокУчетаОС.Организация, ПорядокУчетаОС.ОсновноеСредство) В
	|				(ВЫБРАТЬ
	|					СписокОС.Организация,
	|					СписокОС.ОсновноеСредство
	|				ИЗ
	|					СписокОбъектовУчета_Доначисление_БУ КАК СписокОС)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство, 
	|	ГоловнаяОрганизация,
	|	Организация";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	//-- Локализация
	
КонецПроцедуры

// 
// Параметры:
//  ПараметрыРасчета - см. ВнеоборотныеАктивы.НовыеПараметрыРасчетаАмортизации
// 
// Возвращаемое значение:
//  Строка - Текст запроса
Функция ТекстЗапросаВтСписокОСУменьшаемогоОстатка(ПараметрыРасчета) Экспорт

	ТекстЗапроса = Неопределено;
	
	//++ Локализация
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СписокОС.ОсновноеСредство
	|ПОМЕСТИТЬ втСписокОСУменьшаемогоОстатка
	|ИЗ
	|	ПервоначальныеСведенияОС КАК СписокОС
	|ГДЕ
	|	СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СписокОС.ОсновноеСредство
	|ИЗ
	|	ПараметрыАмортизацииОСУУ КАК СписокОС
	|ГДЕ
	|	СписокОС.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство";
	
	//-- Локализация
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Текст запроса стоимость и амортизация на начало года.
// 
// Параметры:
//  ПараметрыРасчета - см. ВнеоборотныеАктивы.НовыеПараметрыРасчетаАмортизации
// 
// Возвращаемое значение:
//  Строка - Текст запроса
Функция ТекстЗапросаСтоимостьИАмортизацияНаНачалоГода(ПараметрыРасчета) Экспорт

	ТекстЗапроса = Неопределено;
	
	//++ Локализация
	
	Если ПараметрыРасчета.ДатаНачалаУчета <= НачалоГода(ПараметрыРасчета.Период) Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&НачалоМесяца                            КАК НачалоМесяца,
		|	СтоимостьОС.ОсновноеСредство             КАК ОсновноеСредство,
		|	СтоимостьОС.СтоимостьОстаток             КАК Стоимость,
		|	СтоимостьОС.СтоимостьРеглОстаток         КАК СтоимостьРегл,
		|	СтоимостьОС.СтоимостьЦФОстаток           КАК СтоимостьЦФ
		|ПОМЕСТИТЬ СтоимостьОС_НаНачалоГода
		|ИЗ
		|	РегистрНакопления.СтоимостьОС.Остатки(
		|			&НачалоГода,
		|			ОсновноеСредство В
		|				(ВЫБРАТЬ СписокОС.ОсновноеСредство ИЗ втСписокОСУменьшаемогоОстатка КАК СписокОС)) КАК СтоимостьОС
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&НачалоМесяца                          КАК НачалоМесяца,
		|	АмортизацияОС.ОсновноеСредство         КАК ОсновноеСредство,
		|	-АмортизацияОС.АмортизацияОстаток      КАК Амортизация,
		|	-АмортизацияОС.АмортизацияРеглОстаток  КАК АмортизацияРегл,
		|	-АмортизацияОС.АмортизацияЦФОстаток    КАК АмортизацияЦФ
		|ПОМЕСТИТЬ АмортизацияОС_НаНачалоГода
		|ИЗ
		|	РегистрНакопления.АмортизацияОС.Остатки(
		|			&НачалоГода,
		|			ОсновноеСредство В
		|				(ВЫБРАТЬ СписокОС.ОсновноеСредство ИЗ втСписокОСУменьшаемогоОстатка КАК СписокОС)) КАК АмортизацияОС
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство";
		
	Иначе
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СчетаУчета.СчетУчета КАК СчетУчета,
		|	СчетаУчета.СчетНачисленияАмортизации КАК СчетНачисленияАмортизации
		|ПОМЕСТИТЬ СчетаНачалоГода
		|ИЗ
		|	РегистрСведений.ПорядокУчетаОС.СрезПоследних(
		|			&НачалоГода,
		|			ОсновноеСредство В
		|					(ВЫБРАТЬ
		|						СписокОС.ОсновноеСредство
		|					ИЗ
		|						втСписокОСУменьшаемогоОстатка КАК СписокОС)) КАК СчетаУчета
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПараметрыЦелевогоФинансированияОС.СчетУчета КАК СчетУчета,
		|	ПараметрыЦелевогоФинансированияОС.СчетАмортизации КАК СчетАмортизации
		|ИЗ
		|	РегистрСведений.ПараметрыЦелевогоФинансированияОС.СрезПоследних(
		|			&НачалоГода,
		|			ОсновноеСредство В
		|				(ВЫБРАТЬ
		|					СписокОС.ОсновноеСредство
		|				ИЗ
		|					втСписокОСУменьшаемогоОстатка КАК СписокОС)) КАК ПараметрыЦелевогоФинансированияОС
		|ГДЕ
		|	ПараметрыЦелевогоФинансированияОС.ПрименениеЦелевогоФинансирования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&НачалоМесяца                            КАК НачалоМесяца,
		|	СтоимостьОС.Субконто1                    КАК ОсновноеСредство,
		|	0                                        КАК Стоимость,
		|	СтоимостьОС.СуммаОстатокДт               КАК СтоимостьРегл,
		|	0                                        КАК СтоимостьЦФ
		|ПОМЕСТИТЬ СтоимостьОС_НаНачалоГода
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&НачалоГода,
		|			Счет В
		|				(ВЫБРАТЬ
		|					СчетаНачалоГода.СчетУчета
		|				ИЗ
		|					СчетаНачалоГода КАК СчетаНачалоГода),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
		|			Субконто1 В
		|					(ВЫБРАТЬ
		|						СписокОС.ОсновноеСредство
		|					ИЗ
		|						втСписокОСУменьшаемогоОстатка КАК СписокОС)) КАК СтоимостьОС
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&НачалоМесяца                          КАК НачалоМесяца,
		|	АмортизацияОС.Субконто1                КАК ОсновноеСредство,
		|	0                                      КАК Амортизация,
		|	АмортизацияОС.СуммаОстатокКт           КАК АмортизацияРегл,
		|	0                                      КАК АмортизацияЦФ
		|ПОМЕСТИТЬ АмортизацияОС_НаНачалоГода
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&НачалоГода,
		|			Счет В
		|				(ВЫБРАТЬ
		|					СчетаНачалоГода.СчетНачисленияАмортизации
		|				ИЗ
		|					СчетаНачалоГода КАК СчетаНачалоГода),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
		|			Субконто1 В
		|					(ВЫБРАТЬ
		|						СписокОС.ОсновноеСредство
		|					ИЗ
		|						втСписокОСУменьшаемогоОстатка КАК СписокОС)) КАК АмортизацияОС
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство";
		
	КонецЕсли; 
	
	//-- Локализация
	
	Возврат ТекстЗапроса;

КонецФункции
 
// 
// Параметры:
//  ПараметрыРасчета - см. ВнеоборотныеАктивы.НовыеПараметрыРасчетаАмортизации
Процедура ЗарегистрироватьОшибкиРасчетаАмортизации(ПараметрыРасчета) Экспорт

	//++ Локализация
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПроверкаПараметровРасчета.ОбъектУчета КАК ОбъектУчета,
	|	ПроверкаПараметровРасчета.Организация КАК Организация,
	|	ВЫРАЗИТЬ(ПроверкаПараметровРасчета.ОбъектУчета КАК Справочник.ОбъектыЭксплуатации).Наименование КАК ОбъектУчетаПредставление,
	|	ВЫРАЗИТЬ(ПроверкаПараметровРасчета.ОбъектУчета КАК Справочник.ОбъектыЭксплуатации).ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	МАКСИМУМ(ПроверкаПараметровРасчета.НеУказанСрокИспользованияБУ) КАК НеУказанСрокИспользованияБУ,
	|	МАКСИМУМ(ПроверкаПараметровРасчета.НеУказанСрокИспользованияНУ) КАК НеУказанСрокИспользованияНУ,
	|	МАКСИМУМ(ПроверкаПараметровРасчета.НеУказанаАмортизационнаяГруппа) КАК НеУказанаАмортизационнаяГруппа,
	|	МАКСИМУМ(ПроверкаПараметровРасчета.НеУказанОбъемНаработки) КАК НеУказанОбъемНаработки,
	|	МАКСИМУМ(ПроверкаПараметровРасчета.ОбъемНаработкиВыработан) КАК ОбъемНаработкиВыработан,
	|	МАКСИМУМ(ПроверкаПараметровРасчета.НеУказанКоэффициентАмортизации) КАК НеУказанКоэффициентАмортизации,
	|	МАКСИМУМ(ПроверкаПараметровРасчета.НеУказанКоэффициентУскорения) КАК НеУказанКоэффициентУскорения,
	|	МАКСИМУМ(ПроверкаПараметровРасчета.МетодНачисленияНеПрименяется) КАК МетодНачисленияНеПрименяется,
	|	МАКСИМУМ(ПроверкаПараметровРасчета.НеУказанаСтатьяРасходовАмортизационнойПремии) КАК НеУказанаСтатьяРасходовАмортизационнойПремии
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПроверкаПараметровРасчета.ОбъектУчета КАК ОбъектУчета,
	|		ПроверкаПараметровРасчета.Организация КАК Организация,
	|		ПроверкаПараметровРасчета.НеУказанСрокИспользованияБУ КАК НеУказанСрокИспользованияБУ,
	|		ПроверкаПараметровРасчета.НеУказанОбъемНаработки КАК НеУказанОбъемНаработки,
	|		ПроверкаПараметровРасчета.ОбъемНаработкиВыработан КАК ОбъемНаработкиВыработан,
	|		ПроверкаПараметровРасчета.НеУказанКоэффициентАмортизации КАК НеУказанКоэффициентАмортизации,
	|		ПроверкаПараметровРасчета.НеУказанКоэффициентУскорения КАК НеУказанКоэффициентУскорения,
	|		ПроверкаПараметровРасчета.МетодНачисленияНеПрименяется КАК МетодНачисленияНеПрименяется,
	|		ЛОЖЬ КАК НеУказанСрокИспользованияНУ,
	|		ЛОЖЬ КАК НеУказанаАмортизационнаяГруппа,
	|		ЛОЖЬ КАК НеУказанаСтатьяРасходовАмортизационнойПремии
	|	ИЗ
	|		ПроверкаПараметровРасчета_БУ КАК ПроверкаПараметровРасчета
	|	ГДЕ
	|		ПроверкаПараметровРасчета.Организация В(&СписокОрганизаций)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ПроверкаПараметровРасчета.ОбъектУчета КАК ОбъектУчета,
	|		ПроверкаПараметровРасчета.Организация КАК Организация,
	|		ПроверкаПараметровРасчета.НеУказанСрокИспользованияБУ КАК НеУказанСрокИспользованияБУ,
	|		ПроверкаПараметровРасчета.НеУказанОбъемНаработки КАК НеУказанОбъемНаработки,
	|		ЛОЖЬ КАК ОбъемНаработкиВыработан,
	|		ЛОЖЬ КАК НеУказанКоэффициентАмортизации,
	|		ЛОЖЬ КАК НеУказанКоэффициентУскорения,
	|		ПроверкаПараметровРасчета.МетодНачисленияНеПрименяется КАК МетодНачисленияНеПрименяется,
	|		ЛОЖЬ КАК НеУказанСрокИспользованияНУ,
	|		ЛОЖЬ КАК НеУказанаАмортизационнаяГруппа,
	|		ЛОЖЬ КАК НеУказанаСтатьяРасходовАмортизационнойПремии
	|	ИЗ
	|		ПроверкаПараметровРасчетаИзменения_БУ КАК ПроверкаПараметровРасчета
	|	ГДЕ
	|		ПроверкаПараметровРасчета.Организация В(&СписокОрганизаций)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ПроверкаПараметровРасчета.ОбъектУчета КАК ОбъектУчета,
	|		ПроверкаПараметровРасчета.Организация КАК Организация,
	|		ЛОЖЬ КАК НеУказанСрокИспользованияБУ,
	|		ЛОЖЬ КАК НеУказанОбъемНаработки,
	|		ЛОЖЬ КАК ОбъемНаработкиВыработан,
	|		ЛОЖЬ КАК НеУказанКоэффициентАмортизации,
	|		ЛОЖЬ КАК НеУказанКоэффициентУскорения,
	|		ЛОЖЬ КАК МетодНачисленияНеПрименяется,
	|		ПроверкаПараметровРасчета.НеУказанСрокИспользованияНУ КАК НеУказанСрокИспользованияНУ,
	|		ПроверкаПараметровРасчета.НеУказанаАмортизационнаяГруппа КАК НеУказанаАмортизационнаяГруппа,
	|		ПроверкаПараметровРасчета.НеУказанаСтатьяРасходовАмортизационнойПремии КАК НеУказанаСтатьяРасходовАмортизационнойПремии
	|	ИЗ
	|		ПроверкаПараметровРасчета_НУ КАК ПроверкаПараметровРасчета
	|	ГДЕ
	|		ПроверкаПараметровРасчета.Организация В(&СписокОрганизаций)
	|
	|	) КАК ПроверкаПараметровРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ПроверкаПараметровРасчета.ОбъектУчета,
	|	ПроверкаПараметровРасчета.Организация";
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("СписокОрганизаций", ПараметрыРасчета.СписокОрганизаций);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ШаблонАмортизационнаяГруппа  = НСтр("ru = 'Для основного средства ""%1"" (инв. №%2) не указана амортизационная группа.'");
	
	ШаблонОбъемНаработки         = НСтр("ru = 'Для основного средства ""%1"" (инв. №%2) предполагаемый объем наработки полностью выработан.
										|Если была произведена модернизация после полной выработки ресурса, то необходимо оформить документ ""Изменение параметров ОС"" и увеличить предполагаемый объем наработки или приостановить начисление амортизации в управленческом учете.'");
	
	ШаблонКоэффициентАмортизации = НСтр("ru = 'Для основного средства ""%1"" (инв. №%2) не указан процент годовой амортизации.'");
	ШаблонКоэффициентУскорения   = НСтр("ru = 'Для основного средства ""%1"" (инв. №%2) не указан коэффициент ускорения.'");

	ШаблонСрокИспользованияБУ    = НСтр("ru = 'Для основного средства ""%1"" (инв. №%2) в бухгалтерском учете не определен срок использования, необходимый для вычисления амортизации.
										|Если была произведена модернизация после окончания срока использования, то следует оформить документ ""Изменение параметров ОС"" и указать новый срок (первоначальный + срок, на который произошло увеличение после модернизации) или приостановить начисление амортизации.'");
										
	ШаблонСрокИспользованияНУ    = НСтр("ru = 'Для основного средства ""%1"" (инв. №%2) не указан срок использования в налоговом учете.'");
	ШаблонСтатьяРасходовАмортизационнойПремии = НСтр("ru = 'Для основного средства ""%1"" (инв. №%2) не указана статья расходов по амортизационной премии.'");
	
	ШаблонОбъемНаработкиВыработан = НСтр("ru = 'Для основного средства ""%1"" (инв. №%2) предполагаемый объем наработки полностью выработан.
												|Если была произведена модернизация после полной выработки ресурса, то необходимо оформить документ ""Изменение параметров ОС"" и увеличить предполагаемый объем наработки или приостановить начисление амортизации в бухгалтерском учете.'");
												
	ШаблонМетодНачисленияНеПрименяется = НСтр("ru = 'Для основного средства ""%1"" (инв. №%2) в бухгалтерском учете указан метод начисления, который не применяется при учете по стандарту ФСБУ 6/2020.
												|Необходимо изменить метод начисления с помощью документа ""Изменение параметров ОС"".'");
												
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.НеУказанаАмортизационнаяГруппа Тогда
			
			ТекстОшибки = СтрШаблон(ШаблонАмортизационнаяГруппа, Выборка.ОбъектУчетаПредставление, СокрЛП(Выборка.ИнвентарныйНомер));
			ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
				ПараметрыРасчета.ЭтапРасчета, 
				ПараметрыРасчета.Период,
				Выборка.Организация,
				ТекстОшибки,,
				Выборка.ОбъектУчета,
				ПараметрыРасчета.ЕстьОшибки);
				
		КонецЕсли;
		
		Если Выборка.НеУказанОбъемНаработки Тогда
			
			ТекстОшибки = СтрШаблон(ШаблонОбъемНаработки, Выборка.ОбъектУчетаПредставление, СокрЛП(Выборка.ИнвентарныйНомер));
			ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
				ПараметрыРасчета.ЭтапРасчета, 
				ПараметрыРасчета.Период,
				Выборка.Организация,
				ТекстОшибки,,
				Выборка.ОбъектУчета,
				ПараметрыРасчета.ЕстьОшибки);
				
		КонецЕсли; 
		
		Если Выборка.ОбъемНаработкиВыработан Тогда
			
			ТекстОшибки = СтрШаблон(ШаблонОбъемНаработкиВыработан, Выборка.ОбъектУчетаПредставление, СокрЛП(Выборка.ИнвентарныйНомер));
			ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
				ПараметрыРасчета.ЭтапРасчета, 
				ПараметрыРасчета.Период,
				Выборка.Организация,
				ТекстОшибки,,
				Выборка.ОбъектУчета,
				ПараметрыРасчета.ЕстьОшибки);
				
		КонецЕсли; 
		
		Если Выборка.НеУказанКоэффициентАмортизации Тогда
			
			ТекстОшибки = СтрШаблон(ШаблонКоэффициентАмортизации, Выборка.ОбъектУчетаПредставление, СокрЛП(Выборка.ИнвентарныйНомер));
			ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
				ПараметрыРасчета.ЭтапРасчета, 
				ПараметрыРасчета.Период,
				Выборка.Организация,
				ТекстОшибки,,
				Выборка.ОбъектУчета,
				ПараметрыРасчета.ЕстьОшибки);
				
		КонецЕсли; 
		
		Если Выборка.НеУказанКоэффициентУскорения Тогда
			
			ТекстОшибки = СтрШаблон(ШаблонКоэффициентУскорения, Выборка.ОбъектУчетаПредставление, СокрЛП(Выборка.ИнвентарныйНомер));
			ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
				ПараметрыРасчета.ЭтапРасчета, 
				ПараметрыРасчета.Период,
				Выборка.Организация,
				ТекстОшибки,,
				Выборка.ОбъектУчета,
				ПараметрыРасчета.ЕстьОшибки);
				
		КонецЕсли; 
		
		Если Выборка.НеУказанСрокИспользованияБУ Тогда
			
			ТекстОшибки = СтрШаблон(ШаблонСрокИспользованияБУ, Выборка.ОбъектУчетаПредставление, СокрЛП(Выборка.ИнвентарныйНомер));
			ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
				ПараметрыРасчета.ЭтапРасчета, 
				ПараметрыРасчета.Период,
				Выборка.Организация,
				ТекстОшибки,,
				Выборка.ОбъектУчета,
				ПараметрыРасчета.ЕстьОшибки);
				
		КонецЕсли; 
		
		Если Выборка.НеУказанСрокИспользованияНУ Тогда
			
			ТекстОшибки = СтрШаблон(ШаблонСрокИспользованияНУ, Выборка.ОбъектУчетаПредставление, СокрЛП(Выборка.ИнвентарныйНомер));
			ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
				ПараметрыРасчета.ЭтапРасчета, 
				ПараметрыРасчета.Период,
				Выборка.Организация,
				ТекстОшибки,,
				Выборка.ОбъектУчета,
				ПараметрыРасчета.ЕстьОшибки);
				
		КонецЕсли; 
		
		Если Выборка.НеУказанаСтатьяРасходовАмортизационнойПремии Тогда
			
			ТекстОшибки = СтрШаблон(ШаблонСтатьяРасходовАмортизационнойПремии, Выборка.ОбъектУчетаПредставление, СокрЛП(Выборка.ИнвентарныйНомер));
			ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
				ПараметрыРасчета.ЭтапРасчета, 
				ПараметрыРасчета.Период,
				Выборка.Организация,
				ТекстОшибки,,
				Выборка.ОбъектУчета,
				ПараметрыРасчета.ЕстьОшибки);
				
		КонецЕсли; 
	
		Если Выборка.МетодНачисленияНеПрименяется Тогда
			
			ТекстОшибки = СтрШаблон(ШаблонМетодНачисленияНеПрименяется, Выборка.ОбъектУчетаПредставление, СокрЛП(Выборка.ИнвентарныйНомер));
			ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
				ПараметрыРасчета.ЭтапРасчета, 
				ПараметрыРасчета.Период,
				Выборка.Организация,
				ТекстОшибки,,
				Выборка.ОбъектУчета,
				ПараметрыРасчета.ЕстьОшибки);
				
		КонецЕсли;
		 
	КонецЦикла;
	
	//-- Локализация
	
КонецПроцедуры

// 
// Параметры:
//  ПараметрыРасчета - см. ВнеоборотныеАктивы.НовыеПараметрыРасчетаАмортизации
// 
// Возвращаемое значение:
//  Строка - Текст запроса
// 
Функция ТекстЗапросаСписокОбъектовУчета(ПараметрыРасчета) Экспорт

	ТекстЗапроса = Неопределено;
	
	//++ Локализация
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокОС.НачалоМесяца                        КАК НачалоМесяца,
	|	СписокОС.КонецМесяца                         КАК КонецМесяца,
	|	СписокОС.Организация                         КАК Организация,
	|	СписокОС.ОсновноеСредство                    КАК ОсновноеСредство,
	|	ЕСТЬNULL(ПакетыАмортизацииОС.НомерПакета, 0) КАК НомерПакета,
	|
	|	СписокОС.ВариантПроводокПоОбесценениюВНА     КАК ВариантПроводокПоОбесценениюВНА,
	|	СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету КАК АмортизацияНачисляетсяСДатыПринятияКУчету,
	|
	|	(ЕСТЬNULL(УчетнаяПолитикаБУ.ПрименяетсяФСБУ6, ИСТИНА)
	|		ИЛИ ЕСТЬNULL(УчетнаяПолитикаУУ.ПорядокУчетаВНА, ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) 
	|				= ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|
	|	(ЕСТЬNULL(УчетнаяПолитикаУУ.ПорядокУчетаВНА, ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) 
	|		= ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) КАК АмортизацияНачисляетсяПоСтандартамМУ_УУ,
	|
	|	ЕСТЬNULL(УчетнаяПолитикаБУ.ПрименяетсяФСБУ6, ИСТИНА) КАК АмортизацияНачисляетсяПоСтандартамМУ_БУ
	|
	|ПОМЕСТИТЬ СписокОбъектовУчета
	|
	|ИЗ
	|	СписокОбъектовУчета_УУ КАК СписокОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПакетыАмортизацииОС КАК ПакетыАмортизацииОС
	|		ПО ПакетыАмортизацииОС.Организация = СписокОС.Организация
	|			И ПакетыАмортизацииОС.ОсновноеСредство = СписокОС.ОсновноеСредство
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаБухУчета.СрезПоследних(&КонецМесяца) КАК УчетнаяПолитикаБУ
	|		ПО УчетнаяПолитикаБУ.Организация = СписокОС.ГоловнаяОрганизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета.СрезПоследних(&КонецМесяца) КАК УчетнаяПолитикаУУ
	|		ПО УчетнаяПолитикаУУ.Организация = СписокОС.ГоловнаяОрганизация
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	&НачалоМесяца                                КАК НачалоМесяца,
	|	&КонецМесяца                                 КАК КонецМесяца,
	|	СписокОС.Организация                         КАК Организация,
	|	СписокОС.ОсновноеСредство                    КАК ОсновноеСредство,
	|	ЕСТЬNULL(ПакетыАмортизацииОС.НомерПакета, 0) КАК НомерПакета,
	|
	|	СписокОС.ВариантПроводокПоОбесценениюВНА     КАК ВариантПроводокПоОбесценениюВНА,
	|	СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету КАК АмортизацияНачисляетсяСДатыПринятияКУчету,
	|
	|	(ЕСТЬNULL(УчетнаяПолитикаБУ.ПрименяетсяФСБУ6, ИСТИНА)
	|		ИЛИ ЕСТЬNULL(УчетнаяПолитикаУУ.ПорядокУчетаВНА, ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) 
	|				= ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|
	|	(ЕСТЬNULL(УчетнаяПолитикаУУ.ПорядокУчетаВНА, ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) 
	|		= ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) КАК АмортизацияНачисляетсяПоСтандартамМУ_УУ,
	|
	|	ЕСТЬNULL(УчетнаяПолитикаБУ.ПрименяетсяФСБУ6, ИСТИНА) КАК АмортизацияНачисляетсяПоСтандартамМУ_БУ
	|ИЗ
	|	СписокОбъектовУчета_БУ КАК СписокОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПакетыАмортизацииОС КАК ПакетыАмортизацииОС
	|		ПО ПакетыАмортизацииОС.Организация = СписокОС.Организация
	|			И ПакетыАмортизацииОС.ОсновноеСредство = СписокОС.ОсновноеСредство
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаБухУчета.СрезПоследних(&КонецМесяца) КАК УчетнаяПолитикаБУ
	|		ПО УчетнаяПолитикаБУ.Организация = СписокОС.ГоловнаяОрганизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета.СрезПоследних(&КонецМесяца) КАК УчетнаяПолитикаУУ
	|		ПО УчетнаяПолитикаУУ.Организация = СписокОС.ГоловнаяОрганизация
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	&НачалоМесяца                                КАК НачалоМесяца,
	|	&КонецМесяца                                 КАК КонецМесяца,
	|	СписокОС.Организация                         КАК Организация,
	|	СписокОС.ОсновноеСредство                    КАК ОсновноеСредство,
	|	ЕСТЬNULL(ПакетыАмортизацииОС.НомерПакета, 0) КАК НомерПакета,
	|
	|	СписокОС.ВариантПроводокПоОбесценениюВНА     КАК ВариантПроводокПоОбесценениюВНА,
	|	СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету КАК АмортизацияНачисляетсяСДатыПринятияКУчету,
	|
	|	(ЕСТЬNULL(УчетнаяПолитикаБУ.ПрименяетсяФСБУ6, ИСТИНА)
	|		ИЛИ ЕСТЬNULL(УчетнаяПолитикаУУ.ПорядокУчетаВНА, ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) 
	|				= ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|
	|	(ЕСТЬNULL(УчетнаяПолитикаУУ.ПорядокУчетаВНА, ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) 
	|		= ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) КАК АмортизацияНачисляетсяПоСтандартамМУ_УУ,
	|
	|	ЕСТЬNULL(УчетнаяПолитикаБУ.ПрименяетсяФСБУ6, ИСТИНА) КАК АмортизацияНачисляетсяПоСтандартамМУ_БУ
	|ИЗ
	|	СписокОбъектовУчета_БУ КАК СписокОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПакетыАмортизацииОС КАК ПакетыАмортизацииОС
	|		ПО ПакетыАмортизацииОС.Организация = СписокОС.Организация
	|			И ПакетыАмортизацииОС.ОсновноеСредство = СписокОС.ОсновноеСредство
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаБухУчета.СрезПоследних(&КонецМесяца) КАК УчетнаяПолитикаБУ
	|		ПО УчетнаяПолитикаБУ.Организация = СписокОС.ГоловнаяОрганизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета.СрезПоследних(&КонецМесяца) КАК УчетнаяПолитикаУУ
	|		ПО УчетнаяПолитикаУУ.Организация = СписокОС.ГоловнаяОрганизация
	|ГДЕ
	|	СписокОС.СпособОтраженияРасходовНУ <> СписокОС.СпособОтраженияРасходовБУ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	&НачалоМесяца                                КАК НачалоМесяца,
	|	&КонецМесяца                                 КАК КонецМесяца,
	|	СписокОС.Организация                         КАК Организация,
	|	СписокОС.ОсновноеСредство                    КАК ОсновноеСредство,
	|	ЕСТЬNULL(ПакетыАмортизацииОС.НомерПакета, 0) КАК НомерПакета,
	|
	|	СписокОС.ВариантПроводокПоОбесценениюВНА     КАК ВариантПроводокПоОбесценениюВНА,
	|	СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету КАК АмортизацияНачисляетсяСДатыПринятияКУчету,
	|
	|	(ЕСТЬNULL(УчетнаяПолитикаБУ.ПрименяетсяФСБУ6, ИСТИНА)
	|		ИЛИ ЕСТЬNULL(УчетнаяПолитикаУУ.ПорядокУчетаВНА, ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) 
	|				= ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|
	|	(ЕСТЬNULL(УчетнаяПолитикаУУ.ПорядокУчетаВНА, ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) 
	|		= ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) КАК АмортизацияНачисляетсяПоСтандартамМУ_УУ,
	|
	|	ЕСТЬNULL(УчетнаяПолитикаБУ.ПрименяетсяФСБУ6, ИСТИНА) КАК АмортизацияНачисляетсяПоСтандартамМУ_БУ
	|ИЗ
	|	СписокОбъектовУчета_БУ КАК СписокОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПакетыАмортизацииОС КАК ПакетыАмортизацииОС
	|		ПО ПакетыАмортизацииОС.Организация = СписокОС.Организация
	|			И ПакетыАмортизацииОС.ОсновноеСредство = СписокОС.ОсновноеСредство
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаБухУчета.СрезПоследних(&КонецМесяца) КАК УчетнаяПолитикаБУ
	|		ПО УчетнаяПолитикаБУ.Организация = СписокОС.ГоловнаяОрганизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета.СрезПоследних(&КонецМесяца) КАК УчетнаяПолитикаУУ
	|		ПО УчетнаяПолитикаУУ.Организация = СписокОС.ГоловнаяОрганизация
	|ГДЕ
	|	НЕ СписокОС.СпособОтраженияРасходовАмортизационнойПремии В (&ПустыеСпособыОтраженияРасходов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация";
	
	//-- Локализация
	
	Возврат ТекстЗапроса;
	
КонецФункции

// 
// Параметры:
//  СписокПодзапросов - Массив из Строка - 
//  ПараметрыРасчета - см. ВнеоборотныеАктивы.НовыеПараметрыРасчетаАмортизации
Процедура ДополнитьТекстПодзапросаНачисленнаяАмортизация(СписокПодзапросов, ПараметрыРасчета) Экспорт

	//++ Локализация
	
	ТекстПодзапроса =
	"	ВЫБРАТЬ
	|		РасчетАмортизации.ПериодРасчета КАК ПериодРасчета,
	|		РасчетАмортизации.Организация КАК Организация,
	|		РасчетАмортизации.Подразделение КАК Подразделение,
	|		РасчетАмортизации.КорПодразделение КАК КорПодразделение,
	|		РасчетАмортизации.ОсновноеСредство КАК ОсновноеСредство,
	|		РасчетАмортизации.ЕГДС КАК ЕГДС,
	|		РасчетАмортизации.ГруппаФинансовогоУчета,
	|		РасчетАмортизации.НаправлениеДеятельности,
	|		РасчетАмортизации.КорНаправлениеДеятельности,
	|		РасчетАмортизации.СтатьяРасходов КАК СтатьяРасходов,
	|		РасчетАмортизации.АналитикаРасходов КАК АналитикаРасходов,
	|		РасчетАмортизации.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|		РасчетАмортизации.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|		РасчетАмортизации.НачислятьИзнос КАК НачислятьИзнос,
	|		0 КАК РесурсВыработанныйЗаПрошлыйПериод,
	|		0 КАК РесурсВыработанныйЗаТекущийПериод,
	|		РасчетАмортизации.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериодБУ,
	|		РасчетАмортизации.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериодБУ,
	|		0 КАК СтоимостьДляВычисленияАмортизации,
	|		РасчетАмортизации.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизацииРегл,
	|		РасчетАмортизации.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|		0 КАК ОстатокОбесцененияУпр,
	|		ЛОЖЬ КАК ЭтоДоначисление,
	|		РасчетАмортизации.ЭтоДоначисление КАК ЭтоДоначислениеБУ,
	|		НЕОПРЕДЕЛЕНО КАК ПорядокУчетаУУ,
	|		РасчетАмортизации.ПорядокУчетаВНА КАК ПорядокУчетаБУ,
	|		НЕОПРЕДЕЛЕНО КАК ПорядокНачисленияАмортизацииУУ,
	|		РасчетАмортизации.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|		РасчетАмортизации.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|
	|		0 КАК СуммаУУ,
	|
	|		РасчетАмортизации.СуммаБУ КАК СуммаБУ,
	|		РасчетАмортизации.СуммаНУ КАК СуммаНУ,
	|
	|		РасчетАмортизации.СуммаПР 
	|		+ ВЫБОР 
	|			КОГДА РасчетАмортизации.НачислятьИзнос
	|				ТОГДА 0
	|			КОГДА (РасчетАмортизации.СуммаБУ
	|						- РасчетАмортизации.СуммаНУ 
	|						- РасчетАмортизации.СуммаПР) < &МинимальнаяСуммаВР
	|					И (РасчетАмортизации.СуммаБУ
	|						- РасчетАмортизации.СуммаНУ 
	|						- РасчетАмортизации.СуммаПР) > -&МинимальнаяСуммаВР
	|					И РасчетАмортизации.СуммаПР <> 0
	|				ТОГДА РасчетАмортизации.СуммаБУ
	|						- РасчетАмортизации.СуммаНУ 
	|						- РасчетАмортизации.СуммаПР
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаПР,
	|
	|		ВЫБОР 
	|			КОГДА РасчетАмортизации.НачислятьИзнос
	|				ТОГДА 0
	|			КОГДА (РасчетАмортизации.СуммаБУ
	|						- РасчетАмортизации.СуммаНУ 
	|						- РасчетАмортизации.СуммаПР) < &МинимальнаяСуммаВР
	|					И (РасчетАмортизации.СуммаБУ
	|						- РасчетАмортизации.СуммаНУ 
	|						- РасчетАмортизации.СуммаПР) > -&МинимальнаяСуммаВР
	|					И РасчетАмортизации.СуммаПР <> 0
	|				ТОГДА 0
	|			ИНАЧЕ РасчетАмортизации.СуммаБУ
	|					- РасчетАмортизации.СуммаНУ 
	|					- РасчетАмортизации.СуммаПР
	|		КОНЕЦ КАК СуммаВР,
	|
	|		РасчетАмортизации.СуммаЦФ КАК СуммаЦФ,
	|		РасчетАмортизации.СуммаНУЦФ КАК СуммаНУЦФ,
	|
	|		РасчетАмортизации.СуммаПРЦФ
	|		+ ВЫБОР 
	|			КОГДА РасчетАмортизации.НачислятьИзнос
	|				ТОГДА 0
	|			КОГДА (РасчетАмортизации.СуммаЦФ
	|						- РасчетАмортизации.СуммаНУЦФ 
	|						- РасчетАмортизации.СуммаПРЦФ) < &МинимальнаяСуммаВР
	|					И (РасчетАмортизации.СуммаЦФ
	|						- РасчетАмортизации.СуммаНУЦФ 
	|						- РасчетАмортизации.СуммаПРЦФ) > -&МинимальнаяСуммаВР
	|					И РасчетАмортизации.СуммаПРЦФ <> 0
	|				ТОГДА РасчетАмортизации.СуммаЦФ
	|					- РасчетАмортизации.СуммаНУЦФ 
	|					- РасчетАмортизации.СуммаПРЦФ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаПРЦФ,
	|
	|		ВЫБОР 
	|			КОГДА РасчетАмортизации.НачислятьИзнос
	|				ТОГДА 0
	|			КОГДА (РасчетАмортизации.СуммаЦФ
	|						- РасчетАмортизации.СуммаНУЦФ 
	|						- РасчетАмортизации.СуммаПРЦФ) < &МинимальнаяСуммаВР
	|					И (РасчетАмортизации.СуммаЦФ
	|						- РасчетАмортизации.СуммаНУЦФ 
	|						- РасчетАмортизации.СуммаПРЦФ) > -&МинимальнаяСуммаВР
	|					И РасчетАмортизации.СуммаПРЦФ <> 0
	|				ТОГДА 0
	|			ИНАЧЕ РасчетАмортизации.СуммаЦФ
	|					- РасчетАмортизации.СуммаНУЦФ 
	|					- РасчетАмортизации.СуммаПРЦФ
	|		КОНЕЦ КАК СуммаВРЦФ,
	|
	|		0 КАК ОбесценениеУУ,
	|		РасчетАмортизации.ОбесценениеБУ КАК ОбесценениеБУ,
	|		РасчетАмортизации.ОбесценениеЦФ КАК ОбесценениеЦФ
	|
	|	ИЗ
	|		РасчетАмортизации_БУ КАК РасчетАмортизации";
	
	СписокПодзапросов.Добавить(ТекстПодзапроса);
	
	//-- Локализация
	
КонецПроцедуры

// 
// Параметры:
//  ПараметрыРасчета - см. ВнеоборотныеАктивы.НовыеПараметрыРасчетаАмортизации
// 
// Возвращаемое значение:
//  Строка - Текст запроса
// 
Функция ТекстЗапросаКоличествоОбработанныхДанных(ПараметрыРасчета) Экспорт

	ТекстЗапроса = Неопределено;
	
	//++ Локализация
	
	ТекстЗапроса =  
	"ВЫБРАТЬ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РасчетАмортизации.ОсновноеСредство), 0) КАК КоличествоДанных
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетАмортизации.ОсновноеСредство КАК ОсновноеСредство
	|	ИЗ
	|		РасчетАмортизации_БУ КАК РасчетАмортизации
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетАмортизации.ОсновноеСредство
	|	ИЗ
	|		РасчетАмортизации_УУ КАК РасчетАмортизации) КАК РасчетАмортизации";
	
	//-- Локализация

	Возврат ТекстЗапроса;
	
КонецФункции

// 
// Возвращаемое значение:
//  Строка - Текст запроса
// 
Функция ТекстЗапросаВтНачисленнаяАмортизация() Экспорт

	ТекстЗапроса = Неопределено;
	
	//++ Локализация
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыВнеоборотныхАктивов.ОсновноеСредство) КАК ВидВНА,
	|	НачисленнаяАмортизация.ПериодРасчета,
	|	НачисленнаяАмортизация.Организация,
	|	ЕСТЬNULL(ПакетыАмортизацииОС.НомерПакета, 0) КАК НомерПакета,
	|	НачисленнаяАмортизация.Подразделение,
	|	НачисленнаяАмортизация.КорПодразделение,
	|	НачисленнаяАмортизация.ОсновноеСредство,
	|	НачисленнаяАмортизация.ГруппаФинансовогоУчета,
	|	НачисленнаяАмортизация.НаправлениеДеятельности,
	|	НачисленнаяАмортизация.КорНаправлениеДеятельности,
	|	НачисленнаяАмортизация.СтатьяРасходов,
	|	НачисленнаяАмортизация.АналитикаРасходов,
	|	НачисленнаяАмортизация.ПередаватьРасходыВДругуюОрганизацию,
	|	НачисленнаяАмортизация.ОрганизацияПолучательРасходов,
	|	НачисленнаяАмортизация.НачислятьИзнос,
	|	НачисленнаяАмортизация.ЭтоДоначисление,
	|	НачисленнаяАмортизация.ЭтоДоначислениеБУ,
	|	НачисленнаяАмортизация.ЕГДС КАК ЕГДС,
	|
	|	&ИдентификаторСтрокиТаблицы КАК ИдентификаторСтроки,
	|
	|	МАКСИМУМ(НачисленнаяАмортизация.РесурсВыработанныйЗаПрошлыйПериод) КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	МАКСИМУМ(НачисленнаяАмортизация.РесурсВыработанныйЗаТекущийПериод) КАК РесурсВыработанныйЗаТекущийПериод,
	|	МАКСИМУМ(НачисленнаяАмортизация.РесурсВыработанныйЗаПрошлыйПериодБУ) КАК РесурсВыработанныйЗаПрошлыйПериодБУ,
	|	МАКСИМУМ(НачисленнаяАмортизация.РесурсВыработанныйЗаТекущийПериодБУ) КАК РесурсВыработанныйЗаТекущийПериодБУ,
	|	МАКСИМУМ(НачисленнаяАмортизация.СтоимостьДляВычисленияАмортизации) КАК СтоимостьДляВычисленияАмортизации,
	|	МАКСИМУМ(НачисленнаяАмортизация.СтоимостьДляВычисленияАмортизацииРегл) КАК СтоимостьДляВычисленияАмортизацииРегл,
	|	МАКСИМУМ(НачисленнаяАмортизация.ОстатокОбесцененияРегл) КАК ОстатокОбесцененияРегл,
	|	МАКСИМУМ(НачисленнаяАмортизация.ОстатокОбесцененияУпр) КАК ОстатокОбесцененияУпр,
	|	МАКСИМУМ(НачисленнаяАмортизация.ПорядокУчетаУУ) КАК ПорядокУчетаУУ,
	|	МАКСИМУМ(НачисленнаяАмортизация.ПорядокУчетаБУ) КАК ПорядокУчетаБУ,
	|	МАКСИМУМ(НачисленнаяАмортизация.ПорядокНачисленияАмортизацииУУ) КАК ПорядокНачисленияАмортизацииУУ,
	|	МАКСИМУМ(НачисленнаяАмортизация.ПорядокНачисленияАмортизацииБУ) КАК ПорядокНачисленияАмортизацииБУ,
	|	МАКСИМУМ(НачисленнаяАмортизация.ВариантПроводокПоОбесценениюВНА) КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	СУММА(НачисленнаяАмортизация.СуммаУУ) КАК СуммаУУ,
	|	СУММА(НачисленнаяАмортизация.СуммаБУ) КАК СуммаБУ,
	|	СУММА(НачисленнаяАмортизация.СуммаНУ) КАК СуммаНУ,
	|	СУММА(НачисленнаяАмортизация.СуммаПР) КАК СуммаПР,
	|	СУММА(НачисленнаяАмортизация.СуммаВР) КАК СуммаВР,
	|	СУММА(НачисленнаяАмортизация.СуммаЦФ) КАК СуммаЦФ,
	|	СУММА(НачисленнаяАмортизация.СуммаНУЦФ) КАК СуммаНУЦФ,
	|	СУММА(НачисленнаяАмортизация.СуммаПРЦФ) КАК СуммаПРЦФ,
	|	СУММА(НачисленнаяАмортизация.СуммаВРЦФ) КАК СуммаВРЦФ,
	|
	|	СУММА(НачисленнаяАмортизация.ОбесценениеУУ) КАК ОбесценениеУУ,
	|	СУММА(НачисленнаяАмортизация.ОбесценениеБУ) КАК ОбесценениеБУ,
	|	СУММА(НачисленнаяАмортизация.ОбесценениеЦФ) КАК ОбесценениеЦФ
	|
	|ПОМЕСТИТЬ НачисленнаяАмортизация
	|ИЗ
	|	&ТекстПодзапроса КАК НачисленнаяАмортизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПакетыАмортизацииОС КАК ПакетыАмортизацииОС
	|		ПО ПакетыАмортизацииОС.Организация = НачисленнаяАмортизация.Организация
	|			И ПакетыАмортизацииОС.ОсновноеСредство = НачисленнаяАмортизация.ОсновноеСредство
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленнаяАмортизация.ПериодРасчета,
	|	НачисленнаяАмортизация.Организация,
	|	НачисленнаяАмортизация.ЕГДС,
	|	ЕСТЬNULL(ПакетыАмортизацииОС.НомерПакета, 0),
	|	НачисленнаяАмортизация.Подразделение,
	|	НачисленнаяАмортизация.КорПодразделение,
	|	НачисленнаяАмортизация.ГруппаФинансовогоУчета,
	|	НачисленнаяАмортизация.НаправлениеДеятельности,
	|	НачисленнаяАмортизация.КорНаправлениеДеятельности,
	|	НачисленнаяАмортизация.ОсновноеСредство,
	|	НачисленнаяАмортизация.СтатьяРасходов,
	|	НачисленнаяАмортизация.АналитикаРасходов,
	|	НачисленнаяАмортизация.ПередаватьРасходыВДругуюОрганизацию,
	|	НачисленнаяАмортизация.ОрганизацияПолучательРасходов,
	|	НачисленнаяАмортизация.НачислятьИзнос,
	|	НачисленнаяАмортизация.ЭтоДоначисление,
	|	НачисленнаяАмортизация.ЭтоДоначислениеБУ,
	|	&ГруппировкаИдентификатора";
	
	//-- Локализация
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура УвеличитьСтоимостьИАмортизациюПриРазукомплектацииИОбъединении(ДанныеСтроки, СтрокаИсходноеОС) Экспорт
	
	//++ Локализация
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеСтроки, "ОстаточнаяСтоимостьПР") Тогда
		ДанныеСтроки.ОстаточнаяСтоимостьПР = СтрокаИсходноеОС.СтоимостьСписанияПР;
		ДанныеСтроки.СтоимостьДляВычисленияПР = СтрокаИсходноеОС.СтоимостьСписанияПР;
	КонецЕсли;
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

//++ Локализация

Функция ТекстЗапросаТаблицаСтоимостьОС(Запрос, ТекстыЗапроса, Регистры)

	ИмяРегистра = "СтоимостьОС";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&Период                                             КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)              КАК ВидДвижения,
	|	АмортизационнаяПремия.Организация                   КАК Организация,
	|	АмортизационнаяПремия.Подразделение                 КАК Подразделение,
	|	АмортизационнаяПремия.ОсновноеСредство              КАК ОсновноеСредство,
	|	АмортизационнаяПремия.НаправлениеДеятельности       КАК НаправлениеДеятельности,
	|	АмортизационнаяПремия.ГруппаФинансовогоУчета        КАК ГруппаФинансовогоУчета,
	|	АмортизационнаяПремия.Арендатор                     КАК Арендатор,
	|
	|	АмортизационнаяПремия.Сумма                         КАК СтоимостьНУ,
	|	-АмортизационнаяПремия.Сумма                        КАК СтоимостьВР,
	|	АмортизационнаяПремия.Сумма                         КАК АмортизационнаяПремия,
	|
	|	АмортизационнаяПремия.ОрганизацияПолучательРасходов КАК КорОрганизация,
	|	АмортизационнаяПремия.КорПодразделение              КАК КорПодразделение,
	|	АмортизационнаяПремия.КорНаправлениеДеятельности    КАК КорНаправлениеДеятельности,
	|	АмортизационнаяПремия.СтатьяРасходов                КАК КорСтатьяРасходов,
	|	АмортизационнаяПремия.АналитикаРасходов             КАК КорАналитикаРасходов,
	|	
	|	АмортизационнаяПремия.ИдентификаторСтроки           КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВключениеАмортизационнойПремииВРасходы) КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВключениеАмортизационнойПремииВРасходы) КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	АмортизационнаяПремия КАК АмортизационнаяПремия
	|ГДЕ
	|	АмортизационнаяПремия.Организация = &Организация
	|	И АмортизационнаяПремия.НомерПакета = &НомерПакета";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаПорядокОтраженияПрочихОпераций(Запрос, ТекстыЗапроса, Регистры)

	ИмяРегистра = "ПорядокОтраженияПрочихОпераций";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	&Период КАК Дата,
	|	&Организация КАК Организация,
	|	&Ссылка КАК Документ,
	|	"""" КАК ИдентификаторСтроки
	|ИЗ
	|	ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиПрочихОпераций
	|ГДЕ
	|	СтатьиПрочихОпераций.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|	И СтатьиПрочихОпераций.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
	|	И СтатьиПрочихОпераций.Ссылка В
	|			(ВЫБРАТЬ
	|				Т.СтатьяРасходов
	|			ИЗ
	|				НачисленнаяАмортизация КАК Т
	|			ГДЕ
	|				Т.Организация = &Организация
	|				И Т.НомерПакета = &НомерПакета)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

//-- Локализация

#КонецОбласти

//++ Локализация

#Область РасчетАмортизации

Процедура ДоначислитьАмортизациюБУЗаПрошлыйМесяц(ПараметрыРасчета)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	ВнеоборотныеАктивы.УстановитьПараметрыЗапросаДляРасчетаАмортизации(Запрос, ПараметрыРасчета);

	// Расчет за прошлый месяц до изменения параметров.
	// И получение данных для расчета с учетом изменения параметров.
	СписокЗапросов = Новый Массив;
	
	ТекстЗапросаДоначислениеАмортизацииБезИзмененийБУ(СписокЗапросов, ПараметрыРасчета);
	ТекстЗапросаДоначислениеАмортизацииВыборкаИзмененийБУ(СписокЗапросов, ПараметрыРасчета);
	
	Запрос.Текст = СтрСоединить(СписокЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВПакете());
	РезультатЗапроса = Запрос.Выполнить();
	
	АмортизацияИзменений = Документы.АмортизацияОС2_4.РассчитатьАмортизациюПриИзмененииПараметров(РезультатЗапроса, Неопределено);
	
	// Объединение всех расчетов
	СписокЗапросов = Новый Массив;
	
	ТекстЗапросаДоначислениеАмортизацииБУ(СписокЗапросов, ПараметрыРасчета);
	ТекстЗапросаДоначислениеАмортизацииБУ_Сгруппированная(СписокЗапросов, ПараметрыРасчета);
	
	Запрос.Текст = СтрСоединить(СписокЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВПакете());
	Запрос.УстановитьПараметр("АмортизацияИзменений_БУ", АмортизацияИзменений);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
КонецПроцедуры

Процедура РассчитатьАмортизациюБУЗаТекущийМесяц(ПараметрыРасчета)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	ВнеоборотныеАктивы.УстановитьПараметрыЗапросаДляРасчетаАмортизации(Запрос, ПараметрыРасчета);

	// Расчет за текущий месяц до изменения параметров
	// И получение данных для расчета с учетом изменения параметров
	СписокЗапросов = Новый Массив;
	
	ТекстЗапросаРасчетАмортизацииБезИзмененийБУ(СписокЗапросов, ПараметрыРасчета);
	ТекстЗапросаРасчетАмортизацииВыборкаИзмененийБУ(СписокЗапросов, ПараметрыРасчета);
	
	Запрос.Текст = СтрСоединить(СписокЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВПакете());
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	АмортизацияИзменений = Документы.АмортизацияОС2_4.РассчитатьАмортизациюПриИзмененииПараметров(
								РезультатЗапроса[РезультатЗапроса.ВГраница()], 
								РезультатЗапроса[РезультатЗапроса.ВГраница()-1].Выгрузить());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокОС.Период КАК ПериодРасчета,
	|	СписокОС.Организация КАК Организация,
	|	СписокОС.Подразделение КАК Подразделение,
	|	СписокОС.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СписокОС.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СписокОС.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокОС.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокОС.СпособОтраженияРасходов КАК СпособОтраженияРасходов,
	|	СписокОС.СуммаБУ КАК СуммаБУ,
	|	СписокОС.ОбесценениеБУ КАК ОбесценениеБУ,
	|	СписокОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокОС.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокОС.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	СписокОС.РесурсНазначенный КАК РесурсНазначенный,
	|	СписокОС.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизации,
	|	СписокОС.СтоимостьДляВычисленияПР КАК СтоимостьДляВычисленияПР,
	|
	|	ВЫБОР
	|		КОГДА СписокОС.ПолученПриРазукомплектацииОбъединении
	|			ТОГДА СписокОС.СтоимостьРегл
	|		ИНАЧЕ СписокОС.СтоимостьДляВычисленияАмортизацииРегл 
	|	КОНЕЦ КАК ОстаточнаяСтоимостьРегл,
	|
	|	ВЫБОР
	|		КОГДА СписокОС.ПолученПриРазукомплектацииОбъединении
	|			ТОГДА СписокОС.СтоимостьРегл * СписокОС.КоэффициентЦФБУ
	|		ИНАЧЕ СписокОС.СтоимостьДляВычисленияАмортизацииРегл * СписокОС.КоэффициентЦФБУ
	|	КОНЕЦ КАК ОстаточнаяСтоимостьЦФ,                       
	|
	|	СписокОС.ОстаточнаяСтоимостьПР КАК ОстаточнаяСтоимостьПР,
	|	СписокОС.ОстаточнаяСтоимостьПР * СписокОС.КоэффициентЦФБУ КАК ОстаточнаяСтоимостьПРЦФ, 
	|                      
	|	СписокОС.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|
	|	ВЫБОР
	|		КОГДА СписокОС.ПолученПриРазукомплектацииОбъединении
	|			ТОГДА СписокОС.СтоимостьДляВычисленияПР
	|		ИНАЧЕ СписокОС.ПРДляВычисленияАмортизации
	|	КОНЕЦ КАК ПРДляВычисленияАмортизации,
	|
	|	СписокОС.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|	СписокОС.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|	СписокОС.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|	СписокОС.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|	СписокОС.КоэффициентЦФПР КАК КоэффициентЦФПР
	|
	|ПОМЕСТИТЬ РасчетАмортизацииСУчетомИзмененийБУ
	|
	|ИЗ
	|	&АмортизацияИзменений_БУ КАК СписокОС
	|
	|ГДЕ
	|	СписокОС.ЭтоИзменения";

	Запрос.УстановитьПараметр("АмортизацияИзменений_БУ", АмортизацияИзменений);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ТекстЗапросаДоначислениеАмортизацииБезИзмененийБУ(СписокЗапросов, ПараметрыРасчета)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СписокОС.Период КАК Период,
	|	СписокОС.Организация КАК Организация,
	|	СписокОС.Подразделение КАК Подразделение,
	|	СписокОС.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СписокОС.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СписокОС.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокОС.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокОС.СпособОтраженияРасходов КАК СпособОтраженияРасходов,
	|	СписокОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокОС.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокОС.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	СписокОС.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	СписокОС.СтоимостьДляВычисленияПР КАК СтоимостьДляВычисленияПР,
	|	СписокОС.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации,
	|	СписокОС.ОстаточнаяСтоимостьРегл КАК ОстаточнаяСтоимостьРегл,
	|	СписокОС.ОстаточнаяСтоимостьЦФ КАК ОстаточнаяСтоимостьЦФ,
	|	СписокОС.ОстаточнаяСтоимостьПР КАК ОстаточнаяСтоимостьПР,
	|	СписокОС.ОстаточнаяСтоимостьПРЦФ КАК ОстаточнаяСтоимостьПРЦФ, 
	|	СписокОС.РесурсНазначенный КАК РесурсНазначенный,
	|	СписокОС.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизацииБУ,
	|	СписокОС.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
	|	СписокОС.КоэффициентУскоренияБУ КАК КоэффициентУскоренияБУ,
	|	СписокОС.ОтработанныхМесяцевПолныхЛет КАК ОтработанныхМесяцевПолныхЛет,
	|	СписокОС.НачислятьАмортизациюБУ КАК НачислятьАмортизациюБУ,
	|	СписокОС.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|	СписокОС.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|	СписокОС.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|	СписокОС.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|	СписокОС.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|	СписокОС.КоэффициентЦФПР КАК КоэффициентЦФПР,
	|
	|	&СуммаАмортизацииБУ КАК СуммаБУ
	|
	|ПОМЕСТИТЬ ДоначислениеАмортизацииБезИзмененийБУ
	|
	|ИЗ
	|	СписокОССПараметрами_БУ КАК СписокОС
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПроверкаПараметровРасчета_БУ КАК ПроверкаПараметровРасчета
	|	ПО ПроверкаПараметровРасчета.ОбъектУчета = СписокОС.ОсновноеСредство
	|		И ПроверкаПараметровРасчета.Организация = СписокОС.Организация
	|ГДЕ
	|	СписокОС.ЭтоДоначисление
	|	И ПроверкаПараметровРасчета.ОбъектУчета ЕСТЬ NULL";
	
	ПараметрыТекстаЗапроса = ПараметрыТекстаЗапросаСуммаАмортизацииБУ();
	ПараметрыТекстаЗапроса.ТекстСтоимостьДляВычисленияАмортизации = "СписокОС.СтоимостьДляВычисленияАмортизации";
	ПараметрыТекстаЗапроса.ТекстОстаточнаяСтоимость = "СписокОС.ОстаточнаяСтоимостьРегл";
	ПараметрыТекстаЗапроса.ТекстЛиквидационнаяСтоимость = "0";
	ПараметрыТекстаЗапроса.ТекстСтоимостьНаНачалоГода = "СписокОС.СтоимостьРеглНаНачалоГода";
	ПараметрыТекстаЗапроса.ТекстОбесценение = "0";
	ПараметрыТекстаЗапроса.ТекстСуммаДоначисления = "0";
	ТекстСуммаАмортизацииБУ = ТекстЗапросаСуммаАмортизацииБУ(ПараметрыТекстаЗапроса);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаАмортизацииБУ", ТекстСуммаАмортизацииБУ);
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаДоначислениеАмортизацииВыборкаИзмененийБУ(СписокЗапросов, ПараметрыРасчета)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	1 КАК Приоритет,
	|	&НачалоМесяца КАК Период,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	СписокОС.Организация КАК Организация,
	|	СписокОС.Подразделение КАК Подразделение,
	|	СписокОС.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СписокОС.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СписокОС.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокОС.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокОС.СпособОтраженияРасходов КАК СпособОтраженияРасходов,
	|	СписокОС.СуммаБУ КАК СуммаБУ,
	|	0 КАК СуммаУУ,
	|	0 КАК ОбесценениеУУ,
	|	0 КАК ОбесценениеБУ,
	|	1 КАК Коэффициент,
	|	СписокОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокОС.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокОС.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	СписокОС.РесурсНазначенный КАК РесурсНазначенный,
	|	СписокОС.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизации,
	|
	|	0 КАК ЛиквидационнаяСтоимость,
	|	СписокОС.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимостьРегл,
	|
	|	СписокОС.ОстаточнаяСтоимостьРегл КАК ОстаточнаяСтоимостьРегл,
	|	СписокОС.ОстаточнаяСтоимостьЦФ КАК ОстаточнаяСтоимостьЦФ,
	|	СписокОС.ОстаточнаяСтоимостьПР КАК ОстаточнаяСтоимостьПР,
	|	СписокОС.ОстаточнаяСтоимостьПРЦФ КАК ОстаточнаяСтоимостьПРЦФ, 
	|	0 КАК ОстатокОбесцененияРегл,
	|	0 КАК ОстатокОбесцененияУпр,
	|
	|	СписокОС.КоэффициентУскоренияБУ КАК КоэффициентУскорения,
	|	СписокОС.ОтработанныхМесяцевПолныхЛет КАК ОтработанныхМесяцевПолныхЛет,
	|	СписокОС.НачислятьАмортизациюБУ КАК НачислятьАмортизацию,
	|	ЛОЖЬ КАК ПолученПриРазукомплектацииОбъединении,
	|
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьРегл,
	|
	|	0 КАК СтоимостьИзменение,
	|	0 КАК СтоимостьРеглИзменение,
	|
	|	0 КАК АмортизацияИзменение,
	|	0 КАК АмортизацияРеглИзменение,
	|
	|	0 КАК Амортизация,
	|	0 КАК АмортизацияРегл,
	|
	|	0 КАК СтоимостьДляВычисленияАмортизации,
	|	0 КАК СтоимостьДляВычисленияАмортизацииРегл,
	|	0 КАК СтоимостьДляВычисленияПР,
	|
	|	0 КАК ПРДляВычисленияАмортизации, 
	|	СписокОС.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|	СписокОС.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|	СписокОС.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|	СписокОС.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|	СписокОС.КоэффициентЦФПР КАК КоэффициентЦФПР,
	|	СписокОС.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|	ЛОЖЬ КАК ЭтоИзменения
	|ИЗ
	|	ДоначислениеАмортизацииБезИзмененийБУ КАК СписокОС
	|ГДЕ
	|	СписокОС.ОсновноеСредство В
	|		(ВЫБРАТЬ
	|			СписокОС.ОсновноеСредство
	|		ИЗ
	|			СписокОССИзмененнымиПараметрами_БУ КАК СписокОС)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 КАК Приоритет,
	|	СписокОС.Период КАК Период,
	|	СписокОС.Регистратор КАК Регистратор,
	|	СписокОС.Организация КАК Организация,
	|	СписокОС.Подразделение КАК Подразделение,
	|	СписокОС.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СписокОС.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СписокОС.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокОС.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокОС.СпособОтраженияРасходов КАК СпособОтраженияРасходов,
	|	0 КАК СуммаБУ,
	|	0 КАК СуммаУУ,
	|	0 КАК ОбесценениеУУ,
	|	0 КАК ОбесценениеБУ,
	|	1 КАК Коэффициент,
	|	СписокОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокОС.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокОС.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	СписокОС.РесурсНазначенный КАК РесурсНазначенный,
	|	СписокОС.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизации,
	|
	|	0 КАК ЛиквидационнаяСтоимость,
	|	СписокОС.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимостьРегл,
	|
	|	СписокОС.ОстаточнаяСтоимостьРегл КАК ОстаточнаяСтоимостьРегл,
	|	СписокОС.ОстаточнаяСтоимостьЦФ КАК ОстаточнаяСтоимостьЦФ,
	|	СписокОС.ОстаточнаяСтоимостьПР КАК ОстаточнаяСтоимостьПР,
	|	СписокОС.ОстаточнаяСтоимостьПРЦФ КАК ОстаточнаяСтоимостьПРЦФ, 
	|	0 КАК ОстатокОбесцененияРегл,
	|	0 КАК ОстатокОбесцененияУпр,
	|
	|	СписокОС.КоэффициентУскоренияБУ КАК КоэффициентУскорения,
	|	СписокОС.ОтработанныхМесяцевПолныхЛет КАК ОтработанныхМесяцевПолныхЛет,
	|	СписокОС.НачислятьАмортизациюБУ КАК НачислятьАмортизацию,
	|	ЛОЖЬ КАК ПолученПриРазукомплектацииОбъединении,
	|
	|	0 КАК Стоимость,
	|	СписокОС.СтоимостьРегл КАК СтоимостьРегл,
	|
	|	0 КАК СтоимостьИзменение,
	|	СписокОС.СтоимостьРеглИзменение КАК СтоимостьРеглИзменение,
	|
	|	0 КАК АмортизацияИзменение,
	|	СписокОС.АмортизацияРеглИзменение КАК АмортизацияРеглИзменение,
	|
	|	0 КАК Амортизация,
	|	СписокОС.АмортизацияРегл КАК АмортизацияРегл,
	|
	|	0 КАК СтоимостьДляВычисленияАмортизации,
	|	0 КАК СтоимостьДляВычисленияАмортизацииРегл,
	|	0 КАК СтоимостьДляВычисленияПР,
	|
	|	СписокОС.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации, 
	|	СписокОС.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|	СписокОС.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|	СписокОС.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|	СписокОС.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|	СписокОС.КоэффициентЦФПР КАК КоэффициентЦФПР,
	|	СписокОС.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|	ИСТИНА КАК ЭтоИзменения
	|ИЗ
	|	СписокОССИзмененнымиПараметрами_БУ КАК СписокОС
	|ГДЕ
	|	СписокОС.ЭтоДоначисление";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаДоначислениеАмортизацииБУ(СписокЗапросов, ПараметрыРасчета)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СписокОС.Период КАК Период,
	|	СписокОС.Организация КАК Организация,
	|	СписокОС.Подразделение КАК Подразделение,
	|	СписокОС.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СписокОС.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СписокОС.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокОС.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокОС.СпособОтраженияРасходов КАК СпособОтраженияРасходов,
	|	СписокОС.СуммаБУ КАК СуммаБУ,
	|	СписокОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокОС.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокОС.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	СписокОС.РесурсНазначенный КАК РесурсНазначенный,
	|	СписокОС.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизации,
	|	СписокОС.СтоимостьДляВычисленияПР КАК СтоимостьДляВычисленияПР,
	|	СписокОС.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации,
	|	СписокОС.ОстаточнаяСтоимостьРегл КАК ОстаточнаяСтоимостьРегл,
	|	СписокОС.ОстаточнаяСтоимостьЦФ КАК ОстаточнаяСтоимостьЦФ,
	|	СписокОС.ОстаточнаяСтоимостьПР КАК ОстаточнаяСтоимостьПР,
	|	СписокОС.ОстаточнаяСтоимостьПРЦФ КАК ОстаточнаяСтоимостьПРЦФ, 
	|	СписокОС.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|	СписокОС.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|	СписокОС.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|	СписокОС.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|	СписокОС.КоэффициентЦФПР КАК КоэффициентЦФПР
	|
	|ПОМЕСТИТЬ ДоначислениеАмортизацииСУчетомИзмененийБУ
	|
	|ИЗ
	|	&АмортизацияИзменений_БУ КАК СписокОС
	|ГДЕ
	|	СписокОС.ЭтоИзменения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокОС.Период КАК ПериодРасчета,
	|	СписокОС.Организация КАК Организация,
	|	СписокОС.Подразделение КАК Подразделение,
	|	СписокОС.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СписокОС.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СписокОС.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокОС.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокОС.СпособОтраженияРасходов КАК СпособОтраженияРасходов,
	|	СписокОС.СуммаБУ КАК СуммаБУ,
	|	СписокОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокОС.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокОС.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	СписокОС.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	СписокОС.СтоимостьДляВычисленияПР КАК СтоимостьДляВычисленияПР,
	|	СписокОС.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации,
	|	СписокОС.ОстаточнаяСтоимостьРегл КАК ОстаточнаяСтоимостьРегл,
	|	СписокОС.ОстаточнаяСтоимостьЦФ КАК ОстаточнаяСтоимостьЦФ,
	|	СписокОС.ОстаточнаяСтоимостьПР КАК ОстаточнаяСтоимостьПР,
	|	СписокОС.ОстаточнаяСтоимостьПРЦФ КАК ОстаточнаяСтоимостьПРЦФ, 
	|	СписокОС.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|	СписокОС.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|	СписокОС.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|	СписокОС.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|	СписокОС.КоэффициентЦФПР КАК КоэффициентЦФПР
	|
	|ПОМЕСТИТЬ ДоначислениеАмортизацииБУ
	|
	|ИЗ
	|	ДоначислениеАмортизацииБезИзмененийБУ КАК СписокОС
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	СписокОС.Период,
	|	СписокОС.Организация,
	|	СписокОС.Подразделение,
	|	СписокОС.ГруппаФинансовогоУчета,
	|	СписокОС.НаправлениеДеятельности,
	|	СписокОС.ОсновноеСредство,
	|	СписокОС.СтатьяРасходов,
	|	СписокОС.АналитикаРасходов,
	|	СписокОС.СпособОтраженияРасходов,
	|	СписокОС.СуммаБУ,
	|	СписокОС.ПередаватьРасходыВДругуюОрганизацию,
	|	СписокОС.ОрганизацияПолучательРасходов,
	|	СписокОС.РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокОС.РесурсВыработанныйЗаТекущийПериод,
	|	СписокОС.СтоимостьДляВычисленияАмортизации,
	|	СписокОС.СтоимостьДляВычисленияПР,
	|	СписокОС.ПРДляВычисленияАмортизации,
	|	СписокОС.ОстаточнаяСтоимостьРегл КАК ОстаточнаяСтоимостьРегл,
	|	СписокОС.ОстаточнаяСтоимостьЦФ КАК ОстаточнаяСтоимостьЦФ,
	|	СписокОС.ОстаточнаяСтоимостьПР КАК ОстаточнаяСтоимостьПР,
	|	СписокОС.ОстаточнаяСтоимостьПРЦФ КАК ОстаточнаяСтоимостьПРЦФ, 
	|	СписокОС.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|	СписокОС.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|	СписокОС.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|	СписокОС.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|	СписокОС.КоэффициентЦФПР КАК КоэффициентЦФПР
	|ИЗ
	|	ДоначислениеАмортизацииСУчетомИзмененийБУ КАК СписокОС";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаДоначислениеАмортизацииБУ_Сгруппированная(СписокЗапросов, ПараметрыРасчета)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СУММА(СписокОС.СуммаБУ) КАК СуммаБУ
	|ПОМЕСТИТЬ ДоначислениеАмортизацииБУ_Сгруппированная
	|ИЗ
	|	ДоначислениеАмортизацииБУ КАК СписокОС
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокОС.ОсновноеСредство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаРасчетАмортизацииБезИзмененийБУ(СписокЗапросов, ПараметрыРасчета)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СписокОС.ПериодРасчета КАК ПериодРасчета,
	|	СписокОС.Организация КАК Организация,
	|	СписокОС.Подразделение КАК Подразделение,
	|	СписокОС.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СписокОС.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СписокОС.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокОС.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокОС.СпособОтраженияРасходов КАК СпособОтраженияРасходов,
	|	СписокОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокОС.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокОС.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	СписокОС.РесурсНазначенный КАК РесурсНазначенный,
	|	СписокОС.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизацииБУ,
	|	СписокОС.СтоимостьРегл КАК СтоимостьРегл,
	|	СписокОС.АмортизацияРегл КАК АмортизацияРегл,
	|	СписокОС.ОстаточнаяСтоимостьРегл КАК ОстаточнаяСтоимостьРегл,
	|	СписокОС.ОстаточнаяСтоимостьЦФ КАК ОстаточнаяСтоимостьЦФ,
	|	СписокОС.ОстаточнаяСтоимостьПР КАК ОстаточнаяСтоимостьПР,
	|	СписокОС.ОстаточнаяСтоимостьПРЦФ КАК ОстаточнаяСтоимостьПРЦФ, 
	|	СписокОС.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	СписокОС.СтоимостьДляВычисленияПР КАК СтоимостьДляВычисленияПР,
	|	СписокОС.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации,
	|	СписокОС.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
	|	СписокОС.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|	СписокОС.КоэффициентУскоренияБУ КАК КоэффициентУскоренияБУ,
	|	СписокОС.ОтработанныхМесяцевПолныхЛет КАК ОтработанныхМесяцевПолныхЛет,
	|	СписокОС.НачислятьАмортизациюБУ КАК НачислятьАмортизациюБУ,
	|	СписокОС.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|	СписокОС.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|	СписокОС.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|	СписокОС.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|	СписокОС.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|	СписокОС.КоэффициентЦФПР КАК КоэффициентЦФПР,
	|
	|	ВЫБОР 
	|		КОГДА (СписокОС.ОстатокОбесцененияРегл - СписокОС.ОбесценениеБУ) < &МинимальнаяОстаточнаяСтоимостьРегл
	|				И СписокОС.ОбесценениеБУ > 0
	|			ТОГДА СписокОС.ОстатокОбесцененияРегл
	|		ИНАЧЕ СписокОС.ОбесценениеБУ
	|	КОНЕЦ КАК ОбесценениеБУ,
	|
	|	ВЫБОР 
	|		КОГДА (СписокОС.ОстаточнаяСтоимостьРегл - СписокОС.ЛиквидационнаяСтоимость - СписокОС.СуммаБУ) < &МинимальнаяОстаточнаяСтоимостьРегл
	|				И СписокОС.СуммаБУ > 0
	|			ТОГДА СписокОС.ОстаточнаяСтоимостьРегл - СписокОС.ЛиквидационнаяСтоимость
	|		ИНАЧЕ СписокОС.СуммаБУ
	|	КОНЕЦ КАК СуммаБУ
	|
	|ПОМЕСТИТЬ РасчетАмортизацииБезИзмененийБУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокОС.Период КАК ПериодРасчета,
	|		СписокОС.Организация КАК Организация,
	|		СписокОС.Подразделение КАК Подразделение,
	|		СписокОС.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|		СписокОС.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|		СписокОС.СтатьяРасходов КАК СтатьяРасходов,
	|		СписокОС.АналитикаРасходов КАК АналитикаРасходов,
	|		СписокОС.СпособОтраженияРасходов КАК СпособОтраженияРасходов,
	|		СписокОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|		СписокОС.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|		СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|		СписокОС.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|		СписокОС.РесурсНазначенный КАК РесурсНазначенный,
	|		СписокОС.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизацииБУ,
	|		СписокОС.СтоимостьРегл КАК СтоимостьРегл,
	|		СписокОС.АмортизацияРегл КАК АмортизацияРегл,
	|		СписокОС.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0) КАК ОстаточнаяСтоимостьРегл,
	|		СписокОС.ОстаточнаяСтоимостьЦФ КАК ОстаточнаяСтоимостьЦФ,
	|		СписокОС.ОстаточнаяСтоимостьПР КАК ОстаточнаяСтоимостьПР,
	|		СписокОС.ОстаточнаяСтоимостьПРЦФ КАК ОстаточнаяСтоимостьПРЦФ, 
	|		СписокОС.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|
	|		ВЫБОР
	|			КОГДА СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|				ТОГДА СписокОС.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0)
	|			ИНАЧЕ СписокОС.СтоимостьДляВычисленияАмортизации
	|		КОНЕЦ КАК СтоимостьДляВычисленияАмортизации,
	|
	|		СписокОС.СтоимостьДляВычисленияПР КАК СтоимостьДляВычисленияПР,
	|		СписокОС.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации,
	|		СписокОС.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
	|		СписокОС.КоэффициентУскоренияБУ КАК КоэффициентУскоренияБУ,
	|		СписокОС.ОтработанныхМесяцевПолныхЛет КАК ОтработанныхМесяцевПолныхЛет,
	|		СписокОС.НачислятьАмортизациюБУ КАК НачислятьАмортизациюБУ,
	|		СписокОС.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|		СписокОС.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|		СписокОС.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|		СписокОС.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|		СписокОС.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|		СписокОС.КоэффициентЦФПР КАК КоэффициентЦФПР,
	|
	|		ВЫБОР
	|			КОГДА &ОбесценениеБУ > СписокОС.ОстатокОбесцененияРегл
	|				ТОГДА СписокОС.ОстатокОбесцененияРегл
	|			ИНАЧЕ &ОбесценениеБУ
	|		КОНЕЦ КАК ОбесценениеБУ,
	|
	|		ВЫБОР 
	|			КОГДА (СписокОС.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0) - (&СуммаАмортизацииБУ)) > СписокОС.ЛиквидационнаяСтоимость
	|				ТОГДА &СуммаАмортизацииБУ
	|			КОГДА (СписокОС.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0) - СписокОС.ЛиквидационнаяСтоимость) > 0
	|				ТОГДА (СписокОС.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0) - СписокОС.ЛиквидационнаяСтоимость)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаБУ
	|	ИЗ
	|		СписокОССПараметрами_БУ КАК СписокОС
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ ДоначислениеАмортизацииБУ_Сгруппированная КАК Доначисление
	|			ПО Доначисление.ОсновноеСредство = СписокОС.ОсновноеСредство
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПроверкаПараметровРасчета_БУ КАК ПроверкаПараметровРасчета
	|			ПО ПроверкаПараметровРасчета.ОбъектУчета = СписокОС.ОсновноеСредство
	|				И ПроверкаПараметровРасчета.Организация = СписокОС.Организация
	|	ГДЕ
	|		НЕ СписокОС.ЭтоДоначисление
	|		И ПроверкаПараметровРасчета.ОбъектУчета ЕСТЬ NULL
	|
	|	) КАК СписокОС";
	
	ПараметрыТекстаЗапроса = ПараметрыТекстаЗапросаСуммаАмортизацииБУ();
	ПараметрыТекстаЗапроса.ТекстСтоимостьДляВычисленияАмортизации = "СписокОС.СтоимостьДляВычисленияАмортизации";
	ПараметрыТекстаЗапроса.ТекстОстаточнаяСтоимость = "СписокОС.ОстаточнаяСтоимостьРегл";
	ПараметрыТекстаЗапроса.ТекстЛиквидационнаяСтоимость = "СписокОС.ЛиквидационнаяСтоимость";
	ПараметрыТекстаЗапроса.ТекстСтоимостьНаНачалоГода = "СписокОС.СтоимостьРеглНаНачалоГода";
	ПараметрыТекстаЗапроса.ТекстОбесценение = "СписокОС.ОстатокОбесцененияРегл";
	ПараметрыТекстаЗапроса.ТекстСуммаДоначисления = "ЕСТЬNULL(Доначисление.СуммаБУ, 0)";
	
	ТекстСуммаАмортизацииБУ = ТекстЗапросаСуммаАмортизацииБУ(ПараметрыТекстаЗапроса);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаАмортизацииБУ", ТекстСуммаАмортизацииБУ);
	
	//
	ТекстОбесценениеБУ = ТекстЗапросаСуммаОбесценения();
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОбесценениеБУ", ТекстОбесценениеБУ);
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаРасчетАмортизацииВыборкаИзмененийБУ(СписокЗапросов, ПараметрыРасчета)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ОбъединениеОС.Ссылка КАК Ссылка,
	|	ОбъединениеОС.ОсновноеСредство КАК ОсновноеСредствоПолучатель,
	|	ТабличнаяЧасть.ОсновноеСредство КАК ОсновноеСредствоИсточник
	|ПОМЕСТИТЬ ОбъединениеОС
	|ИЗ
	|	Документ.ОбъединениеОС КАК ОбъединениеОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОбъединениеОС.ОС КАК ТабличнаяЧасть
	|		ПО (ТабличнаяЧасть.Ссылка = ОбъединениеОС.Ссылка)
	|ГДЕ
	|	ОбъединениеОС.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И ОбъединениеОС.Проведен
	|	И ОбъединениеОС.ОтражатьВРеглУчете
	|	И (ОбъединениеОС.Организация, ТабличнаяЧасть.ОсновноеСредство) В
	|		(ВЫБРАТЬ
	|			СписокОС.Организация,
	|			СписокОС.ОбъектУчета
	|		ИЗ
	|			ПакетыАмортизации КАК СписокОС)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокОС.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ ОтборОС
	|ИЗ
	|	СписокОССИзмененнымиПараметрами_БУ КАК СписокОС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписокОС.ОсновноеСредствоИсточник
	|ИЗ
	|	ОбъединениеОС КАК СписокОС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазукомплектацияОС.Ссылка КАК Ссылка,
	|	РазукомплектацияОС.ОсновноеСредство КАК ОсновноеСредствоИсточник,
	|	ТабличнаяЧасть.ОсновноеСредство КАК ОсновноеСредствоПолучатель,
	|	0 КАК СтоимостьСписанияУпр,
	|	ТабличнаяЧасть.СтоимостьБУ КАК СтоимостьСписанияРегл,
	|	ТабличнаяЧасть.СтоимостьПР КАК СтоимостьСписанияПР
	|ИЗ
	|	Документ.РазукомплектацияОС КАК РазукомплектацияОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РазукомплектацияОС.ОС КАК ТабличнаяЧасть
	|		ПО (ТабличнаяЧасть.Ссылка = РазукомплектацияОС.Ссылка)
	|ГДЕ
	|	РазукомплектацияОС.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И РазукомплектацияОС.Проведен
	|	И РазукомплектацияОС.ОтражатьВРеглУчете
	|	И (РазукомплектацияОС.Организация, ТабличнаяЧасть.ОсновноеСредство) В
	|		(ВЫБРАТЬ
	|			СписокОС.Организация,
	|			СписокОС.ОбъектУчета
	|		ИЗ
	|			ПакетыАмортизации КАК СписокОС)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбъединениеОС.Ссылка,
	|	ОбъединениеОС.ОсновноеСредствоИсточник,
	|	ОбъединениеОС.ОсновноеСредствоПолучатель,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	ОбъединениеОС КАК ОбъединениеОС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК Приоритет,
	|	&НачалоМесяца КАК Период,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	СписокОС.Организация КАК Организация,
	|	СписокОС.Подразделение КАК Подразделение,
	|	СписокОС.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СписокОС.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СписокОС.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокОС.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокОС.СпособОтраженияРасходов КАК СпособОтраженияРасходов,
	|	СписокОС.СуммаБУ КАК СуммаБУ,
	|	0 КАК СуммаУУ,
	|	0 КАК ОбесценениеУУ,
	|	СписокОС.ОбесценениеБУ КАК ОбесценениеБУ,
	|	1 КАК Коэффициент,
	|	СписокОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокОС.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокОС.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	СписокОС.РесурсНазначенный КАК РесурсНазначенный,
	|	СписокОС.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизации,
	|
	|	0 КАК ЛиквидационнаяСтоимость,
	|	СписокОС.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимостьРегл,
	|
	|	СписокОС.ОстаточнаяСтоимостьРегл КАК ОстаточнаяСтоимостьРегл,
	|	СписокОС.ОстаточнаяСтоимостьЦФ КАК ОстаточнаяСтоимостьЦФ,
	|	СписокОС.ОстаточнаяСтоимостьПР КАК ОстаточнаяСтоимостьПР,
	|	СписокОС.ОстаточнаяСтоимостьПРЦФ КАК ОстаточнаяСтоимостьПРЦФ, 
	|	СписокОС.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|	0 КАК ОстатокОбесцененияУпр,
	|
	|	СписокОС.КоэффициентУскоренияБУ КАК КоэффициентУскорения,
	|	СписокОС.ОтработанныхМесяцевПолныхЛет КАК ОтработанныхМесяцевПолныхЛет,
	|	СписокОС.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации,
	|	СписокОС.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|	СписокОС.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|	СписокОС.НачислятьАмортизациюБУ КАК НачислятьАмортизацию,
	|	ЛОЖЬ КАК ПолученПриРазукомплектацииОбъединении,
	|
	|	0 КАК Стоимость,
	|	СписокОС.СтоимостьРегл КАК СтоимостьРегл,
	|
	|	0 КАК Амортизация,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(СписокОС.ПериодРасчета, МЕСЯЦ) = &НачалоМесяца
	|			ТОГДА СписокОС.АмортизацияРегл + ЕСТЬNULL(Доначисление.СуммаБУ, 0)
	|		ИНАЧЕ СписокОС.АмортизацияРегл
	|	КОНЕЦ КАК АмортизацияРегл,
	|
	|	0 КАК СтоимостьИзменение,
	|	0 КАК СтоимостьРеглИзменение,
	|
	|	0 КАК АмортизацияИзменение,
	|	0 КАК АмортизацияРеглИзменение,
	|
	|	0 КАК СтоимостьДляВычисленияАмортизации,
	|	СписокОС.СтоимостьРегл - СписокОС.АмортизацияРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|	СписокОС.СтоимостьДляВычисленияПР КАК СтоимостьДляВычисленияПР,
	|
	|	СписокОС.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|	СписокОС.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|	СписокОС.КоэффициентЦФПР КАК КоэффициентЦФПР,
	|	СписокОС.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|	ЛОЖЬ КАК ЭтоИзменения
	|ИЗ
	|	РасчетАмортизацииБезИзмененийБУ КАК СписокОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоначислениеАмортизацииБУ_Сгруппированная КАК Доначисление
	|		ПО Доначисление.ОсновноеСредство = СписокОС.ОсновноеСредство
	|ГДЕ
	|	СписокОС.ОсновноеСредство В
	|		(ВЫБРАТЬ
	|			СписокОС.ОсновноеСредство
	|		ИЗ
	|			ОтборОС КАК СписокОС)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(СписокОС.Регистратор) = ТИП(Документ.РазукомплектацияОС)
	|		И НЕ СписокОС.ПолученПриРазукомплектацииОбъединении
	|			ТОГДА 3
	|		КОГДА СписокОС.ПолученПриРазукомплектацииОбъединении
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Приоритет,
	|	СписокОС.Период КАК Период,
	|	СписокОС.Регистратор КАК Регистратор,
	|	СписокОС.Организация КАК Организация,
	|	СписокОС.Подразделение КАК Подразделение,
	|	СписокОС.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СписокОС.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СписокОС.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокОС.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокОС.СпособОтраженияРасходов КАК СпособОтраженияРасходов,
	|	0 КАК СуммаБУ,
	|	0 КАК СуммаУУ,
	|	0 КАК ОбесценениеУУ,
	|	0 КАК ОбесценениеБУ,
	|	1 КАК Коэффициент,
	|	СписокОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокОС.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокОС.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	СписокОС.РесурсНазначенный КАК РесурсНазначенный,
	|	СписокОС.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизации,
	|
	|	0 КАК ЛиквидационнаяСтоимость,
	|	СписокОС.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимостьРегл,
	|
	|	СписокОС.ОстаточнаяСтоимостьРегл КАК ОстаточнаяСтоимостьРегл,
	|	СписокОС.ОстаточнаяСтоимостьЦФ КАК ОстаточнаяСтоимостьЦФ,
	|	СписокОС.ОстаточнаяСтоимостьПР КАК ОстаточнаяСтоимостьПР,
	|	СписокОС.ОстаточнаяСтоимостьПРЦФ КАК ОстаточнаяСтоимостьПРЦФ, 
	|	СписокОС.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|	0 КАК ОстатокОбесцененияУпр,
	|
	|	СписокОС.КоэффициентУскоренияБУ КАК КоэффициентУскорения,
	|	СписокОС.ОтработанныхМесяцевПолныхЛет КАК ОтработанныхМесяцевПолныхЛет,
	|	СписокОС.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации,
	|	СписокОС.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|	СписокОС.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|	СписокОС.НачислятьАмортизациюБУ КАК НачислятьАмортизацию,
	|	СписокОС.ПолученПриРазукомплектацииОбъединении КАК ПолученПриРазукомплектацииОбъединении,
	|
	|	0 КАК Стоимость,
	|	СписокОС.СтоимостьРегл КАК СтоимостьРегл,
	|
	|	0 КАК Амортизация,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(СписокОС.Период, МЕСЯЦ) = &НачалоМесяца
	|			ТОГДА СписокОС.АмортизацияРегл + ЕСТЬNULL(Доначисление.СуммаБУ, 0)
	|		ИНАЧЕ СписокОС.АмортизацияРегл
	|	КОНЕЦ КАК АмортизацияРегл,
	|
	|	0 КАК СтоимостьИзменение,
	|	СписокОС.СтоимостьРеглИзменение КАК СтоимостьРеглИзменение,
	|
	|	0 КАК АмортизацияИзменение,
	|	СписокОС.АмортизацияРеглИзменение КАК АмортизацияРеглИзменение,
	|
	|	0 КАК СтоимостьДляВычисленияАмортизации,
	|	СписокОС.СтоимостьРегл - СписокОС.АмортизацияРегл КАК СтоимостьДляВычисленияАмортизацииРегл,
	|	СписокОС.СтоимостьДляВычисленияПР КАК СтоимостьДляВычисленияПР,
	|
	|	СписокОС.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|	СписокОС.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|	СписокОС.КоэффициентЦФПР КАК КоэффициентЦФПР,
	|	СписокОС.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|	ИСТИНА КАК ЭтоИзменения
	|ИЗ
	|	СписокОССИзмененнымиПараметрами_БУ КАК СписокОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоначислениеАмортизацииБУ_Сгруппированная КАК Доначисление
	|		ПО Доначисление.ОсновноеСредство = СписокОС.ОсновноеСредство
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПроверкаПараметровРасчетаИзменения_БУ КАК ПроверкаПараметровРасчета
	|		ПО ПроверкаПараметровРасчета.ОбъектУчета = СписокОС.ОсновноеСредство
	|		И ПроверкаПараметровРасчета.Организация = СписокОС.Организация
	|ГДЕ
	|	НЕ СписокОС.ЭтоДоначисление
	|	И ПроверкаПараметровРасчета.ОбъектУчета ЕСТЬ NULL";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура РассчитатьАмортизациюНУ(ПараметрыРасчета)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&КонецМесяца                          КАК ПериодРасчета,
	|	СписокОС.Организация                  КАК Организация,
	|	СписокОС.ОсновноеСредство             КАК ОсновноеСредство,
	|	СписокОС.Подразделение                КАК Подразделение,
	|	СписокОС.ГруппаФинансовогоУчета       КАК ГруппаФинансовогоУчета,
	|	СписокОС.НаправлениеДеятельности      КАК НаправлениеДеятельности,
	|	СписокОС.СтатьяРасходов               КАК СтатьяРасходов,
	|	СписокОС.АналитикаРасходов            КАК АналитикаРасходов,
	|	СписокОС.СпособОтраженияРасходов      КАК СпособОтраженияРасходов,
	|	СписокОС.ОстаточнаяСтоимостьНУ        КАК ОстаточнаяСтоимостьНУ,
	|	СписокОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокОС.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокОС.ПорядокУчетаБУ               КАК ПорядокУчетаБУ,
	|	СписокОС.КоэффициентЦФБУ              КАК КоэффициентЦФБУ,
	|	СписокОС.КоэффициентЦФНУ              КАК КоэффициентЦФНУ,
	|	СписокОС.КоэффициентЦФПР              КАК КоэффициентЦФПР,
	|
	|	ВЫБОР 
	|		КОГДА СписокОС.ОстаточнаяСтоимостьНУ <= 0
	|			ТОГДА 0
	|		КОГДА (СписокОС.СуммаНУ > СписокОС.ОстаточнаяСтоимостьНУ
	|					ИЛИ СписокОС.ОстаточнаяСтоимостьНУ - СписокОС.СуммаНУ < &МинимальнаяОстаточнаяСтоимостьРегл)
	|			ТОГДА СписокОС.ОстаточнаяСтоимостьНУ
	|		ИНАЧЕ СписокОС.СуммаНУ
	|	КОНЕЦ КАК СуммаНУ
	|
	|ПОМЕСТИТЬ РасчетАмортизацииНУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокОС.Организация                  КАК Организация,
	|		СписокОС.ОсновноеСредство             КАК ОсновноеСредство,
	|		СписокОС.Подразделение                КАК Подразделение,
	|		СписокОС.ГруппаФинансовогоУчета       КАК ГруппаФинансовогоУчета,
	|		СписокОС.НаправлениеДеятельности      КАК НаправлениеДеятельности,
	|		СписокОС.СтатьяРасходовНУ             КАК СтатьяРасходов,
	|		СписокОС.АналитикаРасходовНУ          КАК АналитикаРасходов,
	|		СписокОС.СпособОтраженияРасходов      КАК СпособОтраженияРасходов,
	|		СписокОС.ОстаточнаяСтоимостьНУ        КАК ОстаточнаяСтоимостьНУ,
	|		СписокОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|		СписокОС.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|		СписокОС.ПорядокУчетаБУ               КАК ПорядокУчетаБУ,
	|		СписокОС.КоэффициентЦФБУ              КАК КоэффициентЦФБУ,
	|		СписокОС.КоэффициентЦФНУ              КАК КоэффициентЦФНУ,
	|		СписокОС.КоэффициентЦФПР              КАК КоэффициентЦФПР,
	|
	|		&СуммаАмортизацииНУ КАК СуммаНУ
	|	ИЗ
	|		СписокОССПараметрами_НУ КАК СписокОС
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПроверкаПараметровРасчета_НУ КАК ПроверкаПараметровРасчета
	|			ПО ПроверкаПараметровРасчета.ОбъектУчета = СписокОС.ОсновноеСредство
	|				И ПроверкаПараметровРасчета.Организация = СписокОС.Организация
	|	ГДЕ
	|		СписокОС.НачислятьАмортизациюНУ
	|		И ПроверкаПараметровРасчета.ОбъектУчета ЕСТЬ NULL
	|
	|	) КАК СписокОС
	|
	|ГДЕ
	|	СписокОС.СуммаНУ <> 0";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаАмортизацииНУ", ТекстЗапросаСуммаАмортизацииНУ());
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	ВнеоборотныеАктивы.УстановитьПараметрыЗапросаДляРасчетаАмортизации(Запрос, ПараметрыРасчета);
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ОбъединитьРасчетАмортизацииБУНУ(ПараметрыРасчета)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Амортизация.ПериодРасчета КАК ПериодРасчета,
	|	Амортизация.Организация КАК Организация,
	|	Амортизация.Подразделение КАК Подразделение,
	|	Амортизация.ОсновноеСредство КАК ОсновноеСредство,
	|	ОбесценениеВНА.ЕГДС КАК ЕГДС,
	|	Амортизация.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	Амортизация.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЕСТЬNULL(СпособыОтраженияРасходов.НаправлениеДеятельности, Амортизация.НаправлениеДеятельности) КАК КорНаправлениеДеятельности,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(СпособыОтраженияРасходов.Подразделение, Амортизация.Подразделение) = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА Амортизация.Подразделение
	|		ИНАЧЕ ЕСТЬNULL(СпособыОтраженияРасходов.Подразделение, Амортизация.Подразделение) 
	|	КОНЕЦ КАК КорПодразделение,
	|
	|	ВЫБОР
	|		КОГДА НЕ СпособыОтраженияРасходов.СтатьяРасходов ЕСТЬ NULL
	|				И СпособыОтраженияРасходов.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|				И СпособыОтраженияРасходов.СтатьяРасходов <> НЕОПРЕДЕЛЕНО
	|			ТОГДА СпособыОтраженияРасходов.СтатьяРасходов
	|		ИНАЧЕ Амортизация.СтатьяРасходов
	|	КОНЕЦ КАК СтатьяРасходов,
	|
	|	ВЫБОР
	|		КОГДА НЕ СпособыОтраженияРасходов.СтатьяРасходов ЕСТЬ NULL
	|				И СпособыОтраженияРасходов.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|				И СпособыОтраженияРасходов.СтатьяРасходов <> НЕОПРЕДЕЛЕНО
	|			ТОГДА СпособыОтраженияРасходов.АналитикаРасходов
	|		ИНАЧЕ Амортизация.АналитикаРасходов
	|	КОНЕЦ КАК АналитикаРасходов,
	|
	|	ВЫБОР 
	|		КОГДА НЕ Амортизация.СпособОтраженияРасходов В (&ПустыеСпособыОтраженияРасходов) 
	|				И НЕ СпособыОтраженияРасходов.СпособОтраженияРасходов ЕСТЬ NULL
	|			ТОГДА &ОбесценениеБУ
	|		ИНАЧЕ Амортизация.ОбесценениеБУ
	|	КОНЕЦ КАК ОбесценениеБУ,
	|
	|	ВЫБОР 
	|		КОГДА НЕ Амортизация.СпособОтраженияРасходов В (&ПустыеСпособыОтраженияРасходов) 
	|				И НЕ СпособыОтраженияРасходов.СпособОтраженияРасходов ЕСТЬ NULL
	|			ТОГДА &ОбесценениеЦФ
	|		ИНАЧЕ Амортизация.ОбесценениеЦФ
	|	КОНЕЦ КАК ОбесценениеЦФ,
	|
	|	ВЫБОР
	|		КОГДА НЕ Амортизация.СпособОтраженияРасходов В (&ПустыеСпособыОтраженияРасходов) 
	|				И НЕ СпособыОтраженияРасходов.СпособОтраженияРасходов ЕСТЬ NULL
	|			ТОГДА &СуммаБУ
	|		КОГДА Амортизация.СуммаБУ > (Амортизация.ОстаточнаяСтоимостьРегл - Амортизация.ОстаточнаяСтоимостьЦФ)
	|				И (Амортизация.ОстаточнаяСтоимостьРегл - Амортизация.ОстаточнаяСтоимостьЦФ) > 0
	|			ТОГДА (Амортизация.ОстаточнаяСтоимостьРегл - Амортизация.ОстаточнаяСтоимостьЦФ)
	|		КОГДА Амортизация.СуммаБУ > (Амортизация.ОстаточнаяСтоимостьРегл - Амортизация.ОстаточнаяСтоимостьЦФ)
	|				И (Амортизация.ОстаточнаяСтоимостьРегл - Амортизация.ОстаточнаяСтоимостьЦФ) <= 0
	|			ТОГДА 0
	|		ИНАЧЕ Амортизация.СуммаБУ
	|	КОНЕЦ КАК СуммаБУ,
	|
	|	ВЫБОР 
	|		КОГДА НЕ Амортизация.СпособОтраженияРасходов В (&ПустыеСпособыОтраженияРасходов) 
	|				И НЕ СпособыОтраженияРасходов.СпособОтраженияРасходов ЕСТЬ NULL
	|			ТОГДА &СуммаНУ_регл
	|		ИНАЧЕ Амортизация.СуммаНУ
	|	КОНЕЦ КАК СуммаНУ,
	|
	|	ВЫБОР 
	|		КОГДА НЕ Амортизация.СпособОтраженияРасходов В (&ПустыеСпособыОтраженияРасходов) 
	|				И НЕ СпособыОтраженияРасходов.СпособОтраженияРасходов ЕСТЬ NULL
	|			ТОГДА &СуммаПР_регл
	|		КОГДА Амортизация.СуммаПР > Амортизация.ОстаточнаяСтоимостьПР
	|				И Амортизация.ОстаточнаяСтоимостьПР > 0
	|			ТОГДА Амортизация.ОстаточнаяСтоимостьПР
	|		КОГДА Амортизация.СуммаПР > Амортизация.ОстаточнаяСтоимостьПР
	|				И Амортизация.ОстаточнаяСтоимостьПР <= 0
	|			ТОГДА 0
	|		ИНАЧЕ Амортизация.СуммаПР
	|	КОНЕЦ КАК СуммаПР,
	|
	|	ВЫБОР 
	|		КОГДА НЕ Амортизация.СпособОтраженияРасходов В (&ПустыеСпособыОтраженияРасходов) 
	|				И НЕ СпособыОтраженияРасходов.СпособОтраженияРасходов ЕСТЬ NULL
	|			ТОГДА &СуммаЦФ
	|		КОГДА Амортизация.СуммаЦФ > Амортизация.ОстаточнаяСтоимостьЦФ
	|				И Амортизация.ОстаточнаяСтоимостьЦФ > 0
	|			ТОГДА Амортизация.ОстаточнаяСтоимостьЦФ
	|		КОГДА Амортизация.СуммаЦФ > Амортизация.ОстаточнаяСтоимостьЦФ
	|				И Амортизация.ОстаточнаяСтоимостьЦФ <= 0
	|			ТОГДА 0
	|		ИНАЧЕ Амортизация.СуммаЦФ
	|	КОНЕЦ КАК СуммаЦФ,
	|
	|	ВЫБОР 
	|		КОГДА НЕ Амортизация.СпособОтраженияРасходов В (&ПустыеСпособыОтраженияРасходов) 
	|				И НЕ СпособыОтраженияРасходов.СпособОтраженияРасходов ЕСТЬ NULL
	|			ТОГДА &СуммаНУЦФ_регл
	|		ИНАЧЕ Амортизация.СуммаНУЦФ
	|	КОНЕЦ КАК СуммаНУЦФ,
	|
	|	ВЫБОР 
	|		КОГДА НЕ Амортизация.СпособОтраженияРасходов В (&ПустыеСпособыОтраженияРасходов) 
	|				И НЕ СпособыОтраженияРасходов.СпособОтраженияРасходов ЕСТЬ NULL
	|			ТОГДА &СуммаПРЦФ_регл
	|		КОГДА Амортизация.СуммаПРЦФ > Амортизация.ОстаточнаяСтоимостьПРЦФ
	|				И Амортизация.ОстаточнаяСтоимостьПРЦФ > 0
	|			ТОГДА Амортизация.ОстаточнаяСтоимостьПРЦФ
	|		КОГДА Амортизация.СуммаПРЦФ > Амортизация.ОстаточнаяСтоимостьПРЦФ
	|				И Амортизация.ОстаточнаяСтоимостьПРЦФ <= 0
	|			ТОГДА 0
	|		ИНАЧЕ Амортизация.СуммаПРЦФ
	|	КОНЕЦ КАК СуммаПРЦФ,
	|
	|	ВЫБОР
	|		КОГДА НЕ СпособыОтраженияРасходов.ОрганизацияПолучательРасходов ЕСТЬ NULL
	|				И СпособыОтраженияРасходов.ПередаватьРасходыВДругуюОрганизацию
	|				И СпособыОтраженияРасходов.ОрганизацияПолучательРасходов <> Амортизация.Организация
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ Амортизация.ПередаватьРасходыВДругуюОрганизацию
	|	КОНЕЦ КАК ПередаватьРасходыВДругуюОрганизацию,
	|
	|	ЕСТЬNULL(СпособыОтраженияРасходов.ОрганизацияПолучательРасходов, Амортизация.ОрганизацияПолучательРасходов) КАК ОрганизацияПолучательРасходов,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УчетнаяПолитикаБУ.ПрименяетсяФСБУ6, ЛОЖЬ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамРегл)
	|	КОНЕЦ КАК ПорядокУчетаВНА,
	|
	|	ЕСТЬNULL(УчетнаяПолитикаУУ.ВариантПроводокПоОбесценениюВНА, ЗНАЧЕНИЕ(Перечисление.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения)) КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	Амортизация.НачислятьИзнос КАК НачислятьИзнос,
	|	Амортизация.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	Амортизация.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	Амортизация.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	Амортизация.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|	Амортизация.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|	Амортизация.ЭтоДоначисление КАК ЭтоДоначисление
	|
	|ПОМЕСТИТЬ РасчетАмортизации_БУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокОС.ПериодРасчета              КАК ПериодРасчета,
	|		СписокОС.Организация                КАК Организация,
	|		ВЫРАЗИТЬ(СписокОС.Организация КАК Справочник.Организации).ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|		СписокОС.Подразделение              КАК Подразделение,
	|		СписокОС.ОсновноеСредство           КАК ОсновноеСредство,
	|		СписокОС.ГруппаФинансовогоУчета     КАК ГруппаФинансовогоУчета,
	|		СписокОС.НаправлениеДеятельности    КАК НаправлениеДеятельности,
	|		СписокОС.СтатьяРасходов             КАК СтатьяРасходов,
	|		СписокОС.АналитикаРасходов          КАК АналитикаРасходов,
	|		СписокОС.СпособОтраженияРасходов    КАК СпособОтраженияРасходов,
	|
	|		СУММА(СписокОС.СуммаБУ - ВЫРАЗИТЬ(СписокОС.СуммаБУ * ЕСТЬNULL(СписокОС.КоэффициентЦФБУ, 0) КАК ЧИСЛО(31,2))) КАК СуммаБУ,
	|
	|		СУММА(СписокОС.СуммаНУ - ВЫРАЗИТЬ(СписокОС.СуммаНУ * ЕСТЬNULL(СписокОС.КоэффициентЦФНУ, 0) КАК ЧИСЛО(31,2))) КАК СуммаНУ,
	|
	|		СУММА(СписокОС.СуммаПР - ВЫРАЗИТЬ(СписокОС.СуммаПР * ЕСТЬNULL(СписокОС.КоэффициентЦФПР, 0) КАК ЧИСЛО(31,2))) КАК СуммаПР,
	|
	|		СУММА(ВЫРАЗИТЬ(СписокОС.СуммаБУ * ЕСТЬNULL(СписокОС.КоэффициентЦФБУ, 0) КАК ЧИСЛО(31,2))) КАК СуммаЦФ,
	|
	|		СУММА(ВЫРАЗИТЬ(СписокОС.СуммаНУ * ЕСТЬNULL(СписокОС.КоэффициентЦФНУ, 0) КАК ЧИСЛО(31,2))) КАК СуммаНУЦФ,
	|
	|		СУММА(ВЫРАЗИТЬ(СписокОС.СуммаПР * ЕСТЬNULL(СписокОС.КоэффициентЦФПР, 0) КАК ЧИСЛО(31,2))) КАК СуммаПРЦФ,
	|
	|		СписокОС.ПередаватьРасходыВДругуюОрганизацию  КАК ПередаватьРасходыВДругуюОрганизацию,
	|		СписокОС.ОрганизацияПолучательРасходов        КАК ОрганизацияПолучательРасходов,
	|
	|		СУММА(СписокОС.ОбесценениеБУ - ВЫРАЗИТЬ(СписокОС.ОбесценениеБУ * ЕСТЬNULL(СписокОС.КоэффициентЦФБУ, 0) КАК ЧИСЛО(31,2))) КАК ОбесценениеБУ,
	|		СУММА(ВЫРАЗИТЬ(СписокОС.ОбесценениеБУ * ЕСТЬNULL(СписокОС.КоэффициентЦФБУ, 0) КАК ЧИСЛО(31,2))) КАК ОбесценениеЦФ,
	|
	|		СписокОС.НачислятьИзнос КАК НачислятьИзнос,
	|		МАКСИМУМ(СписокОС.РесурсВыработанныйЗаПрошлыйПериод) КАК РесурсВыработанныйЗаПрошлыйПериод,
	|		МАКСИМУМ(СписокОС.РесурсВыработанныйЗаТекущийПериод) КАК РесурсВыработанныйЗаТекущийПериод,
	|		МАКСИМУМ(СписокОС.СтоимостьДляВычисленияАмортизации) КАК СтоимостьДляВычисленияАмортизации,
	|		МАКСИМУМ(СписокОС.ОстаточнаяСтоимостьРегл) КАК ОстаточнаяСтоимостьРегл,
	|		МАКСИМУМ(СписокОС.ОстаточнаяСтоимостьЦФ) КАК ОстаточнаяСтоимостьЦФ,
	|		МАКСИМУМ(СписокОС.ОстаточнаяСтоимостьПР) КАК ОстаточнаяСтоимостьПР,
	|		МАКСИМУМ(СписокОС.ОстаточнаяСтоимостьПРЦФ) КАК ОстаточнаяСтоимостьПРЦФ,
	|		МАКСИМУМ(СписокОС.ОстатокОбесцененияРегл) КАК ОстатокОбесцененияРегл,
	|		МАКСИМУМ(СписокОС.ПорядокНачисленияАмортизацииБУ) КАК ПорядокНачисленияАмортизацииБУ,
	|		СписокОС.ЭтоДоначисление КАК ЭтоДоначисление
	|	ИЗ
	|		(ВЫБРАТЬ
	|			РасчетАмортизации.ПериодРасчета                КАК ПериодРасчета,
	|			РасчетАмортизации.Организация                  КАК Организация,
	|			РасчетАмортизации.Подразделение                КАК Подразделение,
	|			РасчетАмортизации.ОсновноеСредство             КАК ОсновноеСредство,
	|			РасчетАмортизации.ГруппаФинансовогоУчета       КАК ГруппаФинансовогоУчета,
	|			РасчетАмортизации.НаправлениеДеятельности      КАК НаправлениеДеятельности,
	|			РасчетАмортизации.СтатьяРасходов               КАК СтатьяРасходов,
	|			РасчетАмортизации.АналитикаРасходов            КАК АналитикаРасходов,
	|			РасчетАмортизации.СпособОтраженияРасходов      КАК СпособОтраженияРасходов,
	|
	|			РасчетАмортизации.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|			РасчетАмортизации.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|			РасчетАмортизации.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|
	|			РасчетАмортизации.ОстаточнаяСтоимостьРегл           КАК ОстаточнаяСтоимостьРегл,
	|			РасчетАмортизации.ОстаточнаяСтоимостьЦФ             КАК ОстаточнаяСтоимостьЦФ,
	|			РасчетАмортизации.ОстаточнаяСтоимостьПР             КАК ОстаточнаяСтоимостьПР,
	|			РасчетАмортизации.ОстаточнаяСтоимостьПРЦФ           КАК ОстаточнаяСтоимостьПРЦФ,
	|			РасчетАмортизации.ОстатокОбесцененияРегл            КАК ОстатокОбесцененияРегл,
	|
	|			РасчетАмортизации.ОбесценениеБУ КАК ОбесценениеБУ,
	|
	|			РасчетАмортизации.СуммаБУ КАК СуммаБУ,
	|
	|			ВЫБОР
	|				КОГДА РасчетАмортизации.СтоимостьДляВычисленияПР <> 0
	|					ТОГДА ВЫРАЗИТЬ(РасчетАмортизации.ПРДляВычисленияАмортизации 
	|							* РасчетАмортизации.СуммаБУ 
	|									/ РасчетАмортизации.СтоимостьДляВычисленияПР КАК ЧИСЛО(31,2))
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК СуммаПР,
	|
	|			0 КАК СуммаНУ,
	|			
	|			РасчетАмортизации.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|			РасчетАмортизации.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|			РасчетАмортизации.КоэффициентЦФПР КАК КоэффициентЦФПР,
	|
	|			РасчетАмортизации.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|			РасчетАмортизации.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|			РасчетАмортизации.ПорядокУчетаБУ = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеИзносаПоЕНАОФ) КАК НачислятьИзнос,
	|			РасчетАмортизации.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|			ЛОЖЬ КАК ЭтоДоначисление
	|		ИЗ
	|			РасчетАмортизацииБезИзмененийБУ КАК РасчетАмортизации
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|
	|		ВЫБРАТЬ
	|			РасчетАмортизации.ПериодРасчета                КАК ПериодРасчета,
	|			РасчетАмортизации.Организация                  КАК Организация,
	|			РасчетАмортизации.Подразделение                КАК Подразделение,
	|			РасчетАмортизации.ОсновноеСредство             КАК ОсновноеСредство,
	|			РасчетАмортизации.ГруппаФинансовогоУчета       КАК ГруппаФинансовогоУчета,
	|			РасчетАмортизации.НаправлениеДеятельности      КАК НаправлениеДеятельности,
	|			РасчетАмортизации.СтатьяРасходов               КАК СтатьяРасходов,
	|			РасчетАмортизации.АналитикаРасходов            КАК АналитикаРасходов,
	|			РасчетАмортизации.СпособОтраженияРасходов      КАК СпособОтраженияРасходов,
	|			РасчетАмортизации.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|			РасчетАмортизации.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|			РасчетАмортизации.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|			РасчетАмортизации.ОстаточнаяСтоимостьРегл           КАК ОстаточнаяСтоимостьРегл,
	|			РасчетАмортизации.ОстаточнаяСтоимостьЦФ             КАК ОстаточнаяСтоимостьЦФ,
	|			РасчетАмортизации.ОстаточнаяСтоимостьПР             КАК ОстаточнаяСтоимостьПР,
	|			РасчетАмортизации.ОстаточнаяСтоимостьПРЦФ           КАК ОстаточнаяСтоимостьПРЦФ,
	|			РасчетАмортизации.ОстатокОбесцененияРегл            КАК Обесценение,
	|
	|			РасчетАмортизации.ОбесценениеБУ КАК ОбесценениеБУ,
	|
	|			РасчетАмортизации.СуммаБУ КАК СуммаБУ,
	|
	|			ВЫБОР
	|				КОГДА РасчетАмортизации.СтоимостьДляВычисленияПР <> 0
	|					ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(РасчетАмортизации.СуммаБУ КАК ЧИСЛО(20,8))
	|									* (ВЫРАЗИТЬ(РасчетАмортизации.ПРДляВычисленияАмортизации КАК ЧИСЛО(20,8))
	|										/ ВЫРАЗИТЬ(РасчетАмортизации.СтоимостьДляВычисленияПР КАК ЧИСЛО(20,8))) КАК ЧИСЛО(31,2))
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК СуммаПР,
	|
	|			0 КАК СуммаНУ,
	|			
	|			РасчетАмортизации.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|			РасчетАмортизации.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|			РасчетАмортизации.КоэффициентЦФПР КАК КоэффициентЦФПР,
	|
	|			РасчетАмортизации.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|			РасчетАмортизации.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|			РасчетАмортизации.ПорядокУчетаБУ = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеИзносаПоЕНАОФ) КАК НачислятьИзнос,
	|			РасчетАмортизации.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|			ЛОЖЬ КАК ЭтоДоначисление
	|		ИЗ
	|			РасчетАмортизацииСУчетомИзмененийБУ КАК РасчетАмортизации
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|
	|		ВЫБРАТЬ
	|			РасчетАмортизации.ПериодРасчета                КАК ПериодРасчета,
	|			РасчетАмортизации.Организация                  КАК Организация,
	|			РасчетАмортизации.Подразделение                КАК Подразделение,
	|			РасчетАмортизации.ОсновноеСредство             КАК ОсновноеСредство,
	|			РасчетАмортизации.ГруппаФинансовогоУчета       КАК ГруппаФинансовогоУчета,
	|			РасчетАмортизации.НаправлениеДеятельности      КАК НаправлениеДеятельности,
	|			РасчетАмортизации.СтатьяРасходов               КАК СтатьяРасходов,
	|			РасчетАмортизации.АналитикаРасходов            КАК АналитикаРасходов,
	|			РасчетАмортизации.СпособОтраженияРасходов      КАК СпособОтраженияРасходов,
	|
	|			РасчетАмортизации.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|			РасчетАмортизации.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|			РасчетАмортизации.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|
	|			РасчетАмортизации.ОстаточнаяСтоимостьРегл           КАК ОстаточнаяСтоимостьРегл,
	|			РасчетАмортизации.ОстаточнаяСтоимостьЦФ             КАК ОстаточнаяСтоимостьЦФ,
	|			РасчетАмортизации.ОстаточнаяСтоимостьПР             КАК ОстаточнаяСтоимостьПР,
	|			РасчетАмортизации.ОстаточнаяСтоимостьПРЦФ           КАК ОстаточнаяСтоимостьПРЦФ,
	|			0                                                   КАК ОстатокОбесцененияРегл,
	|
	|			0 КАК ОбесценениеБУ,
	|
	|			РасчетАмортизации.СуммаБУ КАК СуммаБУ,
	|
	|			ВЫБОР
	|				КОГДА РасчетАмортизации.СтоимостьДляВычисленияПР <> 0
	|					ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(РасчетАмортизации.СуммаБУ КАК ЧИСЛО(20,8))
	|									* (ВЫРАЗИТЬ(РасчетАмортизации.ПРДляВычисленияАмортизации КАК ЧИСЛО(20,8))
	|										/ ВЫРАЗИТЬ(РасчетАмортизации.СтоимостьДляВычисленияПР КАК ЧИСЛО(20,8))) КАК ЧИСЛО(31,2))
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК СуммаПР,
	|
	|			0 КАК СуммаНУ,
	|			
	|			РасчетАмортизации.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|			РасчетАмортизации.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|			РасчетАмортизации.КоэффициентЦФПР КАК КоэффициентЦФПР,
	|
	|			РасчетАмортизации.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|			РасчетАмортизации.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|			РасчетАмортизации.ПорядокУчетаБУ = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеИзносаПоЕНАОФ) КАК НачислятьИзнос,
	|			РасчетАмортизации.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|			ИСТИНА КАК ЭтоДоначисление
	|		ИЗ
	|			ДоначислениеАмортизацииБУ КАК РасчетАмортизации
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|
	|		ВЫБРАТЬ
	|			РасчетАмортизации.ПериодРасчета                КАК ПериодРасчета,
	|			РасчетАмортизации.Организация                  КАК Организация,
	|			РасчетАмортизации.Подразделение                КАК Подразделение,
	|			РасчетАмортизации.ОсновноеСредство             КАК ОсновноеСредство,
	|			РасчетАмортизации.ГруппаФинансовогоУчета       КАК ГруппаФинансовогоУчета,
	|			РасчетАмортизации.НаправлениеДеятельности      КАК НаправлениеДеятельности,
	|			РасчетАмортизации.СтатьяРасходов               КАК СтатьяРасходов,
	|			РасчетАмортизации.АналитикаРасходов            КАК АналитикаРасходов,
	|			РасчетАмортизации.СпособОтраженияРасходов      КАК СпособОтраженияРасходов,
	|
	|			0 КАК РесурсВыработанныйЗаПрошлыйПериод,
	|			0 КАК РесурсВыработанныйЗаТекущийПериод,
	|			0 КАК СтоимостьДляВычисленияАмортизации,
	|
	|			0 КАК ОстаточнаяСтоимостьРегл,
	|			0 КАК ОстаточнаяСтоимостьЦФ,
	|			0 КАК ОстаточнаяСтоимостьПР,
	|			0 КАК ОстаточнаяСтоимостьПРЦФ,
	|			0 КАК ОстатокОбесцененияРегл,
	|
	|			0 КАК ОбесценениеБУ,
	|
	|			0 КАК СуммаБУ,
	|			0 КАК СуммаПР,
	|			РасчетАмортизации.СуммаНУ КАК СуммаНУ,
	|			
	|			РасчетАмортизации.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|			РасчетАмортизации.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|			РасчетАмортизации.КоэффициентЦФПР КАК КоэффициентЦФПР,
	|
	|			РасчетАмортизации.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|			РасчетАмортизации.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|			РасчетАмортизации.ПорядокУчетаБУ = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеИзносаПоЕНАОФ) КАК НачислятьИзнос,
	|			НЕОПРЕДЕЛЕНО КАК ПорядокНачисленияАмортизацииБУ,
	|			ЛОЖЬ КАК ЭтоДоначисление
	|
	|		ИЗ
	|			РасчетАмортизацииНУ КАК РасчетАмортизации
	|
	|		) КАК СписокОС
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СписокОС.ПериодРасчета,
	|		СписокОС.Организация,
	|		ВЫРАЗИТЬ(СписокОС.Организация КАК Справочник.Организации).ГоловнаяОрганизация,
	|		СписокОС.Подразделение,
	|		СписокОС.ОсновноеСредство,
	|		СписокОС.ГруппаФинансовогоУчета,
	|		СписокОС.НаправлениеДеятельности,
	|		СписокОС.СтатьяРасходов,
	|		СписокОС.АналитикаРасходов,
	|		СписокОС.СпособОтраженияРасходов,
	|		СписокОС.ПередаватьРасходыВДругуюОрганизацию,
	|		СписокОС.ОрганизацияПолучательРасходов,
	|		СписокОС.НачислятьИзнос,
	|		СписокОС.ЭтоДоначисление
	|
	|	) КАК Амортизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособыОтраженияРасходовБУ КАК СпособыОтраженияРасходов
	|		ПО (СпособыОтраженияРасходов.СпособОтраженияРасходов = Амортизация.СпособОтраженияРасходов)
	|			И (НЕ СпособыОтраженияРасходов.ЭтоАмортизационнаяПремия)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаБухУчета.СрезПоследних(&КонецМесяца) КАК УчетнаяПолитикаБУ
	|		ПО УчетнаяПолитикаБУ.Организация = Амортизация.ГоловнаяОрганизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета.СрезПоследних(&КонецМесяца) КАК УчетнаяПолитикаУУ
	|		ПО УчетнаяПолитикаУУ.Организация = Амортизация.ГоловнаяОрганизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбесценениеВНА КАК ОбесценениеВНА
	|		ПО ОбесценениеВНА.Организация = Амортизация.Организация
	|			И ОбесценениеВНА.ОсновноеСредство = Амортизация.ОсновноеСредство
	|";
	
	ПолеСумма = 
	"ВЫБОР
	|	КОГДА Амортизация.СуммаБУ > (Амортизация.ОстаточнаяСтоимостьРегл - Амортизация.ОстаточнаяСтоимостьЦФ)
	|				И (Амортизация.ОстаточнаяСтоимостьРегл - Амортизация.ОстаточнаяСтоимостьЦФ) > 0
	|			ТОГДА (Амортизация.ОстаточнаяСтоимостьРегл - Амортизация.ОстаточнаяСтоимостьЦФ)
	|	КОГДА Амортизация.СуммаБУ > (Амортизация.ОстаточнаяСтоимостьРегл - Амортизация.ОстаточнаяСтоимостьЦФ)
	|				И (Амортизация.ОстаточнаяСтоимостьРегл - Амортизация.ОстаточнаяСтоимостьЦФ) <= 0
	|			ТОГДА 0
	|	ИНАЧЕ Амортизация.СуммаБУ
	|КОНЕЦ";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаБУ", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммы(ПолеСумма));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаНУ_регл",   ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммы("Амортизация.СуммаНУ"));
	
	ПолеСумма = 
	"ВЫБОР
	|	КОГДА Амортизация.СуммаПР > Амортизация.ОстаточнаяСтоимостьПР
	|				И Амортизация.ОстаточнаяСтоимостьПР > 0
	|			ТОГДА Амортизация.ОстаточнаяСтоимостьПР
	|	КОГДА Амортизация.СуммаПР > Амортизация.ОстаточнаяСтоимостьПР
	|				И Амортизация.ОстаточнаяСтоимостьПР <= 0
	|			ТОГДА 0
	|	ИНАЧЕ Амортизация.СуммаПР
	|КОНЕЦ";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаПР_регл", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммы(ПолеСумма));
	
	ПолеСумма = 
	"ВЫБОР
	|	КОГДА Амортизация.СуммаЦФ > Амортизация.ОстаточнаяСтоимостьЦФ
	|				И Амортизация.ОстаточнаяСтоимостьЦФ > 0
	|			ТОГДА Амортизация.ОстаточнаяСтоимостьЦФ
	|	КОГДА Амортизация.СуммаЦФ > Амортизация.ОстаточнаяСтоимостьЦФ
	|				И Амортизация.ОстаточнаяСтоимостьЦФ <= 0
	|			ТОГДА 0
	|	ИНАЧЕ Амортизация.СуммаЦФ
	|КОНЕЦ";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаЦФ", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммы(ПолеСумма));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаНУЦФ_регл", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммы("Амортизация.СуммаНУЦФ"));
	
	ПолеСумма = 
	"ВЫБОР
	|	КОГДА Амортизация.СуммаПРЦФ > Амортизация.ОстаточнаяСтоимостьПРЦФ
	|				И Амортизация.ОстаточнаяСтоимостьПРЦФ > 0
	|			ТОГДА Амортизация.ОстаточнаяСтоимостьПРЦФ
	|	КОГДА Амортизация.СуммаПРЦФ > Амортизация.ОстаточнаяСтоимостьПРЦФ
	|				И Амортизация.ОстаточнаяСтоимостьПРЦФ <= 0
	|			ТОГДА 0
	|	ИНАЧЕ Амортизация.СуммаПРЦФ
	|КОНЕЦ";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаПРЦФ_регл", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммы(ПолеСумма));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОбесценениеБУ",  ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммы("Амортизация.ОбесценениеБУ"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОбесценениеЦФ",  ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммы("Амортизация.ОбесценениеЦФ"));

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	ВнеоборотныеАктивы.УстановитьПараметрыЗапросаДляРасчетаАмортизации(Запрос, ПараметрыРасчета);
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура РассчитатьАмортизационнуюПремию(ПараметрыРасчета)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ПакетыАмортизацииОС.НомерПакета, 0) КАК НомерПакета,
	|	СписокОС.Организация КАК Организация,
	|	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СписокОС.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СписокОС.Подразделение КАК Подразделение,
	|	СписокОС.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СписокОС.Арендатор КАК Арендатор,
	|
	|	ЕСТЬNULL(СпособыОтраженияРасходов.НаправлениеДеятельности, СписокОС.НаправлениеДеятельности) КАК КорНаправлениеДеятельности,
	|
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(СпособыОтраженияРасходов.Подразделение, СписокОС.Подразделение) = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА СписокОС.Подразделение
	|		ИНАЧЕ ЕСТЬNULL(СпособыОтраженияРасходов.Подразделение, СписокОС.Подразделение) 
	|	КОНЕЦ КАК КорПодразделение,
	|
	|	ЕСТЬNULL(СпособыОтраженияРасходов.СтатьяРасходов, СписокОС.СтатьяРасходовАмортизационнойПремии) КАК СтатьяРасходов,
	|	ЕСТЬNULL(СпособыОтраженияРасходов.АналитикаРасходов, СписокОС.АналитикаРасходовАмортизационнойПремии) КАК АналитикаРасходов,
	|	ЕСТЬNULL(СпособыОтраженияРасходов.ПередаватьРасходыВДругуюОрганизацию, СписокОС.ПередаватьРасходыВДругуюОрганизацию) КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ЕСТЬNULL(СпособыОтраженияРасходов.ОрганизацияПолучательРасходов, СписокОС.ОрганизацияПолучательРасходов) КАК ОрганизацияПолучательРасходов,
	|
	|	ВЫБОР 
	|		КОГДА НЕ СписокОС.СпособОтраженияРасходовАмортизационнойПремии В (&ПустыеСпособыОтраженияРасходов) ТОГДА
	|			&АмортизационнаяПремия
	|		ИНАЧЕ СписокОС.АмортизационнаяПремия
	|	КОНЕЦ КАК Сумма
	|
	|ПОМЕСТИТЬ АмортизационнаяПремия
	|
	|ИЗ
	|	СписокОССПараметрами_НУ КАК СписокОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособыОтраженияРасходовБУ КАК СпособыОтраженияРасходов
	|		ПО (СпособыОтраженияРасходов.СпособОтраженияРасходов = СписокОС.СпособОтраженияРасходовАмортизационнойПремии)
	|			И (СпособыОтраженияРасходов.ЭтоАмортизационнаяПремия)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПакетыАмортизацииОС КАК ПакетыАмортизацииОС
	|		ПО ПакетыАмортизацииОС.Организация = СписокОС.Организация
	|			И ПакетыАмортизацииОС.ОсновноеСредство = СписокОС.ОсновноеСредство
	|
	|ГДЕ
	|	СписокОС.АмортизационнаяПремия <> 0
	|	И СписокОС.ОсновноеСредство В (
	|		ВЫБРАТЬ
	|			РасчетАмортизации.ОсновноеСредство
	|		ИЗ
	|			РасчетАмортизацииНУ КАК РасчетАмортизации
	|		ГДЕ
	|			РасчетАмортизации.СуммаНУ > 0)";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&АмортизационнаяПремия", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммы("СписокОС.АмортизационнаяПремия"));
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	ВнеоборотныеАктивы.УстановитьПараметрыЗапросаДляРасчетаАмортизации(Запрос, ПараметрыРасчета);
	Запрос.Выполнить();
	
	ОбщегоНазначенияУТ.ДобавитьИдентификаторыВоВременнуюТаблицу("АмортизационнаяПремия", ПараметрыРасчета.МенеджерВременныхТаблиц);
	
КонецПроцедуры

Процедура ВернутьПараметрыРасчета(ПараметрыРасчета)

	Если НЕ ПараметрыРасчета.ВернутьПараметрыРасчета Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&КонецМесяца                                                      КАК Дата,
	|	ПараметрыАмортизации.Организация                                  КАК Организация,
	|	ПараметрыАмортизации.ОсновноеСредство                             КАК ВнеоборотныйАктив,
	|
	|	ВЫБОР 
	|		КОГДА ПараметрыАмортизации.НачислятьАмортизациюБУ 
	|			ТОГДА ПараметрыАмортизации.МетодНачисленияАмортизацииБУ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК МетодНачисленияБУ,
	|	ВЫБОР 
	|		КОГДА ПараметрыАмортизации.НачислятьАмортизациюБУ 
	|			ТОГДА ПараметрыАмортизации.СрокИспользованияДляВычисленияАмортизации
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СрокИспользованияБУ,
	|	ПараметрыАмортизации.КоэффициентПериода                           КАК КоэффициентПериода,
	|	ПараметрыАмортизации.СтоимостьДляВычисленияАмортизации            КАК СтоимостьБУ,
	|	ПараметрыАмортизации.ОбъемВыработки                               КАК ВыработкаЗаМесяцБУ,
	|	ПараметрыАмортизации.ОбъемПродукцииРаботДляВычисленияАмортизации  КАК ОбъемПродукцииБУ,
	|	ПараметрыАмортизации.КоэффициентАмортизацииБУ                     КАК КоэффициентАмортизацииБУ,
	|	ПараметрыАмортизации.КоэффициентУскоренияБУ                       КАК КоэффициентУскоренияБУ,
	|	ПараметрыАмортизации.СтоимостьНаНачалоГода                        КАК СтоимостьНаНачалоГодаБУ,
	|	(ПараметрыАмортизации.ЧислоЛетПользования
	|		- ПараметрыАмортизации.ЧислоПрошедшихЛет) * 12                КАК ОставшийсяСрокИспользования,
	|	ПараметрыАмортизации.ЧислоПрошедшихЛет * 12                       КАК ФактическийСрокИспользования,
	|
	|	ВЫБОР 
	|		КОГДА ПараметрыАмортизации.НачислятьАмортизациюБУ 
	|			ТОГДА ПараметрыАмортизации.ПРДляВычисленияАмортизации
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПРДляВычисленияАмортизации
	|
	|ИЗ
	|	СписокОССПараметрами_БУ КАК ПараметрыАмортизации
	|
	|ГДЕ
	|	ПараметрыАмортизации.НачислятьАмортизациюБУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&КонецМесяца                                                      КАК Дата,
	|	ПараметрыАмортизации.Организация                                  КАК Организация,
	|	ПараметрыАмортизации.ОсновноеСредство                             КАК ВнеоборотныйАктив,
	|
	|	ВЫБОР 
	|		КОГДА ПараметрыАмортизации.НачислятьАмортизациюНУ 
	|			ТОГДА ПараметрыАмортизации.МетодНачисленияАмортизацииНУ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК МетодНачисленияНУ,
	|
	|	ВЫБОР 
	|		КОГДА ПараметрыАмортизации.НачислятьАмортизациюНУ 
	|			ТОГДА ПараметрыАмортизации.СрокПолезногоИспользованияНУ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СрокИспользованияНУ,
	|
	|	ВЫБОР
	|		КОГДА НЕ ПараметрыАмортизации.НачислятьАмортизациюНУ 
	|			ТОГДА 0
	|		КОГДА ПараметрыАмортизации.МетодНачисленияАмортизацииНУ = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Линейный) 
	|			ТОГДА ПараметрыАмортизации.СтоимостьНУНачальныйОстаток 
	|					- ПараметрыАмортизации.АмортизационнаяПремия 
	|					- ПараметрыАмортизации.АмортизацияПриПереходеКЛинейномуМетоду
	|		ИНАЧЕ ПараметрыАмортизации.СтоимостьНУНачальныйОстаток 
	|				- ПараметрыАмортизации.АмортизационнаяПремия 
	|				- ПараметрыАмортизации.АмортизацияНУНачальныйОстаток                    
	|	КОНЕЦ КАК СтоимостьНУ,
	|
	|	ВЫБОР 
	|		КОГДА ПараметрыАмортизации.НачислятьАмортизациюНУ 
	|			ТОГДА ПараметрыАмортизации.СпециальныйКоэффициентНУ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентНУ,
	|
	|	ВЫБОР 
	|		КОГДА ПараметрыАмортизации.НачислятьАмортизациюНУ 
	|			ТОГДА ПараметрыАмортизации.НормаАмортизации
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НормаАмортизацииНУ
	|
	|ИЗ
	|	СписокОССПараметрами_НУ КАК ПараметрыАмортизации
	|
	|ГДЕ
	|	ПараметрыАмортизации.НачислятьАмортизациюНУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&КонецМесяца                                                      КАК Дата,
	|	ПараметрыАмортизации.Организация                                  КАК Организация,
	|	ПараметрыАмортизации.ОсновноеСредство                             КАК ВнеоборотныйАктив,
	
	// УУ
	|	ПараметрыАмортизации.МетодНачисленияАмортизации                   КАК МетодНачисленияУУ,
	|	ПараметрыАмортизации.ОстаточнаяСтоимость                          КАК СтоимостьУУ,
	|	ПараметрыАмортизации.ЛиквидационнаяСтоимость                      КАК ЛиквидационнаяСтоимость,
	|	ПараметрыАмортизации.РесурсНазначенный                            КАК СрокИспользованияУУ,
	|	ПараметрыАмортизации.РесурсВыработанныйЗаТекущийПериод            КАК РесурсВыработанныйЗаТекущийПериод,
	|	ПараметрыАмортизации.РесурсВыработанныйЗаПрошлыйПериод            КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	ПараметрыАмортизации.ОтработанныхМесяцевПолныхЛет                 КАК ОтработанныхМесяцевПолныхЛет,
	|	ПараметрыАмортизации.КоэффициентУскорения                         КАК КоэффициентУскоренияУУ
	|ИЗ
	|	СписокОССПараметрами_УУ КАК ПараметрыАмортизации
	|ГДЕ
	|	ПараметрыАмортизации.НачислятьАмортизацию";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(ПараметрыРасчета.Период));
	
	Результат = Запрос.ВыполнитьПакет();
	
	ПараметрыАмортизации_БУ = Результат[0].Выгрузить();
	ПараметрыАмортизации_НУ = Результат[1].Выгрузить();
	ПараметрыАмортизации_УУ = Результат[2].Выгрузить();

	СписокПараметровАмортизации = ПолучитьИзВременногоХранилища(ПараметрыРасчета.АдресПараметровРасчета);
	
	Если СписокПараметровАмортизации = Неопределено Тогда
		СписокПараметровАмортизации = Новый Структура;
		СписокПараметровАмортизации.Вставить("ПараметрыАмортизации_БУ", ПараметрыАмортизации_БУ);
		СписокПараметровАмортизации.Вставить("ПараметрыАмортизации_НУ", ПараметрыАмортизации_НУ);
		СписокПараметровАмортизации.Вставить("ПараметрыАмортизации_УУ", ПараметрыАмортизации_УУ);
	Иначе
		ОбщегоНазначенияУТКлиентСервер.ДополнитьТаблицу(СписокПараметровАмортизации.ПараметрыАмортизации_БУ, ПараметрыАмортизации_БУ);
		ОбщегоНазначенияУТКлиентСервер.ДополнитьТаблицу(СписокПараметровАмортизации.ПараметрыАмортизации_НУ, ПараметрыАмортизации_НУ);
		ОбщегоНазначенияУТКлиентСервер.ДополнитьТаблицу(СписокПараметровАмортизации.ПараметрыАмортизации_УУ, ПараметрыАмортизации_УУ);
	КонецЕсли; 
	
	ПоместитьВоВременноеХранилище(СписокПараметровАмортизации, ПараметрыРасчета.АдресПараметровРасчета);
	
КонецПроцедуры

// 
// Параметры:
//  ПараметрыТекстаЗапроса - см. ПараметрыТекстаЗапросаСуммаАмортизацииБУ
// 
// Возвращаемое значение:
//  Строка - Текст запроса сумма амортизации БУ
Функция ТекстЗапросаСуммаАмортизацииБУ(ПараметрыТекстаЗапроса) Экспорт
	
	ТекстЗапроса =
	"ВЫБОР 
	|	КОГДА НЕ СписокОС.НачислятьАмортизациюБУ ТОГДА
	|		0
	|
	|	КОГДА СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|			И ((СписокОС.ОстаточнаяСтоимостьРегл - &СуммаДоначисления - &ОстатокОбесценения) <= 0 
	|				ИЛИ СписокОС.РесурсВыработанныйЗаТекущийПериод <= 0)
	|		ТОГДА 0
	|
	|	КОГДА СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|			И (СписокОС.РесурсВыработанныйЗаПрошлыйПериод + СписокОС.РесурсВыработанныйЗаТекущийПериод) >= СписокОС.РесурсНазначенный
	|		ТОГДА СписокОС.ОстаточнаяСтоимостьРегл - &СуммаДоначисления - СписокОС.ЛиквидационнаяСтоимость - &ОстатокОбесценения
	|
		// Линейный, ПропорциональноОбъемуПродукции
	|	КОГДА СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|			И СписокОС.МетодНачисленияАмортизацииБУ В (
	|					ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.Линейный),
	|					ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)) 
	|
	|		ТОГДА ВЫБОР 
	|			КОГДА СписокОС.ЭтоДоначисление
	|				ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(&СтоимостьДляВычисленияАмортизации - &СуммаДоначисления КАК ЧИСЛО(20,8))
	|								* ВЫРАЗИТЬ(СписокОС.РесурсВыработанныйЗаТекущийПериод КАК ЧИСЛО(20,8)) 
	|								/ ВЫРАЗИТЬ(СписокОС.РесурсНазначенный - СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
	|
	|			ИНАЧЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(&СтоимостьДляВычисленияАмортизации - &СуммаДоначисления - &ЛиквидационнаяСтоимость - &ОстатокОбесценения КАК ЧИСЛО(20,8)) 
	|								* ВЫРАЗИТЬ(СписокОС.РесурсВыработанныйЗаТекущийПериод КАК ЧИСЛО(20,8))
	|								/ ВЫРАЗИТЬ(СписокОС.РесурсНазначенный - СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
	|		КОНЕЦ
	|
		// УменьшаемогоОстатка (последний год)
	|	КОГДА СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|			И СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка)
	|			И (СписокОС.РесурсНазначенный - СписокОС.РесурсВыработанныйЗаПрошлыйПериод - СписокОС.РесурсВыработанныйЗаТекущийПериод) <= 12 
	|
	|		ТОГДА ВЫБОР 
	|			КОГДА СписокОС.ЭтоДоначисление
	|				ТОГДА ВЫРАЗИТЬ((СписокОС.СтоимостьДляВычисленияАмортизации - &СуммаДоначисления)
	|								* ВЫРАЗИТЬ(СписокОС.РесурсВыработанныйЗаТекущийПериод КАК ЧИСЛО(20,8)) 
	|								/ ВЫРАЗИТЬ(СписокОС.РесурсНазначенный - СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
	|
	|			ИНАЧЕ ВЫРАЗИТЬ((СписокОС.СтоимостьДляВычисленияАмортизации - &СуммаДоначисления - СписокОС.ЛиквидационнаяСтоимость) 
	|								* ВЫРАЗИТЬ(СписокОС.РесурсВыработанныйЗаТекущийПериод КАК ЧИСЛО(20,8))
	|								/ ВЫРАЗИТЬ(СписокОС.РесурсНазначенный - СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
	|		КОНЕЦ
	|
		// УменьшаемогоОстатка (до последнего года)
	|	КОГДА СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|			И СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка) 
	|   
	|		ТОГДА ВЫРАЗИТЬ((СписокОС.СтоимостьДляВычисленияАмортизации - &СуммаДоначисления)
	|					* СписокОС.КоэффициентУскоренияБУ
	|					* ВЫРАЗИТЬ(СписокОС.РесурсВыработанныйЗаТекущийПериод КАК ЧИСЛО(20,8))
	|					/ ВЫРАЗИТЬ(СписокОС.РесурсНазначенный 
	|						- СписокОС.КоэффициентУскоренияБУ * (СписокОС.РесурсВыработанныйЗаПрошлыйПериод - СписокОС.ОтработанныхМесяцевПолныхЛет) КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
	|
		// Линейный
	|	КОГДА НЕ СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|			И СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.Линейный)
	|		ТОГДА ВЫБОР 
	|			КОГДА СписокОС.СрокИспользованияДляВычисленияАмортизации = 0
	|				ТОГДА 0
	|			КОГДА СписокОС.ГрафикАмортизации = ЗНАЧЕНИЕ(Справочник.ГодовыеГрафикиАмортизацииОС.ПустаяСсылка) 
	|				ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(СписокОС.СтоимостьДляВычисленияАмортизации КАК ЧИСЛО(20,8))
	|								/ ВЫРАЗИТЬ(СписокОС.СрокИспользованияДляВычисленияАмортизации КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
	|			ИНАЧЕ
	|				ВЫРАЗИТЬ(ВЫРАЗИТЬ(СписокОС.СтоимостьДляВычисленияАмортизации * 12 КАК ЧИСЛО(20,8))
	|						/ ВЫРАЗИТЬ(СписокОС.СрокИспользованияДляВычисленияАмортизации КАК ЧИСЛО(20,8)) 
	|						* ВЫРАЗИТЬ(СписокОС.КоэффициентПериода КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
	|		КОНЕЦ
	|   
		// ПропорциональноОбъемуПродукции
	|	КОГДА НЕ СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|			И СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)
	|		ТОГДА ВЫБОР 
	|			КОГДА СписокОС.ОбъемВыработки <> 0 
	|					И СписокОС.ОбъемПродукцииРаботДляВычисленияАмортизации <> 0 
	|				ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(СписокОС.СтоимостьДляВычисленияАмортизации КАК ЧИСЛО(20,8))
	|								* ВЫРАЗИТЬ(СписокОС.ОбъемВыработки КАК ЧИСЛО(20,8))
	|								/ ВЫРАЗИТЬ(СписокОС.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|
		// ПоЕНАОФ
	|	КОГДА НЕ СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|			И СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПоЕНАОФ)
	|		ТОГДА ВЫБОР 
	|			КОГДА СписокОС.КоэффициентАмортизацииБУ <> 0 ТОГДА
	|				ВЫБОР 
	|					КОГДА СписокОС.ГрафикАмортизации = ЗНАЧЕНИЕ(Справочник.ГодовыеГрафикиАмортизацииОС.ПустаяСсылка) 
	|						ТОГДА ВЫРАЗИТЬ(СписокОС.СтоимостьДляВычисленияАмортизации * СписокОС.КоэффициентАмортизацииБУ / 100 / 12 КАК ЧИСЛО(31,2))
	|					ИНАЧЕ
	|						ВЫРАЗИТЬ(СписокОС.СтоимостьДляВычисленияАмортизации * СписокОС.КоэффициентАмортизацииБУ / 100 * СписокОС.КоэффициентПериода КАК ЧИСЛО(31,2))
	|				КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|
		// ПоЕНАОФНа1000кмПробега
	|	КОГДА НЕ СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|			И СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПоЕНАОФНа1000кмПробега) ТОГДА
	|		ВЫБОР 
	|			КОГДА СписокОС.ОбъемВыработки <> 0 И СписокОС.КоэффициентАмортизацииБУ <> 0 
	|				ТОГДА ВЫРАЗИТЬ(СписокОС.СтоимостьДляВычисленияАмортизации * СписокОС.ОбъемВыработки / 1000 * СписокОС.КоэффициентАмортизацииБУ / 100 КАК ЧИСЛО(31,2))
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|
		// УменьшаемогоОстатка
	|	КОГДА НЕ СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|			И СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка) ТОГДА
	|		ВЫБОР 
	|			КОГДА СписокОС.СрокИспользованияДляВычисленияАмортизации = 0
	|				ТОГДА 0
	|			КОГДА СписокОС.ГрафикАмортизации = ЗНАЧЕНИЕ(Справочник.ГодовыеГрафикиАмортизацииОС.ПустаяСсылка) ТОГДА
	|				ВЫБОР
	|					КОГДА ГОД(СписокОС.ДатаПоследнегоИзменения) = ГОД(&КонецМесяца) 
	|						ТОГДА ВЫРАЗИТЬ(СписокОС.СтоимостьДляВычисленияАмортизации 
	|										/ СписокОС.СрокИспользованияДляВычисленияАмортизации 
	|										* СписокОС.КоэффициентУскоренияБУ КАК ЧИСЛО(31,2))
	|					ИНАЧЕ
	|						ВЫРАЗИТЬ(СписокОС.СтоимостьНаНачалоГода 
	|									/ СписокОС.СрокИспользованияДляВычисленияАмортизации 
	|									* СписокОС.КоэффициентУскоренияБУ КАК ЧИСЛО(31,2))
	|				КОНЕЦ 
	|			ИНАЧЕ
	|				ВЫБОР
	|					КОГДА ГОД(СписокОС.ДатаПоследнегоИзменения) = ГОД(&КонецМесяца) ТОГДА
	|						ВЫРАЗИТЬ(СписокОС.СтоимостьДляВычисленияАмортизации 
	|							/ СписокОС.СрокИспользованияДляВычисленияАмортизации * 12 
	|							* СписокОС.КоэффициентПериода 
	|							* СписокОС.КоэффициентУскоренияБУ КАК ЧИСЛО(31,2))
	|					ИНАЧЕ
	|						ВЫРАЗИТЬ(СписокОС.СтоимостьНаНачалоГода 
	|							/ СписокОС.СрокИспользованияДляВычисленияАмортизации * 12 
	|							* СписокОС.КоэффициентПериода 
	|							* СписокОС.КоэффициентУскоренияБУ КАК ЧИСЛО(31,2))
	|				КОНЕЦ
	|		КОНЕЦ 
	|
		// ПоСуммеЧиселЛетИспользования
	|	КОГДА НЕ СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|			И СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПоСуммеЧиселЛетИспользования) ТОГДА
	|		ВЫБОР 
	|			КОГДА СписокОС.ГрафикАмортизации = ЗНАЧЕНИЕ(Справочник.ГодовыеГрафикиАмортизацииОС.ПустаяСсылка) ТОГДА
	|				ВЫРАЗИТЬ(СписокОС.СтоимостьДляВычисленияАмортизации * &ЧислоЛетОставшихся / &СуммаЧиселЛет / 12 КАК ЧИСЛО(31,2))
	|			ИНАЧЕ
	|				ВЫРАЗИТЬ(СписокОС.СтоимостьДляВычисленияАмортизации * &ЧислоЛетОставшихся / &СуммаЧиселЛет * СписокОС.КоэффициентПериода КАК ЧИСЛО(31,2))
	|		КОНЕЦ
	|
	|КОНЕЦ";
	 
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЧислоЛетОставшихся", "(СписокОС.ЧислоЛетПользования - СписокОС.ЧислоПрошедшихЛет)");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаЧиселЛет", "((СписокОС.ЧислоЛетПользования + 1) * СписокОС.ЧислоЛетПользования / 2)");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СтоимостьДляВычисленияАмортизации", ПараметрыТекстаЗапроса.ТекстСтоимостьДляВычисленияАмортизации);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОстаточнаяСтоимость", ПараметрыТекстаЗапроса.ТекстОстаточнаяСтоимость);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЛиквидационнаяСтоимость", ПараметрыТекстаЗапроса.ТекстЛиквидационнаяСтоимость);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СтоимостьНаНачалоГода", ПараметрыТекстаЗапроса.ТекстСтоимостьНаНачалоГода);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаДоначисления", ПараметрыТекстаЗапроса.ТекстСуммаДоначисления);
	
	ТекстОбесценение = 
		СтрЗаменить(
			"(ВЫБОР КОГДА СписокОС.ВариантПроводокПоОбесценениюВНА = &ДоначислятьКорректировкуОбесценения ТОГДА &ОстатокОбесценения ИНАЧЕ 0 КОНЕЦ)", 
			"&ОстатокОбесценения",
			ПараметрыТекстаЗапроса.ТекстОбесценение);			
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОстатокОбесценения", ТекстОбесценение);
	
	Возврат ТекстЗапроса;
	
КонецФункции

// 
// Возвращаемое значение:
//  Строка - Текст запроса
Функция ТекстЗапросаСуммаАмортизацииНУ() Экспорт

	ТекстЗапроса =
	"ВЫБОР 
	|	КОГДА НЕ СписокОС.НачислятьАмортизациюНУ
	|		ТОГДА 0
	|
	|	КОГДА СписокОС.МетодНачисленияАмортизацииНУ = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Линейный)
	|		ТОГДА ВЫБОР 
	|			КОГДА (СписокОС.СрокПолезногоИспользованияНУ - СписокОС.ФактическийСрокПриПереходеКЛинейномуМетоду) > 0 
	|				ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(СписокОС.СтоимостьНУНачальныйОстаток - СписокОС.АмортизационнаяПремия - СписокОС.АмортизацияПриПереходеКЛинейномуМетоду КАК ЧИСЛО(20,8))
	|								* ВЫРАЗИТЬ(СписокОС.СпециальныйКоэффициентНУ КАК ЧИСЛО(20,8)) 
	|								/ ВЫРАЗИТЬ(СписокОС.СрокПолезногоИспользованияНУ - СписокОС.ФактическийСрокПриПереходеКЛинейномуМетоду КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
	|
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|
	|	КОГДА СписокОС.МетодНачисленияАмортизацииНУ = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Нелинейный)
	|		ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(СписокОС.СтоимостьНУНачальныйОстаток - СписокОС.АмортизационнаяПремия - СписокОС.АмортизацияНУНачальныйОстаток КАК ЧИСЛО(20,8))
	|							* ВЫРАЗИТЬ(СписокОС.НормаАмортизации / 100 КАК ЧИСЛО(20,8))
	|							* ВЫРАЗИТЬ(СписокОС.СпециальныйКоэффициентНУ КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
	|КОНЕЦ";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаСуммаОбесценения()
	
	ТекстЗапроса = 
	"ВЫБОР 
	|	КОГДА НЕ СписокОС.НачислятьАмортизациюБУ 
	|		ИЛИ &ОстатокОбесценения <= 0
	|		ИЛИ НЕ СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|
	|		ТОГДА 0
	|
	|	КОГДА (СписокОС.РесурсВыработанныйЗаПрошлыйПериод + СписокОС.РесурсВыработанныйЗаТекущийПериод) >= СписокОС.РесурсНазначенный
	|
	|		ТОГДА &ОстатокОбесценения
	|
		// Линейный, ПропорциональноОбъемуПродукции
	|	КОГДА СписокОС.МетодНачисленияАмортизацииБУ В (
	|						ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.Линейный),
	|						ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)) 
	|
	|		ТОГДА ВЫРАЗИТЬ(&ОстатокОбесценения 
	|							* (ВЫРАЗИТЬ(СписокОС.РесурсВыработанныйЗаТекущийПериод КАК ЧИСЛО(20,8))
	|							/ ВЫРАЗИТЬ(СписокОС.РесурсНазначенный - СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК ЧИСЛО(20,8))) КАК ЧИСЛО(31,2))
	|
	|	ИНАЧЕ 0
	|
	|КОНЕЦ";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОстатокОбесценения", "СписокОС.ОстатокОбесцененияРегл");
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Параметры текста запроса сумма амортизации БУ.
// 
// Возвращаемое значение:
//  Структура - свойства:
// 		* ТекстСтоимостьДляВычисленияАмортизации - Строка - 
//		* ТекстОстаточнаяСтоимость - Строка -
// 		* ТекстЛиквидационнаяСтоимость - Строка -
// 		* ТекстСтоимостьНаНачалоГода - Строка -
// 		* ТекстСуммаДоначисления - Строка -
// 		* ТекстОбесценение - Строка -
Функция ПараметрыТекстаЗапросаСуммаАмортизацииБУ() Экспорт

	ПараметрыТекстаЗапроса = Новый Структура;
	ПараметрыТекстаЗапроса.Вставить("ТекстСтоимостьДляВычисленияАмортизации", "0");
	ПараметрыТекстаЗапроса.Вставить("ТекстОстаточнаяСтоимость", "0");
	ПараметрыТекстаЗапроса.Вставить("ТекстЛиквидационнаяСтоимость", "0");
	ПараметрыТекстаЗапроса.Вставить("ТекстСтоимостьНаНачалоГода", "0");
	ПараметрыТекстаЗапроса.Вставить("ТекстСуммаДоначисления", "0");
	ПараметрыТекстаЗапроса.Вставить("ТекстОбесценение", "0");
	
	Возврат ПараметрыТекстаЗапроса;
	
КонецФункции

#КонецОбласти

//-- Локализация

#КонецОбласти
