
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - см. ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
	
КонецПроцедуры

// Вызывается перед загрузкой новых настроек. Используется для изменения схемы компоновки.
//
// Параметры:
//	Контекст							- Произвольный								- параметры контекста, в котором используется отчет.
//	КлючСхемы							- Строка									- идентификатор текущей схемы компоновщика настроек.
//	КлючВарианта						- Строка									- имя предопределенного или уникальный идентификатор пользовательского
//																						варианта отчета.
//										- Неопределено 								- вызов для варианта расшифровки или без контекста.
//	НовыеНастройкиКД					- НастройкиКомпоновкиДанных					- настройки варианта отчета, которые будут загружены
//																						в компоновщик настроек после его инициализации.
//										- Неопределено 								- настройки варианта не надо загружать (уже загружены ранее).
//	НовыеПользовательскиеНастройкиКД	- ПользовательскиеНастройкиКомпоновкиДанных - пользовательские настройки, которые будут загружены в компоновщик
//																						настроек после его инициализации.
//										- Неопределено 								- пользовательские настройки не надо загружать (уже загружены ранее).
//
Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт
	
	Если ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") Тогда
		
		Если НовыеПользовательскиеНастройкиКД = Неопределено Тогда
			ПользовательскиеНастройки = Контекст.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки; // ПользовательскиеНастройкиКомпоновкиДанных -
			НастроитьПараметрыОтчетаПоВариантуОтчета(Контекст.НастройкиОтчета, НовыеНастройкиКД, ПользовательскиеНастройки);
		Иначе
			НастроитьПараметрыОтчетаПоВариантуОтчета(Контекст.НастройкиОтчета, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД);
		КонецЕсли;
		
		НастроитьПараметрыОтборыПоФункциональнымОпциям(НовыеНастройкиКД);
		
		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, СхемаКомпоновкиДанных, КлючСхемы);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("Материалы",
		НСтр("ru = 'Материалы'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ПоступилоСоСклада",
		НСтр("ru = 'Поступило со склада или кладовых других цехов и приходы по перемещениям'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ПоступилоВНЗП",
		НСтр("ru = 'Поступило со склада в незавершенное производство'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("Расходы",
		НСтр("ru = 'Расходы по перемещениям, передачи на склад, в другие кладовые, в производство'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("СписанияНаРасходы",
		НСтр("ru = 'Списания на расходы'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ПриходыОтПостащиков",
		НСтр("ru = 'Приходы от поставщика и выпуски продукции'"));
	
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("Постатейные",
		НСтр("ru = 'Постатейные'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("НачальныйОстаток",
		НСтр("ru = 'Начальный остаток'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("Регистрация",
		НСтр("ru = 'Закупка услуг, регистрация, отражение зарплаты'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("РаспределениеНаПроизводство",
		НСтр("ru = 'Распределение на производство'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("Выбытие",
		НСтр("ru = 'Списание на другие статьи, выбытие'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("Перенос",
		НСтр("ru = 'Перенос на другой объект возникновения затрат'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("КонечныйОстаток",
		НСтр("ru = 'Конечный остаток'"));
		
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("Производство",
		НСтр("ru = 'Производство'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ПоступилоМатериалы22",
		НСтр("ru = 'Поступило на незавершенное производство (материалы) для 2.2'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ПоступилоМатериалы21",
		НСтр("ru = 'Поступило на незавершенное производство (материалы) для 2.1'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ПоступилоОтходы",
		НСтр("ru = 'Поступило на незавершенное производство (отходы по фиксированной стоимости)'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ПоступилоУслуги22",
		НСтр("ru = 'Поступило на незавершенное производство (услуги переработчика) для 2.2'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("Расход22",
		НСтр("ru = 'Расход из незавершенного производства (материалы) для 2.2'"));	
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("Расход21",
		НСтр("ru = 'Расход из незавершенного производства (материалы) для 2.1'"));
		
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("НачальныйОстатокТрудозатраты22",
		НСтр("ru = 'Начальный остаток (трудозатраты) для 2.2'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("НачальныйОстатокТрудозатраты21",
		НСтр("ru = 'Начальный остаток (трудозатраты) для 2.1'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ПоступилоТрудозатраты22",
		НСтр("ru = 'Поступило на незавершенное производство (трудозатраты) для 2.2'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ПоступилоТрудозатраты21",
		НСтр("ru = 'Поступило на незавершенное производство (трудозатраты) для 2.1'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("РасходТрудозатраты22",
		НСтр("ru = 'Расход из незавершенного производства (трудозатраты) для 2.2'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("РасходТрудозатраты21",
		НСтр("ru = 'Расход из незавершенного производства (трудозатраты) для 2.1'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("КонечныйОстатокТрудозатраты22",
		НСтр("ru = 'Конечный остаток (трудозатраты) для 2.2'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("КонечныйОстатокТрудозатраты21",
		НСтр("ru = 'Конечный остаток (трудозатраты) для 2.1'"));
		
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("НачальныйОстатокПостатейные22",
		НСтр("ru = 'Начальный остаток (постатейные) для 2.2'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("НачальныйОстатокПостатейные21",
		НСтр("ru = 'Начальный остаток (постатейные) для 2.1'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ПоступилоПостатейные22",
		НСтр("ru = 'Поступило на незавершенное производство (постатейные) для 2.2'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ПоступилоПостатейные21",
		НСтр("ru = 'Поступило на незавершенное производство (постатейные) для 2.1'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("РасходПостатейные22",
		НСтр("ru = 'Расход из незавершенного производства (постатейные) для 2.2'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("РасходПостатейные21",
		НСтр("ru = 'Расход из незавершенного производства (постатейные) для 2.1'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("КонечныйОстатокПостатейные22",
		НСтр("ru = 'Конечный остаток (трудозатраты) для 2.2'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("КонечныйОстатокПостатейные21",
		НСтр("ru = 'Конечный остаток (трудозатраты) для 2.1'"));
		
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("Материальные",
		НСтр("ru = 'Материальные'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("Услуги",
		НСтр("ru = 'Услуги'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("Трудозатраты",
		НСтр("ru = 'Трудозатраты'"));
	
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ВклИсклНДС",
		НСтр("ru = 'Вкл./искл. НДС'"));
	
	ПараметрПериодОтчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиОтчета, "Период");
	ПараметрПериодОтчетаЗначение = ПараметрПериодОтчета.Значение; //СтандартныйПериод
	БезОтбораПоПериоду = Не ПараметрПериодОтчета.Использование;
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НастройкиОтчета, "БезОтбораПоПериоду", БезОтбораПоПериоду);

	БезОтбораПоПериодуНачало = БезОтбораПоПериоду ИЛИ НЕ ЗначениеЗаполнено(ПараметрПериодОтчетаЗначение.ДатаНачала);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НастройкиОтчета, "БезОтбораПоПериодуНачало", БезОтбораПоПериодуНачало);
	
	ОсновнойНаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Основной; // НаборДанныхОбъединениеСхемыКомпоновкиДанных
	ЗапросыНабора = ОсновнойНаборДанных.Элементы;
	
	ЗапросТМЦ = ЗатратыСервер.ТекстЗапросаПроизводственныеЗатратыТМЦ();
	ЗапросыНабора.ТМЦ.Запрос = ЗапросТМЦ.ТекстЗапроса;
	
	ЗапросПостатейные = ЗатратыСервер.ТекстЗапросаПроизводственныеЗатратыПостатейные();
	ЗапросыНабора.Постатейные.Запрос = ЗапросПостатейные.ТекстЗапроса;
	
	ЗапросПартии = ЗатратыСервер.ТекстЗапросаПроизводственныеЗатратыПоПартиямПроизводства();
	ЗапросыНабора.ПартииПроизводства.Запрос = ЗапросПартии.ТекстЗапроса;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	
	ОсновнойНаборДанных = МакетКомпоновки.НаборыДанных.Основной; // НаборДанныхОбъединениеСхемыКомпоновкиДанных
	ЗапросыНабора = ОсновнойНаборДанных.Элементы;

	ЗатратыСервер.ДобавитьОтборПоВыбраннымРесурсам(ЗапросТМЦ.Ресурсы, ЗапросыНабора.ТМЦ);
	ЗатратыСервер.ДобавитьОтборПоВыбраннымРесурсам(ЗапросПостатейные.Ресурсы, ЗапросыНабора.Постатейные);
	ЗатратыСервер.ДобавитьОтборПоВыбраннымРесурсам(ЗапросПартии.Ресурсы, ЗапросыНабора.ПартииПроизводства);
	
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина, Ложь);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Настраивает доступные значения у параметра компоновки данных "Данные по себестоимости" в зависимости от варианта.
// 
// Параметры:
//	Документ - ДокументСсылка.РаспределениеПрочихЗатрат - расшифровывающийся документ.
//	НовыеНастройкиКД - НастройкиКомпоновкиДанных - переопределяемые настройки отчета.
//	НовыеПользовательскиеНастройкиКД - ПользовательскиеНастройкиКомпоновкиДанных - настройки схемы компоновки данных.
Процедура НастроитьПараметрыОтчетаПоВариантуОтчета(НастройкиОтчета, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД)
	
	ПредопределенныйВариант = ПолучитьПредопределенныйВариант(НастройкиОтчета.ВариантСсылка);
	
	ПараметрДанныеОтчета = СхемаКомпоновкиДанных.Параметры.Найти("ДанныеПоСебестоимости");
	ПараметрПоПредприятию = СхемаКомпоновкиДанных.Параметры.Найти("ПоПредприятию");
	
	СписокВыбора = Новый СписокЗначений;
	
	Если ПредопределенныйВариант.КлючВарианта = "ДвижениеТМЦиПроизводственныеЗатратыПоПредприятию" Тогда
		
		СписокВыбора.Добавить(1, НСтр("ru = 'В валюте упр. учета с НДС'"));
		СписокВыбора.Добавить(2, НСтр("ru = 'В валюте упр. учета без НДС'"));
		ПараметрПоПредприятию.Значение = Истина;
		
	Иначе
		
		Если РасчетСебестоимостиПовтИсп.УправленческийУчетОрганизаций() Тогда
			СписокВыбора.Добавить(3, НСтр("ru = 'В валюте упр. учета'"));
		КонецЕсли;
		СписокВыбора.Добавить(4, НСтр("ru = 'В валюте регл. учета'"));
		ПараметрПоПредприятию.Значение = Ложь;
		
	КонецЕсли;
	
	ПараметрДанныеОтчета.УстановитьДоступныеЗначения(СписокВыбора);
	
	Если НовыеНастройкиКД = Неопределено
		Или НовыеПользовательскиеНастройкиКД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеПараметраДанныеОтчета = НовыеНастройкиКД.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДанныеПоСебестоимости"));
	НастройкаДанныеОтчета = НовыеПользовательскиеНастройкиКД.Элементы.Найти(ЗначениеПараметраДанныеОтчета.ИдентификаторПользовательскойНастройки);
	
	Если Не НастройкаДанныеОтчета = Неопределено
		И СписокВыбора.НайтиПоЗначению(НастройкаДанныеОтчета.Значение) = Неопределено Тогда
		НастройкаДанныеОтчета.Значение = СписокВыбора[0].Значение;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПредопределенныйВариант(Знач Вариант)
	
	КлючиВариантов = Новый Массив;
	КлючиВариантов.Добавить("ДвижениеТМЦиПроизводственныеЗатраты");
	КлючиВариантов.Добавить("ДвижениеТМЦиПроизводственныеЗатратыПоПредприятию");
	
	// Если вариант не задан, то возьмем первый из списка по умолчанию
	Если Вариант = Неопределено Тогда
		Возврат Новый Структура("КлючВарианта", КлючиВариантов[0]);
	КонецЕсли;
	
	Пока КлючиВариантов.Найти(Вариант.КлючВарианта) = Неопределено
		И ЗначениеЗаполнено(Вариант.Родитель) Цикл
		Вариант = Вариант.Родитель;
	КонецЦикла;
	
	Возврат Вариант;
	
КонецФункции

Процедура НастроитьПараметрыОтборыПоФункциональнымОпциям(КомпоновщикНастроекФормы)
	
	Если ПолучитьФункциональнуюОпцию("КомплекснаяАвтоматизация") Тогда
		КомпоновкаДанныхСервер.УдалитьЭлементОтбораИзВсехНастроекОтчета(КомпоновщикНастроекФормы, "ЗаказНаПроизводство");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли