////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции планирования производства
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Переводит время из заданных единиц времени в секунды
//
// Параметры:
//  Время					 - Число								 - время
//  ЕдиницаИзмеренияВремени	 - ПеречислениеСсылка.ЕдиницыИзмеренияВремени	 - единица измерения времени.
// 
// Возвращаемое значение:
//   - Число - время в секундах
//
Функция ПолучитьВремяВСекундах(Время, ЕдиницаИзмеренияВремени) Экспорт
	
	Если Время = 0 Тогда
		
		Возврат 0;
		
	КонецЕсли;
	
	Если ЕдиницаИзмеренияВремени = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.Сутки") 
		ИЛИ ЕдиницаИзмеренияВремени = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.День") Тогда
		
		ВремяВСекундах = Время * 86400; // 60 * 60 * 24
		
	ИначеЕсли ЕдиницаИзмеренияВремени = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.Минута") Тогда
		
		ВремяВСекундах = Время * 60;
		
	ИначеЕсли ЕдиницаИзмеренияВремени = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.Час") Тогда
		
		ВремяВСекундах = Время * 3600; //60 * 60;
		
	ИначеЕсли ЕдиницаИзмеренияВремени = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.Секунда") Тогда
		
		ВремяВСекундах = Время;
		
	Иначе
		
		ВремяВСекундах = 0;
		
	КонецЕсли;

	Возврат ВремяВСекундах;
	
КонецФункции

// Переводит время в секундах во время в заданных единицах времени
//
// Параметры:
//  ВремяВСекундах			 - Число								 - время в секундах
//  ЕдиницаИзмеренияВремени	 - ПеречислениеСсылка.ЕдиницыИзмеренияВремени	 - единица измерения времени.
// 
// Возвращаемое значение:
//   - Число - время в единице измерения.
//
Функция ПолучитьВремяВЕдиницеИзмерения(ВремяВСекундах, ЕдиницаИзмеренияВремени) Экспорт
	
	Если ВремяВСекундах = 0 Тогда
		
		Возврат 0;
		
	КонецЕсли;
	
	Если ЕдиницаИзмеренияВремени = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.Сутки")
		ИЛИ ЕдиницаИзмеренияВремени = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.День") Тогда
		
		Время = ВремяВСекундах / 86400; // 60 / 60 / 24;
		
	ИначеЕсли ЕдиницаИзмеренияВремени = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.Минута") Тогда
		
		Время = ВремяВСекундах / 60;
		
	ИначеЕсли ЕдиницаИзмеренияВремени = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.Час") Тогда
		
		Время = ВремяВСекундах / 3600; // 60 / 60;
		
	ИначеЕсли ЕдиницаИзмеренияВремени = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.Секунда") Тогда
		
		Время = ВремяВСекундах;
		
	Иначе
		
		Время = 0;
		
	КонецЕсли;

	Возврат  Время;
	
КонецФункции

// Формирует представление времени в виде строки
//
// Параметры:
//  Время                   - Число - время
//	ЕдиницаИзмеренияВремени - ПеречислениеСсылка.ЕдиницыИзмеренияВремени - есть параметр задан, 
//								то время выводится в формате ед. измерения, иначе используется формат "чч:мм:сс".
//
// Возвращаемое значение:
//   Строка   - Время строкой
//
Функция ПолучитьВремяСтрокой(Знач Время, ЕдиницаИзмеренияВремени = Неопределено) Экспорт

	Результат = "";
	
	Если ЕдиницаИзмеренияВремени = Неопределено Тогда
		
		Если Время < 0 Тогда
			
			Время = -Время;
			Результат = "-"
			
		КонецЕсли;
		
		Если Время >= 3600 Тогда
			
			Результат = Результат + Формат(Цел(Время / 3600), "ЧГ=0") + ":";
			
		КонецЕсли;
		
		Если Время > 0 Тогда
			
			Результат = Результат + Формат(Цел(Время % 3600 / 60), "ЧЦ=2; ЧН=; ЧВН=; ЧГ=0") + ":" + Формат(Время % 60, "ЧЦ=2; ЧН=; ЧВН=; ЧГ=0");
			
		КонецЕсли;
		
	Иначе
		
		Результат = Формат(Время, "ЧРГ=; ЧН=; ЧГ=") + " " + Строка(ЕдиницаИзмеренияВремени);
		
	КонецЕсли;
		
	Возврат Результат;

КонецФункции


//++ Устарело_Производство21


//-- Устарело_Производство21

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ Устарело_Производство21


//-- Устарело_Производство21

#Область Прочее


#КонецОбласти

#КонецОбласти
