
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Обработчик обновления БРО 1.2.2.0
//
Процедура ЗаполнитьМестоХраненияКлюча(ПараметрыОбновления = Неопределено) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаявлениеАбонентаСпецоператораСвязи.Ссылка КАК ЗаявлениеАбонентаСпецоператораСвязи,
	|	ЗаявлениеАбонентаСпецоператораСвязи.ЭлектроннаяПодписьВМоделиСервиса КАК ПодписьСервиса
	|ИЗ
	|	Документ.ЗаявлениеАбонентаСпецоператораСвязи КАК ЗаявлениеАбонентаСпецоператораСвязи
	|ГДЕ
	|	ЗаявлениеАбонентаСпецоператораСвязи.МодельХраненияЗакрытогоКлюча = ЗНАЧЕНИЕ(Перечисление.МодельХраненияЗакрытогоКлюча.ПустаяСсылка)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗаявлениеАбонентаСпецоператораСвязи = Выборка.ЗаявлениеАбонентаСпецоператораСвязи.ПолучитьОбъект();
		
		Если Выборка.ПодписьСервиса Тогда
			ЗаявлениеАбонентаСпецоператораСвязи.МодельХраненияЗакрытогоКлюча = Перечисления.МодельХраненияЗакрытогоКлюча.ВМоделиСервиса;
		Иначе
			ЗаявлениеАбонентаСпецоператораСвязи.МодельХраненияЗакрытогоКлюча = Перечисления.МодельХраненияЗакрытогоКлюча.ЛокальныйКлюч;
		КонецЕсли;
		
		ЗаявлениеАбонентаСпецоператораСвязи.ОбменДанными.Загрузка = Истина;
		
		ЗаявлениеАбонентаСпецоператораСвязи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	КонтекстЭДО = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	КонтекстЭДО.ОбработкаПолученияФормы("Документ", "ЗаявлениеАбонентаСпецоператораСвязи", ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#КонецЕсли



