#Область ПрограммныйИнтерфейс

// Заполняет массив структур, которые будут использованы для начального заполнения и
// восстановления начального заполнения профилей.
//
// Параметры:
//  ОписанияПрофилей - Массив из см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа
//  ПараметрыОбновления - Структура:
//   * ОбновлятьИзмененныеПрофили - Булево - начальное значение Истина.
//   * ЗапретитьИзменениеПрофилей - Булево - начальное значение Истина.
//       Если установить Ложь, тогда поставляемые профили можно не только просматривать, но и редактировать.
//   * ОбновлятьГруппыДоступа     - Булево - начальное значение Истина.
//   * ОбновлятьГруппыДоступаСУстаревшимиНастройками - Булево - начальное значение Ложь.
//       Если установить Истина, то настройки значений, выполненные администратором для
//       вида доступа, который был удален из профиля, будут также удалены из групп доступа.
Процедура ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт

	ВнеоборотныеАктивы.ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления);
	
#Область Описание_профилей_Учет_производства
	// Папка профилей "Производство".
	ОписаниеПапки = УправлениеДоступом.НовоеОписаниеПапкиПрофилейГруппДоступа();
	ОписаниеПапки.Имя           = "Производство";
	ОписаниеПапки.Идентификатор = "be8dcb77-eb81-11eb-81dc-4cedfb6825bf";
	ОписаниеПапки.Наименование  =
		НСтр("ru = 'Производство'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	ОписанияПрофилей.Добавить(ОписаниеПапки);
	
	ДобавитьПрофильЛокальногоДиспетчера(ОписанияПрофилей);
	ДобавитьПрофильТехнолог(ОписанияПрофилей);
	ДобавитьПрофильЭкономистПроизводства(ОписанияПрофилей);
	ДобавитьПрофильМенеджераПоПроизводствуНаСтороне(ОписанияПрофилей);
	ДобавитьПрофильУчастникПланированияПроизводства(ОписанияПрофилей);
#КонецОбласти

//++ НЕ УХ
#Область Описание_профилей_Бюджетирование
	// Папка профилей "Бюджетирование".
	ОписаниеПапки = УправлениеДоступом.НовоеОписаниеПапкиПрофилейГруппДоступа();
	ОписаниеПапки.Имя           = "Бюджетирование";
	ОписаниеПапки.Идентификатор = "05de7c1f-eb81-11eb-81dc-4cedfb6825bf";
	ОписаниеПапки.Наименование  =
		НСтр("ru = 'Бюджетирование'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	ОписанияПрофилей.Добавить(ОписаниеПапки);

	ДобавитьПрофильАдминистраторБюджетнойМодели(ОписанияПрофилей);
	ДобавитьПрофильИсполнительБюджетногоПроцесса(ОписанияПрофилей);
	ДобавитьПрофильКонтролерБюджетирования(ОписанияПрофилей);
	ДобавитьПрофильКоординаторБюджетирования(ОписанияПрофилей);
	ДобавитьПрофильУправлениеЛимитамиПоДаннымБюджетирования(ОписанияПрофилей);
#КонецОбласти
//-- НЕ УХ
	
	ДобавитьПрофильПроверкаФинансовыхДокументов(ОписанияПрофилей);
	
	УправлениеДоступомЛокализация.ДополнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Общие

// Служебная функция. Сделана экспортной для удобства внедренцев.
//
Процедура ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля) Экспорт
	
	УправлениеДоступомУТ.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
КонецПроцедуры

#КонецОбласти

#Область Учет_производства

Процедура ДобавитьПрофильЛокальногоДиспетчера(ОписанияПрофилей)

	// Профиль "Локальный диспетчер производства".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ЛокальныйДиспетчер";
	ОписаниеПрофиля.Идентификатор = "2c1871fb-5fef-408d-adf8-4edcb6ab6c5c";
	ОписаниеПрофиля.Родитель      = "Производство";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Локальный диспетчер производства'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Роли к элементарным функциям.
	ДобавитьРолиЛокальногоДиспетчера(ОписаниеПрофиля);
	
	// КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПроизводство");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Зона ответственности - один или несколько этапов производства.
											|Под профилем выполняются задачи:
											|1. формирование маршрутных листов по графику производства;
											|2. управление незначительными отклонениями внутри этапа;
											|3. корректировка состава технологических операций внутри этапа;
											|4. корректировка используемых ресурсов внутри этапа;
											|5. оперативный анализ загрузки оборудования и наличия ресурсов при выполнении этапа;
											|6. анализ наличия ТМЦ на центральных складах и в цеховой кладовой;
											|7. формирование заявок на перемещение с центральных складов;
											|8. ввод данных инвентаризации НЗП;
											|9. уведомление Главного диспетчера о возникновении глобальных отклонений.'");

	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофильТехнолог(ОписанияПрофилей)
	
	// Профиль "Технолог".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Технолог";
	ОписаниеПрофиля.Идентификатор = "fd7b587b-ad0a-486e-9512-ad99447c8b89";
	ОписаниеПрофиля.Родитель      = "Производство";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Технолог'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПроизводстваВПанелиНавигацииНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБригад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКалендарей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтатейКалькуляции");
	
	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаршрутныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРесурсныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовИНастроекНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
	
	// Документы, добавление.

	
	// Регистры, чтение.
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекПередачиМатериаловВПроизводство");
	//-- Устарело_Производство21

	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	
	// Регистры, добавление изменение.

	
	// Обработки, отчеты.

	
	// КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПроизводство");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем выполняются задачи:
	|1. анализ существующих, доработка и разработка новых технологических процессов;
	|2. расчет расходования сырья и материалов;
	|3. разработка технологической документации (технологических нормативов, инструкций, маршрутных карт и др.);
	|4. разработка технических заданий на проектирование и производство оборудования;
	|5. проведение экспериментальных работ по освоению новых технологических процессов;
	|6. выявление брака, нарушений при работе оборудования на технологических линиях (новых и существующих), анализ причин и их устранение;
	|7. контроль соблюдения технологии производственного процесса и эксплуатации оборудования.'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофильМенеджераПоПроизводствуНаСтороне(ОписанияПрофилей)
	
	// Профиль "Менеджер по производству на стороне".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "МенеджерПоПроизводствуНаСтороне";
	ОписаниеПрофиля.Идентификатор = "7387da7a-e932-11e2-a832-c86000df10d3";
	ОписаниеПрофиля.Родитель      = "Производство";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по производству на стороне'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	///////////////////////////////////////////////////////////////////////
	// Базовые права.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваУТ");
	
	///////////////////////////////////////////////////////////////////////
	// Справочники, чтение.
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСделок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКалендарей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекСчетовУчетаПрочихОпераций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудованияOffline");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРесурсныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтатейКалькуляции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПартийПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	///////////////////////////////////////////////////////////////////////
	// Справочники, добавление изменение.
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("РегистрацияШтрихкодовНоменклатуры");
	
	///////////////////////////////////////////////////////////////////////
	// Регистры, чтение.
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовКлиентовЗаявокНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровКОформлениюДокументовИмпорта");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыпускаПродукцииРегистр");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМоделейФормированияСтоимости");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПереданнойВозвратнойТары");
	//++ Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровПереданныхПереработчику");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровПолученныхОтПереработчика");
	//-- Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровКОформлениюДокументовИмпорта");
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовМатериаловВПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхЗатрат");
	//-- НЕ УТ

	
	///////////////////////////////////////////////////////////////////////
	// Документы, чтение.
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданийНаПеревозку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковВзаиморасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковОПродажахЗаПрошлыеПериоды");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПоФинансовымИнструментам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочиеРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочихАктивовПассивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасчетовПоЭквайрингу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковСПодотчетниками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовБронирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАвансовыхОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаРасходДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовКорректировкиЗадолженности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПередачиТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыданныхДоверенностей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокОбособленногоУчетаЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийУслугПрочихАктивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспределенийРасходовБудущихПериодов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	
	///////////////////////////////////////////////////////////////////////
	// Документы, добавление изменение.
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовОРасхожденияхПослеПередачиПереработчику");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовОРасхожденияхПослеПоступленияОтПереработчика");
	//++ Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовОтПереработчиков");
	//-- Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыданныхДоверенностей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыкуповТоваровХранителем");
	//++ Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовПереработчикам");
	//-- Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовПереработчикам2_5");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокПриобретений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОприходованияИзлишковТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовОСписанииТоваровУХранителя");
	//++ Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовПереработчиков");
	//-- Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовПереработчиков2_5");
	//++ Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачСырьяПереработчикам");
	//-- Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачТоваровХранителю");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПересортицыТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорчиТоваровУХранителя");
	//++ Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоступленийОтПереработчиков");
	//-- Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоступленийТоваровОтХранителя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ЗачетОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявленийОВвозеТоваров");
	
	///////////////////////////////////////////////////////////////////////
	// Обработки, отчеты.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбеспечениеПотребностей");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПередачиВПереработку2_5");
	//++ Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ОтчетыПроизводстваНаСтороне");
	//-- Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ОтчетыПроизводстваНаСтороне2_5");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЭтаповОплатыПоставщику");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрКомандыСостояниеОбеспеченияЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСостояниеОбеспеченияЗаказов");
	
	///////////////////////////////////////////////////////////////////////
	// Видимые подсистемы КИ
	
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПроизводство");
	ОписаниеПрофиля.Роли.Добавить("РазделПроизводствоПроизводствоНаСтороне");
	
	///////////////////////////////////////////////////////////////////////
	// Виды доступа
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен",							"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров",					"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц",				"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры",				"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации",						"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады",							"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен",							"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения",					"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ХозяйственныеОперации",			"Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ТипыОснованийАктаОРасхождениях",	"Предустановленный");
	
	// Х.О. документов передачи на ответ. хранение, договоров контрагентов
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика2_5");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВыкупТоваровПереработчиком");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.КорректировкаОтчетаПереработчика");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПередачаПереработчику2_5");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПересортицаТоваровУПереработчика");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПорчаТоваровУПереработчика");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика2_5");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПроизводствоУПереработчика2_5");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПроизводствоУПереработчикаВСтранахЕАЭС2_5");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.СписаниеТоваровУПереработчика");
	
	// Значения доступа по типам оснований актов о расхождениях
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ПередачаТоваровПереработчику");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ПоступлениеТоваровОтПереработчика");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ВозвратТоваровОтПереработчика");
	
	///////////////////////////////////////////////////////////////////////
	// Дополнительные права.
	
	ОписаниеПрофиля.Роли.Добавить("ОтклонениеОтУсловийПродаж");
	ОписаниеПрофиля.Роли.Добавить("ОтклонениеОтУсловийЗакупок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастройкиПечатиОбъектов");
	ОписаниеПрофиля.Роли.Добавить("СохранениеНастроекПечатиОбъектовПоУмолчанию");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеКурсаВДокументахЗакупки");
	
	УправлениеДоступомЛокализация.ДобавитьРолиМенеджераПоПроизводствуНаСтороне(ОписаниеПрофиля);
	
	///////////////////////////////////////////////////////////////////////
	// Описание поставляемого профиля.
	
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Под профилем выполняются задачи:
					|1. Оформление заказов переработчикам;
					|2. Отражения поступлений от переработчиков и передач переработчикам;
					|3. Оформление отчетов переработчиков о выполнении услуг по переработке.'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьРолиЛокальногоДиспетчера(ОписаниеПрофиля) Экспорт
	
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПроизводстваВПанелиНавигацииНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекСчетовУчетаПрочихОпераций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБригад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРесурсныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКалендарей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСценариевПланирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПартийПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМоделейФормированияСтоимости");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыпускаПродукцииРегистр");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТрудозатратПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекРаспределенияЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтатейКалькуляции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРемонтовРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПартийПроизводственныхЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРемонтов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаСборку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковМатериаловИРаботВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовКлиентовЗаявокНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗначенийПоказателейДляРаспределенияРасходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасценокРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	//++ Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровПолученныхОтПереработчика");
	//-- Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовМатериаловВПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхЗатрат");
	
	// Документы, чтение.
	//++ Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоПроизводствуНаСторонеБезПросмотра");
	//-- Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПереработчикам2_5БезПросмотра");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовПереработчиков2_5БезПросмотра");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачТоваровХранителю");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровОтХранителя");
	
	
	// Справочники, добавление.
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхНакладных");
	//++ Локализация
	//-- Локализация
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыработкиСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктаВыполненныхВнутреннихРабот");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДвиженийПродукцииИМатериалов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводстваБезЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспределенияВозвратныхОтходов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовМатериаловВПроизводство");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремещенияМатериаловВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыпускаПродукции");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачМатериаловВПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовМатериаловИзПроизводства");

	//-- Устарело_Производство21
	
	
	// Регистры, добавление изменение.

	
	// Обработки, отчеты.
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыЛокальногоДиспетчера");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиИДоступностьТоваров");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПараметрыОбеспеченияПотребностей");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОформленияПроизводстваБезЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрФормированияЗаказовПоПланамРаспределениеИПеренос");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрКомандыСостояниеОбеспеченияЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСостояниеОбеспеченияЗаказов");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПолученияМатериаловПоЗаказамНаВнутреннееПотребление");
	//-- Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиФормированиеЗаказовНаПередачуВПроизводствоПоПлану");
	
	
	///////////////////////////////////////////////////////////////////////
	// Виды доступа
	ОписаниеПрофиля.ВидыДоступа.Добавить("ХозяйственныеОперации", "Предустановленный");
	
	// Х.О. документов передачи на ответ. хранение, договоров контрагентов
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика2_5");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПередачаПереработчику2_5");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика2_5");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПроизводствоУПереработчика2_5");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПроизводствоУПереработчикаВСтранахЕАЭС2_5");
	
	// Х.О. документа ДвижениеПродукцииИМатериалов
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПеремещениеПолуфабрикатов");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПеремещениеПолуфабрикатовМеждуФилиалами");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзКладовой");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПередачаМатериаловВКладовую");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратМатериаловИзКладовой");
	
	УправлениеДоступомЛокализация.ДобавитьРолиЛокальногоДиспетчера(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофильЭкономистПроизводства(ОписанияПрофилей)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ЭкономистПроизводства";
	ОписаниеПрофиля.Идентификатор = "86f1e49f-7c35-11e7-9719-708bcd551b9e";
	ОписаниеПрофиля.Родитель      = "Производство";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Экономист производства'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПроизводстваВПанелиНавигацииНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекСчетовУчетаПрочихОпераций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБригад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРесурсныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКалендарей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбъектовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПартийПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНематериальныхАктивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТемЭтаповИсследованийИРазработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	
	
	// Документы, чтение.

	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктаВыполненныхВнутреннихРабот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводстваБезЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспределенияВозвратныхОтходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковВзаиморасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковОПродажахЗаПрошлыеПериоды");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПоФинансовымИнструментам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочиеРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочихАктивовПассивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасчетовПоЭквайрингу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковСПодотчетниками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыработкиСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспределенияПроизводственныхЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	//++ Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоПроизводствуНаСтороне");
	//-- Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПереработчикам2_5");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовПереработчиков2_5");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровНаСклад");
	//++ Локализация
	//-- Локализация
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенияМатериаловВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыпускаПродукции");
	//-- Устарело_Производство21
	
	// Документы, добавление.

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктаВыполненныхВнутреннихРабот");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводстваБезЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспределенияВозвратныхОтходов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспределенияПрочихЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспределенияПроизводственныхЗатрат");
	
	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекРаспределенияЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСтатейКалькуляций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовНастроекДоходовРасходов");
	// Регистры, чтение.
	//++ Локализация
	//-- Локализация
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийОбеспеченияМаршрутныхЛистов");
	//-- Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТрудозатратНезавершенногоПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихРасходовНезавершенногоПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихДоходовРасходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасценокРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМоделейФормированияСтоимости");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыпускаПродукцииРегистр");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТрудозатратПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРемонтовРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПартийПроизводственныхЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРемонтов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковМатериаловИРаботВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗначенийПоказателейДляРаспределенияРасходов");
	//++ Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровПолученныхОтПереработчика");
	//-- Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТМЦВЭксплуатации");

	//-- НЕ УТ
	
	// Регистры расширенной аналитики управленческого учета
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураКонтрагент");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураДоходыРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураНоменклатура");
	
	// Регистры, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеНастроекРаспределенияПостатейныхРасходов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗначенийПоказателейДляРаспределенияРасходов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМоделейФормированияСтоимости");
	
	// Обработки, отчеты.
	ОписаниеПрофиля.Роли.Добавить("ОтчетыГлавногоДиспетчера");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиИДоступностьТоваров");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовВнутреннегоТовародвижения");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПередачиВПереработку2_5");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОформленияПроизводстваБезЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетовПлановойПотребности");
	
	
	// КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПроизводство");
	ОписаниеПрофиля.Роли.Добавить("РазделПроизводствоПроизводствоНаСтороне");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации","ВначалеВсеРазрешены");
	
	УправлениеДоступомЛокализация.ДобавитьРолиЭкономистПроизводства(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Описание = НСтр("ru = 'Зона ответственности - планирование и анализ производственной деятельности.
											|Под профилем выполняются задачи:
											|1. управление распределением расходов на себестоимость продукции;
											|2. формирование и контроль исполнения планов производства;
											|3. план-фактный анализ производственной деятельности;
											|4. анализ себестоимости произведенной продукции.'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
		
КонецПроцедуры

Процедура ДобавитьПрофильУчастникПланированияПроизводства(ОписанияПрофилей)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "УчастникПланированияПроизводства";
	ОписаниеПрофиля.Идентификатор = "47c3f3e8-f57c-11e9-8805-1831bf523f09";
	ОписаниеПрофиля.Родитель      = "Планирование";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Участник планирования производства'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРесурсныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСценариевПланирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановОстатков");
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПлановПроизводства");
	ОписаниеПрофиля.Роли.Добавить("УтверждениеПлановПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПлановОстатков");
	ОписаниеПрофиля.Роли.Добавить("УтверждениеПлановОстатков");
	
	// Регистры чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	
	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиУправлениеПроцессомПланирования");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСбалансированностьПланов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсполнениеПланаПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСостояниеОбеспеченияЗаказов");
	// Дополнительные роли для чтения отчета исполнимости
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыпускаПродукцииРегистр");
	
	// Дополнительные права.
	
	//КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаБюджетированиеИПланирование");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("СценарииТоварногоПланирования", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыПланов","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	
	УправлениеДоступомЛокализация.ДобавитьРолиУчастникПланированияПроизводства(ОписаниеПрофиля);
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем происходит формирование планов производства и контроль их исполнения.'",
		 ОбщегоНазначения.КодОсновногоЯзыка());
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

#КонецОбласти

//++ НЕ УХ
#Область Бюджетирование

Процедура ДобавитьПрофильАдминистраторБюджетнойМодели(ОписанияПрофилей)
	
	// Профиль "Администратор бюджетной модели".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "АдминистраторБюджетнойМодели";
	ОписаниеПрофиля.Идентификатор = "932703ca-6520-11e6-84c0-c860008a2a34";
	ОписаниеПрофиля.Родитель      = "Бюджетирование";
	
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Администратор бюджетной модели (дополнительный)'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБюджетирования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекБюджетирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛимитовРасходаДенежныхСредств");
	
	
	// КИ.
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаБюджетированиеИПланирование");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации",   "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи",  "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыВидовБюджетов",              "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыСтатейИПоказателейБюджетов", "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Сценарии",  "ВначалеВсеЗапрещены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Дополнительный профиль, который назначается пользователям, 
								|выполняющим редактирование НСИ бюджетов и настроек бюджетного процесса.'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофильИсполнительБюджетногоПроцесса(ОписанияПрофилей)
	
	// Профиль "Исполнитель бюджетного процесса (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ИсполнительБюджетногоПроцесса";
	ОписаниеПрофиля.Идентификатор = "932703c8-6520-11e6-84c0-c860008a2a34";
	ОписаниеПрофиля.Родитель      = "Бюджетирование";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Исполнитель бюджетного процесса (дополнительный)'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхБюджетирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБюджетирования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭкземпляровБюджетов");
	ОписаниеПрофиля.Роли.Добавить("УтверждениеЭкземпляровБюджетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛимитовРасходаДенежныхСредств");
	
	
	// КИ.
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаБюджетированиеИПланирование");
	
	//ЦеныСкидкиНаценки
	 ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации",   "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи",  "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыВидовБюджетов",              "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыСтатейИПоказателейБюджетов", "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Сценарии",  "ВначалеВсеЗапрещены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Дополнительный профиль, который назначается пользователям, выполняющим задачи ввода данных бюджетирования. 
								|При изменении и вводе бюджетов, анализируется наличие бюджетных задач, если включено управление бюджетным процессом.'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофильКонтролерБюджетирования(ОписанияПрофилей)
	
	// Профиль "Контролер бюджетирования (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "КонтролерБюджетирования";
	ОписаниеПрофиля.Идентификатор = "932703c7-6520-11e6-84c0-c860008a2a34";
	ОписаниеПрофиля.Родитель      = "Бюджетирование";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Контролер бюджетирования (дополнительный)'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхБюджетирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБюджетирования");
	ОписаниеПрофиля.Роли.Добавить("ФормированиеБюджетныхОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛимитовРасходаДенежныхСредств");
	
	
	// КИ.
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаБюджетированиеИПланирование");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации",   "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи",  "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыВидовБюджетов",              "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыСтатейИПоказателейБюджетов", "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Сценарии",  "ВначалеВсеЗапрещены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Дополнительный профиль, который назначается пользователям для просмотра бюджетов и формирования отчетов.'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофильКоординаторБюджетирования(ОписанияПрофилей)
	
	// Профиль "Координатор бюджетирования (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "КоординаторБюджетирования";
	ОписаниеПрофиля.Идентификатор = "932703c9-6520-11e6-84c0-c860008a2a34";
	ОписаниеПрофиля.Родитель      = "Бюджетирование";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Координатор бюджетирования (дополнительный)'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхБюджетирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБюджетирования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭкземпляровБюджетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗначенийНефинансовыхПоказателей");
	ОписаниеПрофиля.Роли.Добавить("УтверждениеЭкземпляровБюджетов");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеДанныхБюджетированияВнеДатЗапрета");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛимитовРасходаДенежныхСредств");
	
	
	// КИ.
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаБюджетированиеИПланирование");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации",   "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи",  "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыВидовБюджетов",              "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыСтатейИПоказателейБюджетов", "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Сценарии",  "ВначалеВсеЗапрещены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Дополнительный профиль, который назначается пользователям, выполняющим задачи ввода данных бюджетирования 
								|и управления бюджетным процессом. Изменения бюджетов возможны без наличия бюджетных задач и без учета дат запрета изменения данных'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофильУправлениеЛимитамиПоДаннымБюджетирования(ОписанияПрофилей)
	
	// Профиль "Управление лимитами по данным бюджетирования (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "УправлениеЛимитамиПоДаннымБюджетирования";
	ОписаниеПрофиля.Идентификатор = "17e62c67-8973-11e6-b5a9-c860008a2a34";
	ОписаниеПрофиля.Родитель      = "Бюджетирование";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Управление лимитами по данным бюджетирования (дополнительный)'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБюджетирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛимитовРасходаДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛимитовРасходаДенежныхСредств");
	
	
	// КИ.
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаБюджетированиеИПланирование");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации",   "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи",  "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыВидовБюджетов",              "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыСтатейИПоказателейБюджетов", "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Сценарии",  "ВначалеВсеЗапрещены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Дополнительный профиль, который назначается пользователям, выполняющим задачу настройки правил лимитов по данным бюджетирования'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

#КонецОбласти
//-- НЕ УХ

Процедура ДобавитьПрофильПроверкаФинансовыхДокументов(ОписанияПрофилей)

	// Профиль "Проверка финансовых документов".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "a2b75ba9-b01d-11ec-8c70-3c7c3fc28e23";
	ОписаниеПрофиля.Имя = "ПроверкаФинансовыхДокументов";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Проверка финансовых документов (дополнительный)'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	ОписаниеПрофиля.Описание =
		НСтр("ru = ''");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСтатусыПроверкиДокументов");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");

	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Дополнительный профиль к профилю ""Бухгалтер""'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

#КонецОбласти
