////////////////////////////////////////////////////////////////////////////////
// Содержит события форм, вызываемые на клиенте
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область СобытияЭлементовФорм

// Переопределяемая процедура, вызываемая из одноименного обработчика события элемента.
//
// Параметры:
//   Форма                   - ФормаКлиентскогоПриложения - форма, из которой происходит вызов процедуры.
//   Элемент                 - Произвольный     - элемент-источник события "При изменении".
//   ДополнительныеПараметры - Структура        - значения дополнительных параметров влияющих на обработку.
//
&После("ПриИзмененииЭлемента")
Процедура усПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры) Экспорт
	Если усОбслуживаниеФормВызовСервера.усЭтоФормаДляОтображенияСтоимости(Форма.ИмяФормы) Тогда
		ДанныеСебестоимостиПоСтрокам = усОбслуживаниеФормВызовСервера.усОбновитьСебестоимостьМаржу(Форма.Объект);
		Для Каждого ДанныеСебестоимости Из ДанныеСебестоимостиПоСтрокам Цикл
			СтрокаТовары = Форма.Объект.Товары.НайтиПоИдентификатору(ДанныеСебестоимости.ИдентификаторСтрокиСебестоимость);
			Если СтрокаТовары <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(СтрокаТовары, ДанныеСебестоимости);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецОбласти
