#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриОпределенииНастроек(Настройки) Экспорт
     Настройки.НастроитьВариантыОтчета = Истина;
КонецПроцедуры

Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт

	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.усПродажиИСебестоимость);

	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПоНоменклатуре");
	ОписаниеВарианта.Описание = НСтр("ru = 'Продажи с себестоимостью по номенклатуре.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПоТП");
	ОписаниеВарианта.Описание = НСтр("ru = 'Продажи с себестоимостью по Торговым представителям.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПоПроизводителям");
	ОписаниеВарианта.Описание = НСтр("ru = 'Продажи с себестоимостью по производителям.'");

	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОбъемПродаж");
	ОписаниеВарианта.Описание = НСтр("ru = 'Продажи: количество, себестоимость и выручка по производителям и покупателям.'");
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли