
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("ВидНоменклатуры", ВидНоменклатуры);
	Параметры.Свойство("Описание", Описание);
	
	ЗаполнитьСписокОтборовПоСвойствам();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ЗаписатьИЗакрытьНаКлиенте", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборПоСвойствам

&НаКлиенте
Процедура ОтборПоСвойствамПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Если Копирование Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСвойствамПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ОтборПоСвойствам.ТекущиеДанные;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСвойствамСвойствоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтборПоСвойствам.ТекущиеДанные;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСвойствамУсловиеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтборПоСвойствам.ТекущиеДанные;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСвойствамУсловиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ОтборПоСвойствам.ТекущиеДанные;

	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСвойствамУсловиеОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСвойствамЗначениеИнтервалПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтборПоСвойствам.ТекущиеДанные;
	
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНастройку(Команда)
	
	ЗаписатьИЗакрытьНаКлиенте(Неопределено, Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОтборовПоСвойствам()
	
	
	Возврат; // пустой обработчик
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьНаКлиенте(Результат, ДополнительныеПараметры) Экспорт 
	
	ОчиститьСообщения();
	
	ЕстьОшибки = Ложь;
	ОтборПоСвойствамРезультат = Неопределено;
	
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Ложь;
	
	Закрыть(Новый Структура("ОтборПоСвойствам,Описание",ОтборПоСвойствамРезультат,Описание));
	
КонецПроцедуры

#КонецОбласти