
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ВнеоборотныеАктивыЛокализация.ПриСозданииНаСервере_ПанельСправочниковВнеоборотныеАктивы(ЭтаФорма);
	
	УправлениеЭлементами();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_НаборКонстант" Тогда
		// Изменены настройки программы в панелях администрирования
		УправлениеЭлементами();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьПоказателиНаработки(Команда)
	
	ОткрытьФорму("Справочник.ПоказателиНаработки.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГруппыФинансовогоУчетаВнеоборотныхАктивов(Команда)
	
	ОткрытьФорму("Справочник.ГруппыФинансовогоУчетаВнеоборотныхАктивов.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСобытияОС(Команда)
	
	ОткрытьФорму("Справочник.СобытияОС.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГруппыОС(Команда)
	
	
	Возврат; // В КА пустой обработчик.
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГруппыНМА(Команда)
	
	ОткрытьФорму("Справочник.ГруппыНМА.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЕГДС(Команда)
	//++ НЕ УТ
	ОткрытьФорму("Справочник.ЕдиницыГенерирующиеДенежныеСредства.Форма.ФормаСписка");
	//-- НЕ УТ
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКлассыОбъектовЭксплуатации(Команда)
	
	Возврат; // В КА пустой обработчик.

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбщиеВидыРемонтов(Команда)
	
	Возврат; // В КА пустой обработчик.

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВидыДефектов(Команда)
	
	Возврат; // В КА пустой обработчик.
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРемонтныеМероприятия(Команда)
	
	Возврат; // В КА пустой обработчик.

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКатегорииЭксплуатации(Команда)
		
	ОткрытьФорму("Справочник.КатегорииЭксплуатации.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриВыполненииКоманды(Команда)

	ВнеоборотныеАктивыКлиентЛокализация.ПриВыполненииКоманды_ПанельСправочниковВнеоборотныеАктивы(Команда, ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементами()

	ЕстьПраваКРемонтам = Ложь;
	
	Элементы.ОткрытьПоказателиНаработки.Видимость = 
		ПравоДоступа("Просмотр", Метаданные.Справочники.ПоказателиНаработки)
		И НЕ ЕстьПраваКРемонтам;
	
	Элементы.ОткрытьГруппыФинансовогоУчетаВнеоборотныхАктивов.Видимость = 
		ПравоДоступа("Просмотр", Метаданные.Справочники.ГруппыФинансовогоУчетаВнеоборотныхАктивов);

	Элементы.ОткрытьСобытияОС.Видимость = 
		ПравоДоступа("Просмотр", Метаданные.Справочники.СобытияОС);
	
	
	ВнеоборотныеАктивыЛокализация.УправлениеЭлементами_ПанельСправочниковВнеоборотныеАктивы(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти


