////////////////////////////////////////////////////////////////////////////////
// ЕдиныйНалоговыйСчетЛичныйКабинетВнутренний
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Функция ОсновнаяОрганизация() Экспорт
	
	Возврат ЕдиныйНалоговыйСчетЛичныйКабинет.ОсновнаяОрганизация();
	
КонецФункции

Функция ОсновнаяРегистрацияВНалоговомОргане(Организация) Экспорт
	
	Возврат ЕдиныйНалоговыйСчетЛичныйКабинет.ОсновнаяРегистрацияВНалоговомОргане(Организация);
	
КонецФункции

Функция ПодготовитьДанные(Параметры) Экспорт
	
	Возврат ЕдиныйНалоговыйСчетЛичныйКабинет.ПодготовитьДанные(Параметры);
	
КонецФункции

Процедура ПриСозданииНаСервере(Форма) Экспорт
	
	ЕдиныйНалоговыйСчетЛичныйКабинет.ПриСозданииНаСервере(Форма);
	
КонецПроцедуры

Процедура ПодготовитьФормуНаСервере(Форма) Экспорт
	
	ЕдиныйНалоговыйСчетЛичныйКабинет.ПодготовитьФормуНаСервере(Форма);
	
КонецПроцедуры

Процедура УправлениеФормой(Форма) Экспорт
	
	ЕдиныйНалоговыйСчетЛичныйКабинет.УправлениеФормой(Форма);
	
КонецПроцедуры

#КонецОбласти
