
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
//++ НЕ УТ
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ДополнительныеСвойства.Свойство("ИспользоватьПроизводство") Тогда
		
		ЗначениеКонстанты = Значение Или Константы.ИспользоватьУправлениеПроизводством2_2.Получить();
		
		МенеджерЗначения = Константы.ИспользоватьПроизводство.СоздатьМенеджерЗначения();
		МенеджерЗначения.Прочитать();
		Если МенеджерЗначения.Значение <> ЗначениеКонстанты Тогда
			МенеджерЗначения.Значение = ЗначениеКонстанты;
			МенеджерЗначения.ДополнительныеСвойства.Вставить("ИспользоватьУправлениеПроизводством");
			МенеджерЗначения.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
	
	УстановитьПривилегированныйРежим(Ложь);
//-- НЕ УТ
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
