#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция рвк_СвойстваПриобретениеИнтеркампани() Экспорт
	ИмяСвойста = "ПриобретениеТоваровИнтеркампани_99632521ff87417294fd4853ca9e1654";
	Результат = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", ИмяСвойста);
	Если Не ЗначениеЗаполнено(Результат) Тогда
		ВызватьИсключение "Не обнаружено доп. свойство " + ИмяСвойста;
	КонецЕсли;
	Возврат Результат;
КонецФункции
	
// Приобретение интеркампани.
// 
// Возвращаемое значение:
//  Произвольный - Приобретение интеркампани
Функция рвк_ПриобретениеИнтеркампани(РеализацияТоваровУслуг) Экспорт
	Результат = рвк_ОбщегоНазначения.ЗначениеСвойства(РеализацияТоваровУслуг, рвк_СвойстваПриобретениеИнтеркампани(), Неопределено);
	Возврат Результат;
КонецФункции

#КонецЕсли