////////////////////////////////////////////////////////////////////////////////
// ЕдиныйНалоговыйСчетЛичныйКабинетКлиентСервер
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Функция ТекстСлужебногоМаркераВЖР() Экспорт
	
	Возврат НСтр("ru = '#ДеталиОшибкиВыведены#'");
	
КонецФункции

Функция СтруктураПараметровВыполненияЗапроса() Экспорт
	
	Возврат ЕдиныйНалоговыйСчетИнтеграцияВызовСервера.СтруктураПараметровВыполненияЗапроса();
	
КонецФункции

#КонецОбласти
