
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ГраницаПоследовательности = усУправлениеПоследовательностью.ГраницаПоследовательности();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВосстановитьПоследовательность(Команда)
	ВосстановитьПоследовательностьНаСервере();
	ОбщегоНазначенияКлиент.СообщитьПользователю("Последовательность восстановлена");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВосстановитьПоследовательностьНаСервере()
	усУправлениеПоследовательностью.ВосстановитьПоследовательность();
	ГраницаПоследовательности = усУправлениеПоследовательностью.ГраницаПоследовательности();
КонецПроцедуры

#КонецОбласти