
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьГраницуПоследовательностиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ОбновитьГраницуПоследовательности", 5, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьГраницуПоследовательности() Экспорт
	ОбновитьГраницуПоследовательностиНаСервере();
КонецПроцедуры	

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВосстановитьПоследовательность(Команда)
	ВосстановитьПоследовательностьНаСервере();
	ОбщегоНазначенияКлиент.СообщитьПользователю("Последовательность восстановлена");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВариантыОтчетов(Команда)
	ОбновитьВариантыОтчетовНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьГраницуПоследовательностиНаСервере()
	ГраницаПоследовательности = усУправлениеПоследовательностью.ГраницаПоследовательности();
КонецПроцедуры

&НаСервере
Процедура ВосстановитьПоследовательностьНаСервере()
	усУправлениеПоследовательностью.ВосстановитьПоследовательность();
	ОбновитьГраницуПоследовательностиНаСервере();
КонецПроцедуры



&НаСервереБезКонтекста
Процедура ОбновитьВариантыОтчетовНаСервере()
	ВариантыОтчетов.Обновить();
КонецПроцедуры

#КонецОбласти