&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если (Параметры.Свойство("СтатьяРасходов")) Тогда
		СтатьяРасходовФильтр = Параметры.СтатьяРасходов;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "СтатьяРасходов", СтатьяРасходовФильтр);
		Заголовок = Строка(СтатьяРасходовФильтр);
		Элементы.НастройкаУпр.Заголовок =	Строка(СтатьяРасходовФильтр.ВариантРаспределенияРасходовУпр);
		Элементы.НастройкаРегл.Заголовок =	Строка(СтатьяРасходовФильтр.ВариантРаспределенияРасходовРегл);
		Элементы.НастройкаНУ.Заголовок =	Строка(СтатьяРасходовФильтр.ВариантРаспределенияРасходовНУ);
	КонецЕсли;
	
	ЭтоФормаНастройкиСтатьи = ЗначениеЗаполнено(СтатьяРасходовФильтр);
	
	// Видимость колонок
	Элементы.СтатьяРасходов.Видимость = НЕ ЭтоФормаНастройкиСтатьи;
	Элементы.СтатьяРасходовВариантРаспределенияРасходовУпр.Видимость =	НЕ ЭтоФормаНастройкиСтатьи;
	Элементы.СтатьяРасходовВариантРаспределенияРасходовРегл.Видимость =	НЕ ЭтоФормаНастройкиСтатьи;
	Элементы.СтатьяРасходовВариантРаспределенияРасходовНУ.Видимость =	НЕ ЭтоФормаНастройкиСтатьи;
	Элементы.НастройкаУпр.ОтображатьВШапке =	ЭтоФормаНастройкиСтатьи;
	Элементы.НастройкаРегл.ОтображатьВШапке =	ЭтоФормаНастройкиСтатьи;
	Элементы.НастройкаНУ.ОтображатьВШапке =	ЭтоФормаНастройкиСтатьи;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	Оповестить("ИзмененыНастройкиРаспределенияПостатейныхРасходов");
КонецПроцедуры
