#Область СлужебныйПрограммныйИнтерфейс

// Дополняет документы, которые не должны учитываться, как проверяемые. См. ПроверкаДокументовСервер.ИсключаемыеТипыДляПроверки
// 
// Параметры:
// 	ИсключаемыТипы - Массив Из Тип - Типы значения, которые не должны проверяться.
//
Процедура ДополнитьИсключаемыеТипыДляПроверки(ИсключаемыТипы) Экспорт
	
	//++ Локализация
	ИсключаемыТипы.Добавить(Тип("ДокументСсылка.ВводОстатковНДСПредъявленного"));
	ИсключаемыТипы.Добавить(Тип("ДокументСсылка.ВводОстатковТМЦВЭксплуатации"));
	ИсключаемыТипы.Добавить(Тип("ДокументСсылка.КорректировкаНалогообложенияНДСПартийТоваров"));
	ИсключаемыТипы.Добавить(Тип("ДокументСсылка.МаркировкаТоваровГИСМ"));
	ИсключаемыТипы.Добавить(Тип("ДокументСсылка.ПеремаркировкаТоваровГИСМ"));
	//++ НЕ УТ
	ИсключаемыТипы.Добавить(Тип("ДокументСсылка.АмортизацияНМА"));
	ИсключаемыТипы.Добавить(Тип("ДокументСсылка.АмортизацияОС"));
	ИсключаемыТипы.Добавить(Тип("ДокументСсылка.ВводОстатковВнеоборотныхАктивов"));
	ИсключаемыТипы.Добавить(Тип("ДокументСсылка.ВводОстатковРасходовПриУСН"));
	ИсключаемыТипы.Добавить(Тип("ДокументСсылка.ВводДанныхПоНалогуНаПрибыль"));
	ИсключаемыТипы.Добавить(Тип("ДокументСсылка.ВосстановлениеНДСПоОбъектамНедвижимости"));
	ИсключаемыТипы.Добавить(Тип("ДокументСсылка.КорректировкаРасчетовПоНалогам"));
	ИсключаемыТипы.Добавить(Тип("ДокументСсылка.НачислениеЕНП"));
	ИсключаемыТипы.Добавить(Тип("ДокументСсылка.ПогашениеСтоимостиТМЦВЭксплуатации"));
	ИсключаемыТипы.Добавить(Тип("ДокументСсылка.РегламентнаяОперация"));
	//-- НЕ УТ
	
	
	//-- Локализация
	
КонецПроцедуры

// Получает из переданного объекта (ссылки) массив реквизитов с типом "Организация" и дополняет переданный параметр "МассивОрганизаций".
//
//	Параметры:
//		МассивОрганизаций - Массив Из СправочникСсылка.Организации - массив Организаций для заполнения
//		ДокументИсточник - ДокументСсылка, ДокументОбъект - объект, реквизиты которого надо проанализировать на соответствие типу "Организация".
// 															Если передан объект - значение реквизиты считывается непосредственно из него, если передана ссылка -
//															- происходит обращение к данным базы запросом (см. ОбщегоНазначения.ЗначенияРеквизитовОбъекта)
//		УчитыватьУправленческуюОрганизацию - Булево - признак, определяющий, должна ли среди возвращаемого массива быть управленческая организация.
// 														Значение по умолчанию - истина;
//
Процедура ДополнитьМассивОрганизацийДокумента(МассивОрганизаций, ДокументИсточник, УчитыватьУправленческуюОрганизацию) Экспорт
	
	//++ Локализация
	ТипДокументаИсточник = ТипЗнч(ДокументИсточник);
	Если (ТипДокументаИсточник = Тип("ДокументОбъект.СчетФактураВыданный") 
			Или ТипДокументаИсточник = Тип("ДокументСсылка.СчетФактураВыданный"))
		И ЗначениеЗаполнено(ДокументИсточник.ДокументОснование) Тогда
		
		Для Каждого Организация Из ПроверкаДокументовСервер.МассивОрганизацийДокумента(ДокументИсточник.ДокументОснование) Цикл
			Если МассивОрганизаций.Найти(Организация) = Неопределено Тогда
				МассивОрганизаций.Добавить(Организация);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	//-- Локализация

КонецПроцедуры

#КонецОбласти